Public Member Functions | List of all members
CRhinoAnnotationSettings Class Reference
Rhino
3-19-03 LW changed to exported class More...
#include <rhinoSdkDocProperties.h>
 Public Member Functions
CRhinoAnnotationSettings ()
CRhinoAnnotationSettings (const ON_3dmAnnotationSettings &src)
~CRhinoAnnotationSettings ()
double  | DimScale () const
double  | ModelSpaceHatchScale () const
double  | ModelSpaceTextScale () const
BOOL  | operator!= (const CRhinoAnnotationSettings &other)
CRhinoAnnotationSettings &  | operator= (const ON_3dmAnnotationSettings &src)
BOOL  | operator== (const CRhinoAnnotationSettings &other)
the compare operators are used to test for changed settings More...
void  | SetDimScale (double scale)
void  | SetModelSpaceHatchScale (double scale)
void  | SetModelSpaceTextScale (double scale)
Detailed Description
3-19-03 LW changed to exported class
Copyright (c) 1993-2017 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. class CRhinoAnnotationSettings
Description: Doc scope settings that apply to annotation objectsMarch 22, 2010 - removed global dimstyle from Rhino 5 Dimscale is now part of DimStyles and this class is obsolete 27 Aug, 2010 - Lowell - CRhinoAnnotationSettings replaced by CRhinoAnnotationSettingsEx
Constructor & Destructor Documentation
◆ CRhinoAnnotationSettings() [1/2]
 CRhinoAnnotationSettings::CRhinoAnnotationSettings  |  ( |   | )
◆ ~CRhinoAnnotationSettings()
 CRhinoAnnotationSettings::~CRhinoAnnotationSettings  |  ( |   | )
◆ CRhinoAnnotationSettings() [2/2]
 CRhinoAnnotationSettings::CRhinoAnnotationSettings  |  ( |  const ON_3dmAnnotationSettings &  |  src | )
Member Function Documentation
◆ DimScale()
 double CRhinoAnnotationSettings::DimScale  |  ( |   | ) |   const
◆ ModelSpaceHatchScale()
 double CRhinoAnnotationSettings::ModelSpaceHatchScale  |  ( |   | ) |   const
◆ ModelSpaceTextScale()
 double CRhinoAnnotationSettings::ModelSpaceTextScale  |  ( |   | ) |   const
◆ operator!=()
 BOOL CRhinoAnnotationSettings::operator!=  |  ( |  const CRhinoAnnotationSettings &  |  other | )
◆ operator=()
 CRhinoAnnotationSettings& CRhinoAnnotationSettings::operator=  |  ( |  const ON_3dmAnnotationSettings &  |  src | )
◆ operator==()
 BOOL CRhinoAnnotationSettings::operator==  |  ( |  const CRhinoAnnotationSettings &  |  other | )
the compare operators are used to test for changed settings
◆ SetDimScale()
 void CRhinoAnnotationSettings::SetDimScale  |  ( |  double  |  scale | )
◆ SetModelSpaceHatchScale()
 void CRhinoAnnotationSettings::SetModelSpaceHatchScale  |  ( |  double  |  scale | )
◆ SetModelSpaceTextScale()
 void CRhinoAnnotationSettings::SetModelSpaceTextScale  |  ( |  double  |  scale | )