Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_FontGlyphOutlinePoint Class Reference
OpenNURBS
#include <opennurbs_font.h>
 Public Types
enum  | ContourPointType : ON__UINT8 {
 ContourPointType::Unset = 0, ContourPointType::MoveTo = 1, ContourPointType::LineTo = 2, ContourPointType::QuadraticBezierPoint = 3,
 ContourPointType::CubicBezierPoint = 4, ContourPointType::LineToCloseContour = 5
 }
 Public Member Functions
ON_FontGlyphOutlinePoint ()=default
ON_FontGlyphOutlinePoint (const ON_FontGlyphOutlinePoint &)=default
~ON_FontGlyphOutlinePoint ()=default
ON_FontGlyphOutlinePoint &  | operator= (const ON_FontGlyphOutlinePoint &)=default
 Static Public Member Functions
static ON_FontGlyphOutlinePoint::ContourPointType  | ContourPointTypeFromUnsigned (unsigned contour_point_type_as_unsigned)
 Public Attributes
ON__UINT8  | m_bToPoint = 0
ON__UINT16  | m_contour_index = 0
0 = unset. The first contour has m_contour_index = 1. More...
ON_2iPoint  | m_point = ON_2iPoint::Unset
ON_FontGlyphOutlinePoint::ContourPointType  | m_point_type = ContourPointType::Unset
 Static Public Attributes
static const ON_FontGlyphOutlinePoint  | Unset
Member Enumeration Documentation
◆ ContourPointType
 enum ON_FontGlyphOutlinePoint::ContourPointType : ON__UINT8
strong
Enumerator
Unset
MoveTo
LineTo
QuadraticBezierPoint
quadratic bezier (degree=2, order=3) control point.
CubicBezierPoint
cubic bezier (degree=3, order=4) control point.
LineToCloseContour
a line segment added to close an open contour. This is common. It does not indicate the glyph is a single stroke glyph.
Constructor & Destructor Documentation
◆ ON_FontGlyphOutlinePoint() [1/2]
 ON_FontGlyphOutlinePoint::ON_FontGlyphOutlinePoint  |  ( |   | )
default
◆ ~ON_FontGlyphOutlinePoint()
 ON_FontGlyphOutlinePoint::~ON_FontGlyphOutlinePoint  |  ( |   | )
default
◆ ON_FontGlyphOutlinePoint() [2/2]
 ON_FontGlyphOutlinePoint::ON_FontGlyphOutlinePoint  |  ( |  const ON_FontGlyphOutlinePoint &  |   | )
default
Member Function Documentation
◆ ContourPointTypeFromUnsigned()
 static ON_FontGlyphOutlinePoint::ContourPointType ON_FontGlyphOutlinePoint::ContourPointTypeFromUnsigned  |  ( |  unsigned  |  contour_point_type_as_unsigned | )
static
◆ operator=()
 ON_FontGlyphOutlinePoint& ON_FontGlyphOutlinePoint::operator=  |  ( |  const ON_FontGlyphOutlinePoint &  |   | )
default
Member Data Documentation
◆ m_bToPoint
 ON__UINT8 ON_FontGlyphOutlinePoint::m_bToPoint = 0
1 if the point is a move to, line to, or the start or end of a bezier segment. 0 otherwise
◆ m_contour_index
 ON__UINT16 ON_FontGlyphOutlinePoint::m_contour_index = 0
0 = unset. The first contour has m_contour_index = 1.
◆ m_point
 ON_2iPoint ON_FontGlyphOutlinePoint::m_point = ON_2iPoint::Unset
◆ m_point_type
 ON_FontGlyphOutlinePoint::ContourPointType ON_FontGlyphOutlinePoint::m_point_type = ContourPointType::Unset
◆ Unset
 const ON_FontGlyphOutlinePoint ON_FontGlyphOutlinePoint::Unset
static