Public Member Functions | List of all members
CRhRdkToneMapper_Logarithmic Class Reference
RDK
#include <RhRdkToneMappers.h>
 Inheritance diagram for CRhRdkToneMapper_Logarithmic:
 Public Member Functions
CRhRdkToneMapper_Logarithmic (float e=1.0f, float b=0.85f, float c=1.0f)
virtual  | ~CRhRdkToneMapper_Logarithmic ()
float  | Bias (void) const
float  | Contrast (void) const
float  | Exposure (void) const
virtual ON_wString  | GetFriendlyParamName (const wchar_t *wszParamName, bool bEnglish) const
virtual void  | GetParametersFromSection (const IRhRdk_XMLSection &section)
virtual void  | ProcessImage (CRhRdkHighDynamicRangeImage_RGB &image, CRhRdkProgress *pProgress)
void  | SetBias (float f)
void  | SetContrast (float f)
void  | SetExposure (float f)
virtual void  | SetParametersToSection (IRhRdk_XMLSection &section) const
 Public Member Functions inherited from CRhRdkToneMapper
virtual  | ~CRhRdkToneMapper ()
Constructor & Destructor Documentation
◆ CRhRdkToneMapper_Logarithmic()
 CRhRdkToneMapper_Logarithmic::CRhRdkToneMapper_Logarithmic  |  ( |  float  |  e = 1.0f,
|  float  |  b = 0.85f,
|  float  |  c = 1.0f
)
◆ ~CRhRdkToneMapper_Logarithmic()
 virtual CRhRdkToneMapper_Logarithmic::~CRhRdkToneMapper_Logarithmic  |  ( |   | )
virtual
Member Function Documentation
◆ Bias()
 float CRhRdkToneMapper_Logarithmic::Bias  |  ( |  void  |   | ) |   const
◆ Contrast()
 float CRhRdkToneMapper_Logarithmic::Contrast  |  ( |  void  |   | ) |   const
◆ Exposure()
 float CRhRdkToneMapper_Logarithmic::Exposure  |  ( |  void  |   | ) |   const
◆ GetFriendlyParamName()
 virtual ON_wString CRhRdkToneMapper_Logarithmic::GetFriendlyParamName  |  ( |  const wchar_t *  |  wszParamName,
|  bool  |  bEnglish
) |   |  const
virtual
Implements CRhRdkToneMapper.
◆ GetParametersFromSection()
 virtual void CRhRdkToneMapper_Logarithmic::GetParametersFromSection  |  ( |  const IRhRdk_XMLSection &  |  section | )
virtual
Implements CRhRdkToneMapper.
◆ ProcessImage()
 virtual void CRhRdkToneMapper_Logarithmic::ProcessImage  |  ( |  CRhRdkHighDynamicRangeImage_RGB &  |  image,
|  CRhRdkProgress *  |  pProgress
)
virtual
Implements CRhRdkToneMapper_ImageBased.
◆ SetBias()
 void CRhRdkToneMapper_Logarithmic::SetBias  |  ( |  float  |  f | )
◆ SetContrast()
 void CRhRdkToneMapper_Logarithmic::SetContrast  |  ( |  float  |  f | )
◆ SetExposure()
 void CRhRdkToneMapper_Logarithmic::SetExposure  |  ( |  float  |  f | )
◆ SetParametersToSection()
 virtual void CRhRdkToneMapper_Logarithmic::SetParametersToSection  |  ( |  IRhRdk_XMLSection &  |  section | ) |   const
virtual
Implements CRhRdkToneMapper.