Public Member Functions | Public Attributes | List of all members
ON_MappingTag Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MappingTag ()
int  | Compare (const ON_MappingTag &other, bool bCompareId=true, bool bCompareCRC=true, bool bCompareXform=true) const
void  | Default ()
void  | Dump (ON_TextLog &) const
bool  | IsDefaultSurfaceParameterMapping () const
bool  | IsSet () const
bool  | Read (ON_BinaryArchive &)
void  | Set (const ON_TextureMapping &mapping)
void  | SetDefaultSurfaceParameterMappingTag ()
void  | Transform (const ON_Xform &xform)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
ON__UINT32  | m_mapping_crc
ON_TextureMapping::MappingCRC() More...
ON_UUID  | m_mapping_id
ON_TextureMapping::m_mapping_id. More...
ON_TextureMapping::TYPE  | m_mapping_type
ON_TextureMapping::m_type. More...
ON_Xform  | m_mesh_xform
Constructor & Destructor Documentation
◆ ON_MappingTag()
 ON_MappingTag::ON_MappingTag  |  ( |   | )
Member Function Documentation
◆ Compare()
 int ON_MappingTag::Compare  |  ( |  const ON_MappingTag &  |  other,
|  bool  |  bCompareId = true,
|  bool  |  bCompareCRC = true,
|  bool  |  bCompareXform = true
) |   |  const
◆ Default()
 void ON_MappingTag::Default  |  ( |   | )
◆ Dump()
 void ON_MappingTag::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ IsDefaultSurfaceParameterMapping()
 bool ON_MappingTag::IsDefaultSurfaceParameterMapping  |  ( |   | ) |   const
Returns: True if the mapping tag is for a mapping with type ON_TextureMapping::srfp_mapping with m_uvw = identity.
◆ IsSet()
 bool ON_MappingTag::IsSet  |  ( |   | ) |   const
Returns: True if the mapping tag is set.
◆ Read()
 bool ON_MappingTag::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Set()
 void ON_MappingTag::Set  |  ( |  const ON_TextureMapping &  |  mapping | )
◆ SetDefaultSurfaceParameterMappingTag()
 void ON_MappingTag::SetDefaultSurfaceParameterMappingTag  |  ( |   | )
Description: Sets the tag to the value the meshes have that come out of ON_Brep::CreateMesh().
◆ Transform()
 void ON_MappingTag::Transform  |  ( |  const ON_Xform &  |  xform | )
◆ Write()
 bool ON_MappingTag::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_mapping_crc
 ON__UINT32 ON_MappingTag::m_mapping_crc
ON_TextureMapping::MappingCRC()
◆ m_mapping_id
 ON_UUID ON_MappingTag::m_mapping_id
ON_TextureMapping::m_mapping_id.
Identifies the mapping used to create the texture coordinates and records transformations applied to the mesh after the texture coordinates were calculated. If the texture mapping does not change when the mesh is transformed, then set m_mesh_xform to zero so that compares will work right.
◆ m_mapping_type
 ON_TextureMapping::TYPE ON_MappingTag::m_mapping_type
ON_TextureMapping::m_type.
◆ m_mesh_xform
 ON_Xform ON_MappingTag::m_mesh_xform