Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDVertexPtr Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
bool  | IsNull () const
ON_ComponentStatus  | Status () const
class ON_SubDVertex *  | Vertex () const
ON__UINT_PTR  | VertexPtrMark () const
 Static Public Member Functions
static class ON_SubDVertexPtr  | Create (const class ON_SubDVertex *vertex)
static class ON_SubDVertexPtr  | Create (const class ON_SubDComponentPtr &vertex_component)
static class ON_SubDVertexPtr  | Create (const class ON_SubDVertex *vertex, ON__UINT_PTR vertex_mark)
 Public Attributes
ON__UINT_PTR  | m_ptr
 Static Public Attributes
static const ON_SubDVertexPtr  | Null
Member Function Documentation
◆ Create() [1/3]
 static class ON_SubDVertexPtr ON_SubDVertexPtr::Create  |  ( |  const class ON_SubDVertex *  |  vertex | )
static
◆ Create() [2/3]
 static class ON_SubDVertexPtr ON_SubDVertexPtr::Create  |  ( |  const class ON_SubDComponentPtr &  |  vertex_component | )
static
◆ Create() [3/3]
 static class ON_SubDVertexPtr ON_SubDVertexPtr::Create  |  ( |  const class ON_SubDVertex *  |  vertex,
|  ON__UINT_PTR  |  vertex_mark
)
static
Parameters: vertex - [in] mark - [in] zero or one
◆ IsNull()
 bool ON_SubDVertexPtr::IsNull  |  ( |   | ) |   const
◆ Status()
 ON_ComponentStatus ON_SubDVertexPtr::Status  |  ( |   | ) |   const
◆ Vertex()
 class ON_SubDVertex* ON_SubDVertexPtr::Vertex  |  ( |   | ) |   const
◆ VertexPtrMark()
 ON__UINT_PTR ON_SubDVertexPtr::VertexPtrMark  |  ( |   | ) |   const
Member Data Documentation
◆ m_ptr
 ON__UINT_PTR ON_SubDVertexPtr::m_ptr
For performance reasons, m_ptr is not initialized and no constructors are declared or implemented. If you require initialization, then use x = ON_SubDVertexPtr::Null or x = ON_SubDVertexPtr::Create(...).
◆ Null
 const ON_SubDVertexPtr ON_SubDVertexPtr::Null
static