Public Types | Public Member Functions | Static Public Attributes | List of all members
ON_Color Class Reference
OpenNURBS
#include <opennurbs_color.h>
 Public Types
enum  | RGBA_byte_index : unsigned int { kRedByteIndex = 0, kGreenByteIndex = 1, kBlueByteIndex = 2, kAlphaByteIndex = 3 }
enum  | RGBA_shift : unsigned int
 Public Member Functions
ON_Color ()=default
ON_Color (const ON_Color &)=default
ON_Color (int red, int green, int blue)
Sets A = 0. More...
ON_Color (int red, int green, int blue, int alpha)
ON_Color (unsigned int colorref)
~ON_Color ()=default
int  | Alpha () const
( 0 to 255 ) (0 = opaque, 255 = transparent) More...
int  | Blue () const
( 0 to 255 ) More...
int  | Compare (const ON_Color &) const
< 0 if this < arg, 0 ir this==arg, > 0 if this > arg More...
double  | FractionAlpha () const
( 0.0 to 1.0 ) (0.0 = opaque, 1.0 = transparent) More...
double  | FractionBlue () const
( 0.0 to 1.0 ) More...
double  | FractionGreen () const
( 0.0 to 1.0 ) More...
double  | FractionRed () const
( 0.0 to 1.0 ) More...
int  | Green () const
( 0 to 255 ) More...
double  | Hue () const
operator unsigned int () const
Conversion to Windows COLORREF in little endian RGBA order. More...
ON_Color &  | operator= (const ON_Color &)=default
int  | Red () const
( 0 to 255 ) More...
double  | Saturation () const
Returns 0.0 (gray) to 1.0 (saturated) More...
void  | SetAlpha (int alpha)
void  | SetFractionalAlpha (double alpha)
void  | SetFractionalRGB (double red, double green, double blue)
void  | SetFractionalRGBA (double red, double green, double blue, double alpha)
input args More...
void  | SetHSV (double h, double s, double v)
void  | SetRGB (int red, int green, int blue)
void  | SetRGBA (int red, int green, int blue, int alpha)
double  | Value () const
Returns 0.0 (black) to 1.0 (white) More...
unsigned int  | WindowsRGB () const
 Static Public Attributes
static const ON_Color  | Black
0x00000000u More...
static const ON_Color  | Gray126
R = G = B = 128 (medium) More...
static const ON_Color  | Gray160
R = G = B = 160 (medium light) More...
static const ON_Color  | Gray230
R = G = B = 230 (light) More...
static const ON_Color  | SaturatedBlue
0x00FF0000u on little endan, 0x0000FF00u on big endian More...
static const ON_Color  | SaturatedCyan
0x00FFFF00u on little endan, 0x00FFFF00u on big endian More...
static const ON_Color  | SaturatedGreen
0x0000FF00u on little endan, 0x00FF0000u on big endian More...
static const ON_Color  | SaturatedMagenta
0x00FF00FFu on little endan, 0xFF00FF00u on big endian More...
static const ON_Color  | SaturatedRed
0x000000FFu on little endan, 0xFF000000u on big endian More...
static const ON_Color  | SaturatedYellow
0x0000FFFFu on little endan, 0xFFFF0000u on big endian More...
static const ON_Color  | UnsetColor
0xFFFFFFFFu More...
static const ON_Color  | White
0x00FFFFFFu on little endan, 0xFFFFFF00u on big endian More...
Detailed Description
NoKeywords
/ / Copyright (c) 1993-2012 Robert McNeel & Associates. All rights reserved. / OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert / McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete openNURBS copyright information see http://www.opennurbs.org. / //////////////////////////////////////////////////////////////
Class ON_Color
Member Enumeration Documentation
◆ RGBA_byte_index
 enum ON_Color::RGBA_byte_index : unsigned int
If you need to use byte indexing to convert RGBA components to and from an unsigned int ON_Color value and want your code to work on both little and big endian computers, then use the RGBA_byte_index enum.
unsigned int u; unsigned char* rgba = rbga[ON_Color::kRedByteIndex] = red value 0 to 255. rbga[ON_Color::kGreenByteIndex] = green value 0 to 255. rbga[ON_Color::kBlueByteIndex] = blue value 0 to 255. rbga[ON_Color::kAlphaByteIndex] = alpha value 0 to 255. ON_Color color = u;
Enumerator
kRedByteIndex
same for both little and big endian computers.
kGreenByteIndex
kBlueByteIndex
kAlphaByteIndex
◆ RGBA_shift
 enum ON_Color::RGBA_shift : unsigned int
If you need to use shifting to convert RGBA components to and from an unsigned int ON_COlor value and you want your code to work on both little and big endian computers, use the RGBA_shift enum.
unsigned int u = 0; u |= ((((unsigned int)red) & 0xFFU) << ON_Color::RGBA_shift::kRedShift); u |= ((((unsigned int)green) & 0xFFU) << ON_Color::RGBA_shift::kGreenShift); u |= ((((unsigned int)blue) & 0xFFU) << ON_Color::RGBA_shift::kBlueShift); u |= ((((unsigned int)alpha) & 0xFFU) << ON_Color::RGBA_shift::kAlphaShift); ON_Color color = u;
Constructor & Destructor Documentation
◆ ON_Color() [1/5]
 ON_Color::ON_Color  |  ( |   | )
default
◆ ~ON_Color()
 ON_Color::~ON_Color  |  ( |   | )
default
◆ ON_Color() [2/5]
 ON_Color::ON_Color  |  ( |  const ON_Color &  |   | )
default
◆ ON_Color() [3/5]
 ON_Color::ON_Color  |  ( |  int  |  red,
|  int  |  green,
|  int  |  blue
)
Sets A = 0.
Parameters
red | ( 0 to 255 )
green | ( 0 to 255 )
blue | ( 0 to 255 )
◆ ON_Color() [4/5]
 ON_Color::ON_Color  |  ( |  int  |  red,
|  int  |  green,
|  int  |  blue,
|  int  |  alpha
)
Parameters
red | ( 0 to 255 )
green | ( 0 to 255 )
blue | ( 0 to 255 )
alpha | ( 0 to 255 ) (0 = opaque, 255 = transparent)
◆ ON_Color() [5/5]
 ON_Color::ON_Color  |  ( |  unsigned int  |  colorref | )
Parameters: colorref - [in] Windows COLORREF in little endian RGBA order.
Member Function Documentation
◆ Alpha()
 int ON_Color::Alpha  |  ( |   | ) |   const
( 0 to 255 ) (0 = opaque, 255 = transparent)
◆ Blue()
 int ON_Color::Blue  |  ( |   | ) |   const
( 0 to 255 )
◆ Compare()
 int ON_Color::Compare  |  ( |  const ON_Color &  |   | ) |   const
< 0 if this < arg, 0 ir this==arg, > 0 if this > arg
◆ FractionAlpha()
 double ON_Color::FractionAlpha  |  ( |   | ) |   const
( 0.0 to 1.0 ) (0.0 = opaque, 1.0 = transparent)
◆ FractionBlue()
 double ON_Color::FractionBlue  |  ( |   | ) |   const
( 0.0 to 1.0 )
◆ FractionGreen()
 double ON_Color::FractionGreen  |  ( |   | ) |   const
( 0.0 to 1.0 )
◆ FractionRed()
 double ON_Color::FractionRed  |  ( |   | ) |   const
( 0.0 to 1.0 )
◆ Green()
 int ON_Color::Green  |  ( |   | ) |   const
( 0 to 255 )
◆ Hue()
 double ON_Color::Hue  |  ( |   | ) |   const
Hue() returns an angle in the range 0 to 2*pi
      0 = red, pi/3 = yellow, 2*pi/3 = green,
      pi = cyan, 4*pi/3 = blue,5*pi/3 = magenta,
      2*pi = red
◆ operator unsigned int()
 ON_Color::operator unsigned int  |  ( |   | ) |   const
Conversion to Windows COLORREF in little endian RGBA order.
◆ operator=()
 ON_Color& ON_Color::operator=  |  ( |  const ON_Color &  |   | )
default
◆ Red()
 int ON_Color::Red  |  ( |   | ) |   const
( 0 to 255 )
◆ Saturation()
 double ON_Color::Saturation  |  ( |   | ) |   const
Returns 0.0 (gray) to 1.0 (saturated)
◆ SetAlpha()
 void ON_Color::SetAlpha  |  ( |  int  |  alpha | )
Parameters
alpha | alpha in range 0 to 255 (0 = opaque, 255 = transparent)
◆ SetFractionalAlpha()
 void ON_Color::SetFractionalAlpha  |  ( |  double  |  alpha | )
Parameters
alpha | alpha in range 0.0 to 1.0 (0.0 = opaque, 1.0 = transparent)
◆ SetFractionalRGB()
 void ON_Color::SetFractionalRGB  |  ( |  double  |  red,
|  double  |  green,
|  double  |  blue
)
Parameters
red | red in range 0.0 to 1.0
green | green in range 0.0 to 1.0
blue | blue in range 0.0 to 1.0
◆ SetFractionalRGBA()
 void ON_Color::SetFractionalRGBA  |  ( |  double  |  red,
|  double  |  green,
|  double  |  blue,
|  double  |  alpha
)
input args
Parameters
red | red in range 0.0 to 1.0
green | green in range 0.0 to 1.0
blue | blue in range 0.0 to 1.0
alpha | alpha in range 0.0 to 1.0 (0.0 = opaque, 1.0 = transparent)
◆ SetHSV()
 void ON_Color::SetHSV  |  ( |  double  |  h,
|  double  |  s,
|  double  |  v
)
Parameters
h | hue in radians 0 to 2*pi
s | satuation 0.0 = gray, 1.0 = saturated
v | value
◆ SetRGB()
 void ON_Color::SetRGB  |  ( |  int  |  red,
|  int  |  green,
|  int  |  blue
)
Parameters
red | red in range 0 to 255
green | green in range 0 to 255
blue | blue in range 0 to 255
◆ SetRGBA()
 void ON_Color::SetRGBA  |  ( |  int  |  red,
|  int  |  green,
|  int  |  blue,
|  int  |  alpha
)
Parameters
red | red in range 0 to 255
green | green in range 0 to 255
blue | blue in range 0 to 255
alpha | alpha in range 0 to 255 (0 = opaque, 255 = transparent)
◆ Value()
 double ON_Color::Value  |  ( |   | ) |   const
Returns 0.0 (black) to 1.0 (white)
◆ WindowsRGB()
 unsigned int ON_Color::WindowsRGB  |  ( |   | ) |   const
Description: Call this function when the color is needed in a Windows COLORREF format with alpha = 0; Returns A Windows COLOREF with alpha = 0.
Member Data Documentation
◆ Black
 const ON_Color ON_Color::Black
static
0x00000000u
◆ Gray126
 const ON_Color ON_Color::Gray126
static
R = G = B = 128 (medium)
◆ Gray160
 const ON_Color ON_Color::Gray160
static
R = G = B = 160 (medium light)
◆ Gray230
 const ON_Color ON_Color::Gray230
static
R = G = B = 230 (light)
◆ m_color
 unsigned int ON_Color::m_color = 0
On little endian (Intel) computers, m_color has the same byte order as Windows COLORREF values. On little endian computers, m_color = 0xaabbggrr as an unsigned int value. On big endian computers, m_color = 0xrrggbbaa as an unsigned int value rr = red component 0-255 gg = grean component 0-255 bb = blue component 0-255 aa = alpha 0-255. 0 means opaque, 255 means transparent.
◆ m_RGBA
 unsigned char ON_Color::m_RGBA[4]
m_colorComponent is a 4 unsigned byte array in RGBA order red component = m_RGBA[ON_Color::RGBA_byte::kRed] grean component = m_RGBA[ON_Color::RGBA_byte::kGreen] blue component = m_RGBA[ON_Color::RGBA_byte::kBlue] alpha component = m_RGBA[ON_Color::RGBA_byte::kAlpha]
◆ SaturatedBlue
 const ON_Color ON_Color::SaturatedBlue
static
0x00FF0000u on little endan, 0x0000FF00u on big endian
◆ SaturatedCyan
 const ON_Color ON_Color::SaturatedCyan
static
0x00FFFF00u on little endan, 0x00FFFF00u on big endian
◆ SaturatedGreen
 const ON_Color ON_Color::SaturatedGreen
static
0x0000FF00u on little endan, 0x00FF0000u on big endian
◆ SaturatedMagenta
 const ON_Color ON_Color::SaturatedMagenta
static
0x00FF00FFu on little endan, 0xFF00FF00u on big endian
◆ SaturatedRed
 const ON_Color ON_Color::SaturatedRed
static
0x000000FFu on little endan, 0xFF000000u on big endian
◆ SaturatedYellow
 const ON_Color ON_Color::SaturatedYellow
static
0x0000FFFFu on little endan, 0xFFFF0000u on big endian
◆ UnsetColor
 const ON_Color ON_Color::UnsetColor
static
0xFFFFFFFFu
◆ White
 const ON_Color ON_Color::White
static
0x00FFFFFFu on little endan, 0xFFFFFF00u on big endian