Public Types | Public Member Functions | List of all members
CRhRdkRendererSupportOptions Class Reference
RDK
#include <RhRdkRendererSupportOptions.h>
 Public Types
enum  | {
 size1 = 128, size2 = 256, size3 = 512, size4 = 1024,
 size5 = 2048
 }
enum  | eInitialLocation { render_content, last_opened_folder, custom_folder }
 Public Member Functions
CRhRdkRendererSupportOptions ()
virtual  | ~CRhRdkRendererSupportOptions ()
virtual bool  | AlwaysShowSunPreview (void) const
virtual int  | AutoSaveKeepAmount (void) const
virtual bool  | AutoSaveRenderings (void) const
virtual bool  | CheckSupportFilesBeforeRendering (void) const
virtual bool  | CombineEditors (void) const
virtual ON_wString  | CustomLibraryPath (void) const
virtual ON_wString  | CustomPaths (void) const
virtual COLORREF  | DarkPreviewCheckerColor (void) const
virtual bool  | EnablePreviewJobLog (void) const
virtual void *  | EVF (const wchar_t *, void *)
virtual bool  | HarvestContentParameters (void) const
virtual int  | LabelFormatLoc (void) const
virtual int  | LabelFormatUTC (void) const
LPITEMIDLIST  | LastNavigatedLocation (void) const
virtual eInitialLocation  | LibrariesInitialLocation (void) const
virtual ON_wString  | LibrariesInitialLocationCustomFolder (void) const
virtual COLORREF  | LightPreviewCheckerColor (void) const
virtual int  | MaxPreviewCacheMB (void) const
virtual int  | MaxPreviewSeconds (void) const
virtual bool  | MultithreadedTextureEvaluation (void) const
virtual bool  | PreferNativeRenderer (void) const
virtual ON_wString  | PreferredUnpackFolder (void) const
virtual bool  | PreviewCustomRenderMeshes (void) const
virtual void  | SetAlwaysShowSunPreview (bool b)
virtual void  | SetAutoSaveKeepAmount (int value)
virtual void  | SetAutoSaveRenderings (bool b)
virtual void  | SetCheckSupportFilesBeforeRendering (bool b)
virtual void  | SetCombineEditors (bool b)
virtual void  | SetCustomLibraryPath (const wchar_t *wszPath)
virtual void  | SetCustomPaths (const wchar_t *wszPath)
virtual void  | SetHarvestContentParameters (bool b)
virtual void  | SetLabelFormatLoc (int value)
virtual void  | SetLabelFormatUTC (int value)
void  | SetLastNavigatedLocation (LPCITEMIDLIST pidl)
virtual void  | SetLibrariesInitialLocation (eInitialLocation l)
virtual void  | SetLibrariesInitialLocationCustomFolder (const wchar_t *wszPath)
virtual void  | SetMultithreadedTextureEvaluation (bool b)
virtual void  | SetPreferNativeRenderer (bool b)
virtual void  | SetPreferredUnpackFolder (const wchar_t *wszPath)
virtual void  | SetPreviewCustomRenderMeshes (bool b)
virtual void  | SetShowCustom (bool b)
virtual void  | SetShowDetailsPanel (bool b)
virtual void  | SetShowDocuments (bool b)
virtual void  | SetShowRenderContent (bool b)
virtual RDK_DEPRECATED void  | SetTextureSize (int size, bool bSendEvent=true)
virtual void  | SetUseDefaultLibraryPath (bool bUseDefault)
virtual void  | SetUsePreviewCache (bool b)
virtual void  | SetUseQuickInitialPreview (bool b)
virtual bool  | ShowCustom (void) const
virtual bool  | ShowDetailsPanel (void) const
virtual bool  | ShowDocuments (void) const
virtual bool  | ShowRenderContent (void) const
virtual int  | TextureSize (void) const
virtual bool  | UseDefaultLibraryPath (void) const
virtual bool  | UsePreview (void) const
virtual bool  | UsePreviewCache (void) const
virtual bool  | UseQuickInitialPreview (void) const
virtual bool  | UseRenderedPreview (void) const
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
size1
size2
size3
size4
size5
◆ eInitialLocation
 enum CRhRdkRendererSupportOptions::eInitialLocation
Enumerator
render_content
last_opened_folder
custom_folder
Constructor & Destructor Documentation
◆ CRhRdkRendererSupportOptions()
 CRhRdkRendererSupportOptions::CRhRdkRendererSupportOptions  |  ( |   | )
◆ ~CRhRdkRendererSupportOptions()
 virtual CRhRdkRendererSupportOptions::~CRhRdkRendererSupportOptions  |  ( |   | )
virtual
Member Function Documentation
◆ AlwaysShowSunPreview()
 virtual bool CRhRdkRendererSupportOptions::AlwaysShowSunPreview  |  ( |  void  |   | ) |   const
virtual
◆ AutoSaveKeepAmount()
 virtual int CRhRdkRendererSupportOptions::AutoSaveKeepAmount  |  ( |  void  |   | ) |   const
virtual
◆ AutoSaveRenderings()
 virtual bool CRhRdkRendererSupportOptions::AutoSaveRenderings  |  ( |  void  |   | ) |   const
virtual
◆ CheckSupportFilesBeforeRendering()
 virtual bool CRhRdkRendererSupportOptions::CheckSupportFilesBeforeRendering  |  ( |  void  |   | ) |   const
virtual
◆ CombineEditors()
 virtual bool CRhRdkRendererSupportOptions::CombineEditors  |  ( |  void  |   | ) |   const
virtual
◆ CustomLibraryPath()
 virtual ON_wString CRhRdkRendererSupportOptions::CustomLibraryPath  |  ( |  void  |   | ) |   const
virtual
◆ CustomPaths()
 virtual ON_wString CRhRdkRendererSupportOptions::CustomPaths  |  ( |  void  |   | ) |   const
virtual
◆ DarkPreviewCheckerColor()
 virtual COLORREF CRhRdkRendererSupportOptions::DarkPreviewCheckerColor  |  ( |  void  |   | ) |   const
virtual
◆ EnablePreviewJobLog()
 virtual bool CRhRdkRendererSupportOptions::EnablePreviewJobLog  |  ( |  void  |   | ) |   const
virtual
◆ EVF()
 virtual void* CRhRdkRendererSupportOptions::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
Emergency virtual function for future expansion.
◆ HarvestContentParameters()
 virtual bool CRhRdkRendererSupportOptions::HarvestContentParameters  |  ( |  void  |   | ) |   const
virtual
◆ LabelFormatLoc()
 virtual int CRhRdkRendererSupportOptions::LabelFormatLoc  |  ( |  void  |   | ) |   const
virtual
◆ LabelFormatUTC()
 virtual int CRhRdkRendererSupportOptions::LabelFormatUTC  |  ( |  void  |   | ) |   const
virtual
◆ LastNavigatedLocation()
 LPITEMIDLIST CRhRdkRendererSupportOptions::LastNavigatedLocation  |  ( |  void  |   | ) |   const
◆ LibrariesInitialLocation()
 virtual eInitialLocation CRhRdkRendererSupportOptions::LibrariesInitialLocation  |  ( |  void  |   | ) |   const
virtual
◆ LibrariesInitialLocationCustomFolder()
 virtual ON_wString CRhRdkRendererSupportOptions::LibrariesInitialLocationCustomFolder  |  ( |  void  |   | ) |   const
virtual
◆ LightPreviewCheckerColor()
 virtual COLORREF CRhRdkRendererSupportOptions::LightPreviewCheckerColor  |  ( |  void  |   | ) |   const
virtual
◆ MaxPreviewCacheMB()
 virtual int CRhRdkRendererSupportOptions::MaxPreviewCacheMB  |  ( |  void  |   | ) |   const
virtual
◆ MaxPreviewSeconds()
 virtual int CRhRdkRendererSupportOptions::MaxPreviewSeconds  |  ( |  void  |   | ) |   const
virtual
◆ MultithreadedTextureEvaluation()
 virtual bool CRhRdkRendererSupportOptions::MultithreadedTextureEvaluation  |  ( |  void  |   | ) |   const
virtual
◆ PreferNativeRenderer()
 virtual bool CRhRdkRendererSupportOptions::PreferNativeRenderer  |  ( |  void  |   | ) |   const
virtual
◆ PreferredUnpackFolder()
 virtual ON_wString CRhRdkRendererSupportOptions::PreferredUnpackFolder  |  ( |  void  |   | ) |   const
virtual
◆ PreviewCustomRenderMeshes()
 virtual bool CRhRdkRendererSupportOptions::PreviewCustomRenderMeshes  |  ( |  void  |   | ) |   const
virtual
◆ SetAlwaysShowSunPreview()
 virtual void CRhRdkRendererSupportOptions::SetAlwaysShowSunPreview  |  ( |  bool  |  b | )
virtual
◆ SetAutoSaveKeepAmount()
 virtual void CRhRdkRendererSupportOptions::SetAutoSaveKeepAmount  |  ( |  int  |  value | )
virtual
◆ SetAutoSaveRenderings()
 virtual void CRhRdkRendererSupportOptions::SetAutoSaveRenderings  |  ( |  bool  |  b | )
virtual
◆ SetCheckSupportFilesBeforeRendering()
 virtual void CRhRdkRendererSupportOptions::SetCheckSupportFilesBeforeRendering  |  ( |  bool  |  b | )
virtual
◆ SetCombineEditors()
 virtual void CRhRdkRendererSupportOptions::SetCombineEditors  |  ( |  bool  |  b | )
virtual
◆ SetCustomLibraryPath()
 virtual void CRhRdkRendererSupportOptions::SetCustomLibraryPath  |  ( |  const wchar_t *  |  wszPath | )
virtual
◆ SetCustomPaths()
 virtual void CRhRdkRendererSupportOptions::SetCustomPaths  |  ( |  const wchar_t *  |  wszPath | )
virtual
◆ SetHarvestContentParameters()
 virtual void CRhRdkRendererSupportOptions::SetHarvestContentParameters  |  ( |  bool  |  b | )
virtual
◆ SetLabelFormatLoc()
 virtual void CRhRdkRendererSupportOptions::SetLabelFormatLoc  |  ( |  int  |  value | )
virtual
◆ SetLabelFormatUTC()
 virtual void CRhRdkRendererSupportOptions::SetLabelFormatUTC  |  ( |  int  |  value | )
virtual
◆ SetLastNavigatedLocation()
 void CRhRdkRendererSupportOptions::SetLastNavigatedLocation  |  ( |  LPCITEMIDLIST  |  pidl | )
◆ SetLibrariesInitialLocation()
 virtual void CRhRdkRendererSupportOptions::SetLibrariesInitialLocation  |  ( |  eInitialLocation  |  l | )
virtual
◆ SetLibrariesInitialLocationCustomFolder()
 virtual void CRhRdkRendererSupportOptions::SetLibrariesInitialLocationCustomFolder  |  ( |  const wchar_t *  |  wszPath | )
virtual
◆ SetMultithreadedTextureEvaluation()
 virtual void CRhRdkRendererSupportOptions::SetMultithreadedTextureEvaluation  |  ( |  bool  |  b | )
virtual
◆ SetPreferNativeRenderer()
 virtual void CRhRdkRendererSupportOptions::SetPreferNativeRenderer  |  ( |  bool  |  b | )
virtual
◆ SetPreferredUnpackFolder()
 virtual void CRhRdkRendererSupportOptions::SetPreferredUnpackFolder  |  ( |  const wchar_t *  |  wszPath | )
virtual
◆ SetPreviewCustomRenderMeshes()
 virtual void CRhRdkRendererSupportOptions::SetPreviewCustomRenderMeshes  |  ( |  bool  |  b | )
virtual
◆ SetShowCustom()
 virtual void CRhRdkRendererSupportOptions::SetShowCustom  |  ( |  bool  |  b | )
virtual
◆ SetShowDetailsPanel()
 virtual void CRhRdkRendererSupportOptions::SetShowDetailsPanel  |  ( |  bool  |  b | )
virtual
◆ SetShowDocuments()
 virtual void CRhRdkRendererSupportOptions::SetShowDocuments  |  ( |  bool  |  b | )
virtual
◆ SetShowRenderContent()
 virtual void CRhRdkRendererSupportOptions::SetShowRenderContent  |  ( |  bool  |  b | )
virtual
◆ SetTextureSize()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetTextureSize  |  ( |  int  |  size,
|  bool  |  bSendEvent = true
)
virtual
◆ SetUseDefaultLibraryPath()
 virtual void CRhRdkRendererSupportOptions::SetUseDefaultLibraryPath  |  ( |  bool  |  bUseDefault | )
virtual
◆ SetUsePreviewCache()
 virtual void CRhRdkRendererSupportOptions::SetUsePreviewCache  |  ( |  bool  |  b | )
virtual
◆ SetUseQuickInitialPreview()
 virtual void CRhRdkRendererSupportOptions::SetUseQuickInitialPreview  |  ( |  bool  |  b | )
virtual
◆ ShowCustom()
 virtual bool CRhRdkRendererSupportOptions::ShowCustom  |  ( |  void  |   | ) |   const
virtual
◆ ShowDetailsPanel()
 virtual bool CRhRdkRendererSupportOptions::ShowDetailsPanel  |  ( |  void  |   | ) |   const
virtual
◆ ShowDocuments()
 virtual bool CRhRdkRendererSupportOptions::ShowDocuments  |  ( |  void  |   | ) |   const
virtual
◆ ShowRenderContent()
 virtual bool CRhRdkRendererSupportOptions::ShowRenderContent  |  ( |  void  |   | ) |   const
virtual
◆ TextureSize()
 virtual int CRhRdkRendererSupportOptions::TextureSize  |  ( |  void  |   | ) |   const
virtual
◆ UseDefaultLibraryPath()
 virtual bool CRhRdkRendererSupportOptions::UseDefaultLibraryPath  |  ( |  void  |   | ) |   const
virtual
◆ UsePreview()
 virtual bool CRhRdkRendererSupportOptions::UsePreview  |  ( |  void  |   | ) |   const
virtual
◆ UsePreviewCache()
 virtual bool CRhRdkRendererSupportOptions::UsePreviewCache  |  ( |  void  |   | ) |   const
virtual
◆ UseQuickInitialPreview()
 virtual bool CRhRdkRendererSupportOptions::UseQuickInitialPreview  |  ( |  void  |   | ) |   const
virtual
◆ UseRenderedPreview()
 virtual bool CRhRdkRendererSupportOptions::UseRenderedPreview  |  ( |  void  |   | ) |   const
virtual