Public Member Functions | List of all members
ON_MMX_Polyline Class Reference
OpenNURBS
#include <opennurbs_plus.h>
 Inheritance diagram for ON_MMX_Polyline:
 Public Member Functions
ON_MMX_Polyline ()
see ON_SimpleArray class definition comments for constructor documentation More...
ON_MMX_Polyline (int)
ON_MMX_Polyline (const ON_SimpleArray< ON_MMX_POINT > &)
int  | Clean (double tolerance=0.0)
ON_MMX_Polyline &  | operator= (const ON_MMX_Polyline &)
 Public Member Functions inherited from ON_SimpleArray< ON_MMX_POINT >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_MMX_POINT > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_MMX_POINT &)
void  | Append (int, const ON_MMX_POINT *)
Append copy of an array T[count]. More...
ON_MMX_POINT &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_MMX_POINT *  | Array ()
The Array() function return the. More...
const ON_MMX_POINT *  | Array () const
m_a pointer value. More...
ON_MMX_POINT *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_MMX_POINT *  | At (unsigned int)
ON_MMX_POINT *  | At (ON__INT64)
ON_MMX_POINT *  | At (ON__UINT64)
const ON_MMX_POINT *  | At (int) const
const ON_MMX_POINT *  | At (unsigned int) const
const ON_MMX_POINT *  | At (ON__INT64) const
const ON_MMX_POINT *  | At (ON__UINT64) const
int  | BinarySearch (const ON_MMX_POINT *, int(*)(const ON_MMX_POINT *, const ON_MMX_POINT *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
int  | BinarySearch (const ON_MMX_POINT *, int(*)(const ON_MMX_POINT *, const ON_MMX_POINT *), int) const
int  | Capacity () const
capacity of array More...
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_MMX_POINT *  | First ()
const ON_MMX_POINT *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*)(const ON_MMX_POINT *, const ON_MMX_POINT *))
void  | Insert (int, const ON_MMX_POINT &)
ON_MMX_POINT *  | KeepArray ()
ON_MMX_POINT *  | Last ()
const ON_MMX_POINT *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_MMX_POINT * () const
operator ON_MMX_POINT * ()
The cast operators return a pointer. More...
ON_SimpleArray< ON_MMX_POINT > &  | operator= (const ON_SimpleArray< ON_MMX_POINT > &)
ON_MMX_POINT &  | operator[] (int)
ON_MMX_POINT &  | operator[] (unsigned int)
ON_MMX_POINT &  | operator[] (ON__INT64)
ON_MMX_POINT &  | operator[] (ON__UINT64)
const ON_MMX_POINT &  | operator[] (int) const
const ON_MMX_POINT &  | operator[] (unsigned int) const
const ON_MMX_POINT &  | operator[] (ON__INT64) const
const ON_MMX_POINT &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const ON_MMX_POINT *, const ON_MMX_POINT *))
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
virtual ON_MMX_POINT *  | Realloc (ON_MMX_POINT *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
ON_MMX_POINT *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_MMX_POINT &) const
int  | Search (const ON_MMX_POINT *, int(*)(const ON_MMX_POINT *, const ON_MMX_POINT *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
void  | SetArray (ON_MMX_POINT *)
void  | SetArray (ON_MMX_POINT *, int, int)
ON_MMX_POINT *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_MMX_POINT *, const ON_MMX_POINT *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_MMX_POINT *, const ON_MMX_POINT *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_MMX_POINT >
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_MMX_POINT >
ON_MMX_POINT *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_MMX_Polyline() [1/3]
 ON_MMX_Polyline::ON_MMX_Polyline  |  ( |   | )
see ON_SimpleArray class definition comments for constructor documentation
◆ ON_MMX_Polyline() [2/3]
 ON_MMX_Polyline::ON_MMX_Polyline  |  ( |  int  |   | )
◆ ON_MMX_Polyline() [3/3]
 ON_MMX_Polyline::ON_MMX_Polyline  |  ( |  const ON_SimpleArray< ON_MMX_POINT > &  |   | )
Member Function Documentation
◆ Clean()
 int ON_MMX_Polyline::Clean  |  ( |  double  |  tolerance = 0.0 | )
Description: Removes duplicate points that result in zero length segments. Parameters: tolerance - [in] tolerance used to check for duplicate points. Returns: Number of points removed. Remarks: If the distance between points polyline[i] and polyline[i+1] is <= tolerance, then the point with index (i+1) is removed.
◆ operator=()
 ON_MMX_Polyline& ON_MMX_Polyline::operator=  |  ( |  const ON_MMX_Polyline &  |   | )