Public Member Functions | List of all members
ON_3dVectorArray Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Inheritance diagram for ON_3dVectorArray:
 Public Member Functions
ON_3dVectorArray ()
ON_3dVectorArray (int)
ON_3dVectorArray (const ON_3dVectorArray &)
bool  | GetBBox (double boxmin[3], double boxmax[3], bool bGrowBow=false) const
ON_3dVectorArray &  | operator= (const ON_3dVectorArray &)
bool  | SwapCoordinates (int, int)
bool  | Transform (const ON_Xform &)
 Public Member Functions inherited from ON_SimpleArray< ON_3dVector >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_3dVector > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_3dVector &)
void  | Append (int, const ON_3dVector *)
Append copy of an array T[count]. More...
ON_3dVector &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_3dVector *  | Array ()
The Array() function return the. More...
const ON_3dVector *  | Array () const
m_a pointer value. More...
ON_3dVector *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_3dVector *  | At (unsigned int)
ON_3dVector *  | At (ON__INT64)
ON_3dVector *  | At (ON__UINT64)
const ON_3dVector *  | At (int) const
const ON_3dVector *  | At (unsigned int) const
const ON_3dVector *  | At (ON__INT64) const
const ON_3dVector *  | At (ON__UINT64) const
int  | BinarySearch (const ON_3dVector *, int(*)(const ON_3dVector *, const ON_3dVector *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
int  | BinarySearch (const ON_3dVector *, int(*)(const ON_3dVector *, const ON_3dVector *), int) const
int  | Capacity () const
capacity of array More...
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_3dVector *  | First ()
const ON_3dVector *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*)(const ON_3dVector *, const ON_3dVector *))
void  | Insert (int, const ON_3dVector &)
ON_3dVector *  | KeepArray ()
ON_3dVector *  | Last ()
const ON_3dVector *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_3dVector * () const
operator ON_3dVector * ()
The cast operators return a pointer. More...
ON_SimpleArray< ON_3dVector > &  | operator= (const ON_SimpleArray< ON_3dVector > &)
ON_3dVector &  | operator[] (int)
ON_3dVector &  | operator[] (unsigned int)
ON_3dVector &  | operator[] (ON__INT64)
ON_3dVector &  | operator[] (ON__UINT64)
const ON_3dVector &  | operator[] (int) const
const ON_3dVector &  | operator[] (unsigned int) const
const ON_3dVector &  | operator[] (ON__INT64) const
const ON_3dVector &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const ON_3dVector *, const ON_3dVector *))
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
virtual ON_3dVector *  | Realloc (ON_3dVector *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
ON_3dVector *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_3dVector &) const
int  | Search (const ON_3dVector *, int(*)(const ON_3dVector *, const ON_3dVector *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
void  | SetArray (ON_3dVector *)
void  | SetArray (ON_3dVector *, int, int)
ON_3dVector *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_3dVector *, const ON_3dVector *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_3dVector *, const ON_3dVector *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_3dVector >
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_3dVector >
ON_3dVector *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_3dVectorArray() [1/3]
 ON_3dVectorArray::ON_3dVectorArray  |  ( |   | )
◆ ON_3dVectorArray() [2/3]
 ON_3dVectorArray::ON_3dVectorArray  |  ( |  int  |   | )
◆ ON_3dVectorArray() [3/3]
 ON_3dVectorArray::ON_3dVectorArray  |  ( |  const ON_3dVectorArray &  |   | )
Member Function Documentation
◆ GetBBox()
 bool ON_3dVectorArray::GetBBox  |  ( |  double  |  boxmin[3],
|  double  |  boxmax[3],
|  bool  |  bGrowBow = false
) |   |  const
◆ operator=()
 ON_3dVectorArray& ON_3dVectorArray::operator=  |  ( |  const ON_3dVectorArray &  |   | )
◆ SwapCoordinates()
 bool ON_3dVectorArray::SwapCoordinates  |  ( |  int  |  ,
|  int
)
◆ Transform()
 bool ON_3dVectorArray::Transform  |  ( |  const ON_Xform &  |   | )