Public Member Functions | Protected Attributes | List of all members
CArgsRhinoGetCurve Class Reference
RhinoGet
#include <rhinoSdkGetCurve.h>
 Public Member Functions
CArgsRhinoGetCurve ()
CArgsRhinoGetCurve (const CArgsRhinoGetCurve &)
~CArgsRhinoGetCurve ()
int  | Degree () const
const ON_3dVector &  | EndTangent () const
const ON_wString &  | FirstPrompt () const
int  | KnotSpacing () const
CArgsRhinoGetCurve &  | operator= (const CArgsRhinoGetCurve &)
ON_3dPointArray &  | PointArray ()
Array of selected points. More...
ON_2dPointArray &  | PointArray2d ()
Array of selected parameter space points. More...
const ON_wString &  | SecondPrompt () const
void  | SetDegree (int)
degree of curve More...
void  | SetEndTangent (const ON_3dVector &)
interpolated curve end tangent, ON_3dVector(0,0,0) if not defined More...
void  | SetFirstPrompt (const wchar_t *)
void  | SetKnotSpacing (int)
void  | SetSecondPrompt (const wchar_t *)
void  | SetSharp (BOOL)
///< FALSE = periodic when closed, TRUE = sharp when closed More...
void  | SetStartTangent (const ON_3dVector &)
interpolated curve start tangent, ON_3dVector(0,0,0) if not defined More...
void  | SetSurface (const ON_Surface *pS)
Surface for Interpolate curve on surface. More...
void  | SetThirdPrompt (const wchar_t *)
void  | SetUseEndTangent (BOOL)
void  | SetUseStartTangent (BOOL)
BOOL  | Sharp () const
const ON_3dVector &  | StartTangent () const
const ON_Surface *  | Surface () const
const ON_wString &  | ThirdPrompt () const
BOOL  | UseEndTangent () const
BOOL  | UseStartTangent () const
 Protected Attributes
int  | m_Degree
ON_3dVector  | m_EndTangent
ON_wString  | m_FirstPrompt
int  | m_KnotSpacing
ON_3dPointArray  | m_PointArray
ON_2dPointArray  | m_PointArray2d
const ON_Surface *  | m_pS
ON_wString  | m_SecondPrompt
BOOL  | m_Sharp
ON_3dVector  | m_StartTangent
ON_wString  | m_ThirdPrompt
BOOL  | m_UseEndTangent
BOOL  | m_UseStartTangent
Detailed Description
Copyright (c) 1993-2017 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. ----------------------------------------------------------------— CLASS CArgsRhinoGetCurve
OVERVIEW TEXT Arguments for RhinoGetControlPointCurve, RhinoGetInterpolatedCurve and RhinoGetInterpolatedCurveOnSurface
KEYWORDS
RhinoGetControlPointCurve RhinoGetInterpolatedCurve Curve CVCurve CPCurve InterpCrv InterpCrvOnSrf
Constructor & Destructor Documentation
◆ CArgsRhinoGetCurve() [1/2]
 CArgsRhinoGetCurve::CArgsRhinoGetCurve  |  ( |   | )
◆ ~CArgsRhinoGetCurve()
 CArgsRhinoGetCurve::~CArgsRhinoGetCurve  |  ( |   | )
◆ CArgsRhinoGetCurve() [2/2]
 CArgsRhinoGetCurve::CArgsRhinoGetCurve  |  ( |  const CArgsRhinoGetCurve &  |   | )
Member Function Documentation
◆ Degree()
 int CArgsRhinoGetCurve::Degree  |  ( |   | ) |   const
◆ EndTangent()
 const ON_3dVector& CArgsRhinoGetCurve::EndTangent  |  ( |   | ) |   const
◆ FirstPrompt()
 const ON_wString& CArgsRhinoGetCurve::FirstPrompt  |  ( |   | ) |   const
◆ KnotSpacing()
 int CArgsRhinoGetCurve::KnotSpacing  |  ( |   | ) |   const
◆ operator=()
 CArgsRhinoGetCurve& CArgsRhinoGetCurve::operator=  |  ( |  const CArgsRhinoGetCurve &  |   | )
◆ PointArray()
 ON_3dPointArray& CArgsRhinoGetCurve::PointArray  |  ( |   | )
Array of selected points.
◆ PointArray2d()
 ON_2dPointArray& CArgsRhinoGetCurve::PointArray2d  |  ( |   | )
Array of selected parameter space points.
◆ SecondPrompt()
 const ON_wString& CArgsRhinoGetCurve::SecondPrompt  |  ( |   | ) |   const
◆ SetDegree()
 void CArgsRhinoGetCurve::SetDegree  |  ( |  int  |   | )
degree of curve
◆ SetEndTangent()
 void CArgsRhinoGetCurve::SetEndTangent  |  ( |  const ON_3dVector &  |   | )
interpolated curve end tangent, ON_3dVector(0,0,0) if not defined
◆ SetFirstPrompt()
 void CArgsRhinoGetCurve::SetFirstPrompt  |  ( |  const wchar_t *  |   | )
prompt when getting first point Default = "Start of curve".
◆ SetKnotSpacing()
 void CArgsRhinoGetCurve::SetKnotSpacing  |  ( |  int  |   | )
Method of Knot Spacing for interpolated curve 0=uniform, 1=chord, 2=sqrt(chord)
◆ SetSecondPrompt()
 void CArgsRhinoGetCurve::SetSecondPrompt  |  ( |  const wchar_t *  |   | )
prompt when getting second point Default = "Next point".
◆ SetSharp()
 void CArgsRhinoGetCurve::SetSharp  |  ( |  BOOL  |   | )
///< FALSE = periodic when closed, TRUE = sharp when closed
◆ SetStartTangent()
 void CArgsRhinoGetCurve::SetStartTangent  |  ( |  const ON_3dVector &  |   | )
interpolated curve start tangent, ON_3dVector(0,0,0) if not defined
◆ SetSurface()
 void CArgsRhinoGetCurve::SetSurface  |  ( |  const ON_Surface *  |  pS | )
Surface for Interpolate curve on surface.
◆ SetThirdPrompt()
 void CArgsRhinoGetCurve::SetThirdPrompt  |  ( |  const wchar_t *  |   | )
prompt when getting third and following points Default = "Next point. Press Enter when done".
◆ SetUseEndTangent()
 void CArgsRhinoGetCurve::SetUseEndTangent  |  ( |  BOOL  |   | )
◆ SetUseStartTangent()
 void CArgsRhinoGetCurve::SetUseStartTangent  |  ( |  BOOL  |   | )
◆ Sharp()
 BOOL CArgsRhinoGetCurve::Sharp  |  ( |   | ) |   const
◆ StartTangent()
 const ON_3dVector& CArgsRhinoGetCurve::StartTangent  |  ( |   | ) |   const
◆ Surface()
 const ON_Surface* CArgsRhinoGetCurve::Surface  |  ( |   | ) |   const
◆ ThirdPrompt()
 const ON_wString& CArgsRhinoGetCurve::ThirdPrompt  |  ( |   | ) |   const
◆ UseEndTangent()
 BOOL CArgsRhinoGetCurve::UseEndTangent  |  ( |   | ) |   const
◆ UseStartTangent()
 BOOL CArgsRhinoGetCurve::UseStartTangent  |  ( |   | ) |   const
Member Data Documentation
◆ m_Degree
 int CArgsRhinoGetCurve::m_Degree
protected
◆ m_EndTangent
 ON_3dVector CArgsRhinoGetCurve::m_EndTangent
protected
◆ m_FirstPrompt
 ON_wString CArgsRhinoGetCurve::m_FirstPrompt
protected
◆ m_KnotSpacing
 int CArgsRhinoGetCurve::m_KnotSpacing
protected
◆ m_PointArray
 ON_3dPointArray CArgsRhinoGetCurve::m_PointArray
protected
◆ m_PointArray2d
 ON_2dPointArray CArgsRhinoGetCurve::m_PointArray2d
protected
◆ m_pS
 const ON_Surface* CArgsRhinoGetCurve::m_pS
protected
◆ m_SecondPrompt
 ON_wString CArgsRhinoGetCurve::m_SecondPrompt
protected
◆ m_Sharp
 BOOL CArgsRhinoGetCurve::m_Sharp
protected
◆ m_StartTangent
 ON_3dVector CArgsRhinoGetCurve::m_StartTangent
protected
◆ m_ThirdPrompt
 ON_wString CArgsRhinoGetCurve::m_ThirdPrompt
protected
◆ m_UseEndTangent
 BOOL CArgsRhinoGetCurve::m_UseEndTangent
protected
◆ m_UseStartTangent
 BOOL CArgsRhinoGetCurve::m_UseStartTangent
protected