Public Member Functions | Protected Member Functions | List of all members
CRhRdkEnvironmentUISection_MFC Class Reference
RDK
#include <RhRdkSections_MFC.h>
 Inheritance diagram for CRhRdkEnvironmentUISection_MFC:
 Public Member Functions
CRhRdkEnvironmentUISection_MFC (unsigned long idi, CWnd *pParent=nullptr)
 Public Member Functions inherited from CRhRdkContentUISection_MFC
CRhRdkContentUISection_MFC (unsigned long idi, CWnd *pParent=nullptr)
 Public Member Functions inherited from CRhRdkSectionBase_MFC
CRhRdkSectionBase_MFC (unsigned int idd, CWnd *pParent=nullptr)
void *  | GetData (const UUID &uuidData, bool bForWrite) const
bool  | IsBlocking (void) const
 Public Member Functions inherited from CRhRdkResizingDialog
CRhRdkResizingDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
CRhRdkResizingDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhRdkResizingDialog ()
virtual BOOL  | AddControlString (HWND hwnd, const TCHAR *szText)
virtual void  | EnableDisableControls (void)
virtual BOOL  | IsControlClipped (CWnd *pWnd)
virtual void  | OnPreInitResizing (void)
virtual void  | SetAutoSubclassGroupBoxes (BOOL bSubclass)
virtual void  | SetFillBackground (BOOL bFill)
virtual void  | SetReleaseClipping (BOOL bRelease)
virtual void  | SetResizingConstraints (BOOL bAllowResizeWidth, BOOL bAllowResizeHeight)
 Public Member Functions inherited from CRhinoDialog
CRhinoDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr)
Modal construct. More...
CRhinoDialog (UINT nIDTemplate, CWnd *pParentWnd=nullptr)
virtual  | ~CRhinoDialog ()
CSize  | CalcDialogSize (INT nResourceId)
BOOL  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr) override
Modeless construct. More...
BOOL  | Create (UINT nIDTemplate, CWnd *pParentWnd=nullptr) override
UINT  | DialogID ()
LPCTSTR  | DialogStringID ()
unsigned int  | DocumentSerialNumber () const
virtual INT_PTR  | DoModal ()
bool  | EnableDisplayCommands () const
void  | EnableSaveDialogPositionAndSize (bool bEnable=true, const wchar_t *wRegistryTitle=nullptr)
bool  | IsSaveDialogPositionAndSizeEnabled () const
void  | Localize ()
virtual void  | OnColorButtonClicked (UINT nBtnID)
Called by CRhColorButton if button clicked and color changed;. More...
void  | OnRhinoHelpButton ()
Dialog Utilities. More...
BOOL  | PreTranslateMessage (MSG *pMsg) override
Overrides. More...
bool  | PushPickButton (bool hide_this_dialog)
void  | SetEnableDisplayCommands (bool b, unsigned int documentRuntimeSerialNumber)
void  | SetEnableDisplayCommands (bool b)
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
virtual BOOL  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Public Member Functions inherited from IRhinoUiSection
virtual UUID  | Uuid (void) const =0
 Public Member Functions inherited from IRhinoUiWindow
virtual ON_wString  | Caption (bool bAlwaysEnglish=false) const =0
 Protected Member Functions
RDK_DEPRECATED CRhRdkEnvironment *  | Environment (void) const
virtual RDK_DEPRECATED void  | GetEnvironmentList (CRhRdkEnvironmentArray &aOut) const
 Protected Member Functions inherited from CRhRdkContentUISection_MFC
virtual  | ~CRhRdkContentUISection_MFC ()
virtual CRhinoCommandOptionName  | CommandOptionName (void) const override
virtual std::shared_ptr< IRhinoUiController >  | Controller (void) const override
virtual ON_UUID  | ControllerId (void) const override
void  | DeferredUpdateUI (void)
virtual void  | Delete (void) override
virtual void  | DisplayData (void) override
virtual void  | Enable (bool bEnable) override
virtual bool  | EnableHeaderButton (int index, bool bEnable) override
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual ON_Color  | GetBackgroundColor (void) const override
virtual int  | GetHeight (void) const override
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const override
virtual HWND  | GetWindow (void) override
virtual IRhinoUiSection &  | Interface (void) override
virtual const IRhinoUiSection &  | Interface (void) const override
virtual void  | InternalOnTimer (UINT_PTR nTimerId) override
virtual bool  | IsCollapsible (void) const override
virtual bool  | IsCreated (void) const override
virtual bool  | IsEnabled (void) const override
virtual bool  | IsHidden (void) const override
virtual bool  | IsInitiallyExpanded (void) const override
virtual bool  | IsShown (void) const override
virtual void  | Move (const ON_4iRect &rect, bool bRepaint=false, bool bRepaintBorder=false) override
virtual IRhRdkHeaderButtonHandler *  | NewHeaderButtonHandler (void) override
virtual void  | OnAttachedToHolder (IRhinoUiHolder &h) override
virtual void  | OnAttachingToHolder (IRhinoUiHolder &h) override
virtual void  | OnControllerActivatedEvent (IRhinoUiController &con) override
virtual void  | OnDetachedFromHolder (IRhinoUiHolder &h) override
virtual void  | OnDetachingFromHolder (IRhinoUiHolder &h) override
virtual void  | OnEvent (IRhinoUiController &con, const UUID &, IRhinoUiController::EventPriority, const IRhinoUiEventInfo *) override
virtual void  | OnExpandSection (bool bExpanding) override
virtual HWND  | Parent (void) const override
virtual UUID  | PlugInId (void) const override
virtual void  | Refresh (bool bImmediate=false) override
virtual CRhinoCommand::result  | RunScript (CRhRdkControllerPtr) override
virtual void  | SetBackgroundColor (const ON_Color &col) override
virtual void  | SetController (std::shared_ptr< IRhinoUiController >) override
virtual void  | SetFocus (void)
virtual void  | SetParent (HWND pParent) override
virtual ON_wString  | SettingsTag (void) const override
virtual void  | Show (bool bShow) override
virtual bool  | ShowHeaderButton (int index, bool bShow) override
virtual bool  | SupportsVaries (const CRhRdkContentArray &aContent) const
void  | UpdateParameter (const wchar_t *wszParam, const CRhRdkVariant &vValue)
virtual void  | UpdateView (unsigned int flags) override
 Protected Member Functions inherited from CRhRdkSectionBase_MFC
virtual  | ~CRhRdkSectionBase_MFC ()
virtual COLORREF  | BackgroundColor (void) const
virtual void  | DeferWindowPositionAndSize (HDWP &hdwp, CWnd &destWnd, CWnd &srceWnd) const
virtual int  | GetDefaultHeight (void) const
virtual unsigned int  | GetIDD (void) const =0
virtual AFX_MODULE_STATE *  | GetModuleState (void) const =0
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnEnable (BOOL bEnable)
afx_msg BOOL  | OnEraseBkgnd (CDC *pDC)
virtual BOOL  | OnInitDialog () override
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnRhinoOptionsSearchShowControlParent (WPARAM, LPARAM)
afx_msg void  | OnTimer (UINT_PTR nTimerId)
virtual BOOL  | PreCreateWindow (CREATESTRUCT &cs) override
virtual void  | Refresh (void)
virtual void  | SetBackgroundColor (COLORREF cr)
virtual void  | SetControlPositionAndSize (void)
virtual void  | SetWindowPositionAndSize (CWnd &destWnd, CWnd &srceWnd) const
 Protected Member Functions inherited from CRhRdkResizingDialog
virtual void  | HideControl (UINT id, int width)
virtual void  | InitControl (UINT id, int l, int t, int r, int b, int o, int iPos)
afx_msg void  | OnDestroy (void)
afx_msg LRESULT  | OnNcHitTest (CPoint)
afx_msg void  | OnSize (UINT, int, int)
afx_msg void  | OnSysCommand (UINT, LPARAM)
afx_msg BOOL  | OnToolTipNotify (UINT, NMHDR *, LRESULT *)
virtual void  | RepositionControls (BOOL bInit)
virtual void  | SizeControl (UINT id, int l, int t, int r, int b, int o, int iPos)
virtual void  | SubclassGroupBoxes ()
virtual void  | UnsubclassGroupBoxes ()
 Protected Member Functions inherited from CRhinoDialog
virtual BOOL  | ContinueModal ()
Implementation. More...
void  | DoDataExchange (CDataExchange *pDX) override
DDX/DDV support. More...
virtual void  | OnCancel ()
virtual BOOL  | OnCommand (WPARAM wParam, LPARAM lParam)
override; ///<not an override on OSX More...
afx_msg void  | OnDestroy ()
afx_msg BOOL  | OnHelpInfo (HELPINFO *pHelpInfo)
virtual void  | OnOK ()
LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam) override
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
BOOL  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
 Protected Member Functions inherited from IRhinoUiSection
virtual  | ~IRhinoUiSection ()
 Protected Member Functions inherited from IRhinoUiWithController
virtual  | ~IRhinoUiWithController ()
 Protected Member Functions inherited from IRhinoUiWindow
virtual  | ~IRhinoUiWindow ()
 Protected Member Functions inherited from IRhinoUiControllerEventWatcher
virtual  | ~IRhinoUiControllerEventWatcher ()
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Public Types inherited from IRhinoUiSection
enum  | : unsigned int { updv_DisplayData = 0x0001, updv_EnableDisable = 0x0002, updv_UpdateLayout = 0x0004 }
 Static Public Member Functions inherited from CRhinoDialog
static int  | CheckSemiModalMessagePump ()
static bool  | InDoSemiModal ()
 Public Attributes inherited from CRhinoDialog
class CRhDialogSdkExtension *  | m__rhino_dialog_sdk_extension
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
Constructor & Destructor Documentation
◆ CRhRdkEnvironmentUISection_MFC()
 CRhRdkEnvironmentUISection_MFC::CRhRdkEnvironmentUISection_MFC  |  ( |  unsigned long  |  idi,
|  CWnd *  |  pParent = nullptr
)
Member Function Documentation
◆ Environment()
 RDK_DEPRECATED CRhRdkEnvironment* CRhRdkEnvironmentUISection_MFC::Environment  |  ( |  void  |   | ) |   const
protected
This method is deprecated because it doesn't support the concept of writing to the environments or multiple selections. Please use CRhRdkEditableContentArray instead.
See also
CRhRdkEditableContentArray.
◆ GetEnvironmentList()
 virtual RDK_DEPRECATED void CRhRdkEnvironmentUISection_MFC::GetEnvironmentList  |  ( |  CRhRdkEnvironmentArray &  |  aOut | ) |   const
protectedvirtual
This method is deprecated because it doesn't support the concept of writing to the environments. Please use CRhRdkEditableContentArray instead.
See also
CRhRdkEditableContentArray.