List of all members
CRhRdkMaterialArray Class Referencefinal
RDK
#include <RhRdkMaterial.h>
 Inheritance diagram for CRhRdkMaterialArray:
 Additional Inherited Members
 Public Member Functions inherited from ON_SimpleArray< const CRhRdkMaterial *>
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< const CRhRdkMaterial * > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_SimpleArray ()
void  | Append (const const CRhRdkMaterial * &)
void  | Append (int, const const CRhRdkMaterial * *)
Append copy of an array T[count]. More...
const CRhRdkMaterial * &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
const CRhRdkMaterial * *  | Array ()
The Array() function return the. More...
const const CRhRdkMaterial * *  | Array () const
m_a pointer value. More...
const CRhRdkMaterial * *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const CRhRdkMaterial * *  | At (unsigned int)
const CRhRdkMaterial * *  | At (ON__INT64)
const CRhRdkMaterial * *  | At (ON__UINT64)
const const CRhRdkMaterial * *  | At (int) const
const const CRhRdkMaterial * *  | At (unsigned int) const
const const CRhRdkMaterial * *  | At (ON__INT64) const
const const CRhRdkMaterial * *  | At (ON__UINT64) const
int  | BinarySearch (const const CRhRdkMaterial * *, int(*)(const const CRhRdkMaterial * *, const const CRhRdkMaterial * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
int  | BinarySearch (const const CRhRdkMaterial * *, int(*)(const const CRhRdkMaterial * *, const const CRhRdkMaterial * *), int) const
int  | Capacity () const
capacity of array More...
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
const CRhRdkMaterial * *  | First ()
const const CRhRdkMaterial * *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*)(const const CRhRdkMaterial * *, const const CRhRdkMaterial * *))
void  | Insert (int, const const CRhRdkMaterial * &)
const CRhRdkMaterial * *  | KeepArray ()
const CRhRdkMaterial * *  | Last ()
const const CRhRdkMaterial * *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const const CRhRdkMaterial * * () const
operator const CRhRdkMaterial ** ()
The cast operators return a pointer. More...
ON_SimpleArray< const CRhRdkMaterial * > &  | operator= (const ON_SimpleArray< const CRhRdkMaterial * > &)
const CRhRdkMaterial * &  | operator[] (int)
const CRhRdkMaterial * &  | operator[] (unsigned int)
const CRhRdkMaterial * &  | operator[] (ON__INT64)
const CRhRdkMaterial * &  | operator[] (ON__UINT64)
const const CRhRdkMaterial * &  | operator[] (int) const
const const CRhRdkMaterial * &  | operator[] (unsigned int) const
const const CRhRdkMaterial * &  | operator[] (ON__INT64) const
const const CRhRdkMaterial * &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const const CRhRdkMaterial * *, const const CRhRdkMaterial * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
virtual const CRhRdkMaterial * *  | Realloc (const CRhRdkMaterial * *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
const CRhRdkMaterial * *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const const CRhRdkMaterial * &) const
int  | Search (const const CRhRdkMaterial * *, int(*)(const const CRhRdkMaterial * *, const const CRhRdkMaterial * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
void  | SetArray (const CRhRdkMaterial * *)
void  | SetArray (const CRhRdkMaterial * *, int, int)
const CRhRdkMaterial * *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const const CRhRdkMaterial * *, const const CRhRdkMaterial * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const const CRhRdkMaterial * *, const const CRhRdkMaterial * *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Protected Member Functions inherited from ON_SimpleArray< const CRhRdkMaterial *>
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< const CRhRdkMaterial *>
const CRhRdkMaterial * *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...