Public Member Functions | List of all members
ON_RtfParser Class Reference
OpenNURBS
#include <opennurbs_textiterator.h>
 Public Member Functions
ON_RtfParser (ON_TextIterator &iter, ON_TextBuilder &builder)
bool  | Parse ()
Constructor & Destructor Documentation
◆ ON_RtfParser()
 ON_RtfParser::ON_RtfParser  |  ( |  ON_TextIterator &  |  iter,
|  ON_TextBuilder &  |  builder
)
Member Function Documentation
◆ Parse()
 bool ON_RtfParser::Parse  |  ( |   | )