Public Member Functions | List of all members
CRhRdkToneMapper_PixelBased Class Referenceabstract
RDK
#include <RhRdkToneMappers.h>
 Inheritance diagram for CRhRdkToneMapper_PixelBased:
 Public Member Functions
virtual void  | ProcessPixel (float &r, float &g, float &b)=0
 Public Member Functions inherited from CRhRdkToneMapper
virtual  | ~CRhRdkToneMapper ()
virtual ON_wString  | GetFriendlyParamName (const wchar_t *wszParamName, bool bEnglish) const =0
virtual void  | GetParametersFromSection (const IRhRdk_XMLSection &section)=0
virtual void  | SetParametersToSection (IRhRdk_XMLSection &section) const =0
Member Function Documentation
◆ ProcessPixel()
 virtual void CRhRdkToneMapper_PixelBased::ProcessPixel  |  ( |  float &  |  r,
|  float &  |  g,
|  float &  |  b
)
pure virtual
Implemented in CRhRdkToneMapper_BlackWhitePoint.