Public Member Functions | List of all members
CRhRdkCustomRenderMeshes Class Reference
RDK
#include <IRhRdkCustomRenderMeshManager.h>
 Inheritance diagram for CRhRdkCustomRenderMeshes:
 Public Member Functions
CRhRdkCustomRenderMeshes (const CRhinoObject *pObject)
virtual  | ~CRhRdkCustomRenderMeshes ()
virtual void  | Add (ON_Mesh *pMesh, const CRhRdkMaterial *pMaterial)
virtual void  | Add (const ON_Sphere &sphere, const CRhRdkMaterial *pMaterial)
virtual void  | Add (const ON_PlaneSurface &plane, const CRhRdkMaterial *pMaterial)
virtual void  | Add (const ON_PlaneSurface &plane, const ON_Interval &cz, const CRhRdkMaterial *pMaterial)
virtual void  | Add (const ON_Cone &cone, const ON_Plane &truncation, const CRhRdkMaterial *pMaterial)
virtual void  | AddOnTheFlyMeshFromCache (int index, const ON_Mesh *pMesh)
virtual const CRhRdkObjectAncestry *  | Ancestry (void) const
virtual bool  | AutoDeleteMaterialsOn (void) const
virtual bool  | AutoDeleteMeshesOn (void) const
virtual bool  | Box (int iIndex, ON_PlaneSurface &plane, ON_Interval &z_interval) const
virtual void  | Clear (void)
virtual bool  | Cone (int iIndex, ON_Cone &cone, ON_Plane &truncation) const
virtual void  | ConvertMeshesToTriangles (void)
virtual int  | Count (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual const ON_Xform &  | GetInstanceTransform (void) const
virtual const CRhRdkMaterial *  | Material (int iIndex) const
virtual const ON_Mesh *  | Mesh (int iIndex) const
virtual const CRhinoObject *  | Object (void) const
virtual const UUID &  | OriginalMaterialId (int iIndex) const
virtual bool  | Plane (int iIndex, ON_PlaneSurface &plane) const
virtual void  | PrepareRenderMeshesForMapping (void)
virtual RhRdkRenderMeshPrimitiveTypes  | PrimitiveType (int iIndex) const
virtual UUID  | ProviderId (void) const
virtual void  | SetAncestry (const class CRhRdkObjectAncestry &pAncestry)
virtual void  | SetAutoDeleteMaterialsOn (void)
virtual void  | SetAutoDeleteMeshesOn (void)
virtual void  | SetInstanceTransform (const ON_Xform &xformInstance)
virtual void  | SetProviderId (const UUID &uuidRMP)
virtual void  | SetUseObjectsMappingChannels (bool bSet)
virtual bool  | Sphere (int iIndex, ON_Sphere &sphere) const
virtual bool  | UseObjectsMappingChannels (void) const
 Public Member Functions inherited from IRhRdkCustomRenderMeshes
virtual  | ~IRhRdkCustomRenderMeshes ()
Detailed Description
Built-in implementation of IRhRdkCustomRenderMeshes.
Constructor & Destructor Documentation
◆ CRhRdkCustomRenderMeshes()
 CRhRdkCustomRenderMeshes::CRhRdkCustomRenderMeshes  |  ( |  const CRhinoObject *  |  pObject | )
◆ ~CRhRdkCustomRenderMeshes()
 virtual CRhRdkCustomRenderMeshes::~CRhRdkCustomRenderMeshes  |  ( |   | )
virtual
Member Function Documentation
◆ Add() [1/5]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  ON_Mesh *  |  pMesh,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Add mesh and material.
Parameters
pMesh | is the mesh to add.
pMaterial | is the material to add. Can be NULL if not needed. If SetAutoDeleteMaterialsOn has been called prior to calling Add, the material will be copied.
Implements IRhRdkCustomRenderMeshes.
◆ Add() [2/5]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  const ON_Sphere &  |  sphere,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Add primitive sphere and material.
Parameters
sphere | is the sphere to add.
pMaterial | is the material to add. Can be NULL if not needed. If SetAutoDeleteMaterialsOn has been called prior to calling Add, the material will be copied.
Implements IRhRdkCustomRenderMeshes.
◆ Add() [3/5]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  const ON_PlaneSurface &  |  plane,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Add primitive finite plane and material.
Parameters
plane | is the plane to add.
cx | is the x-interval of the plane.
cy | is the y-interval of the plane.
pMaterial | is the material to add. Can be NULL if not needed. If SetAutoDeleteMaterialsOn has been called prior to calling Add, the material will be copied.
Implements IRhRdkCustomRenderMeshes.
◆ Add() [4/5]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  const ON_PlaneSurface &  |  plane,
|  const ON_Interval &  |  cz,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Add primitive box and material.
Parameters
plane | is the plane of the box to add.
cx | is the x-interval of the box.
cy | is the y-interval of the box.
cz | is the z-interval of the box.
pMaterial | is the material to add. Can be NULL if not needed. If SetAutoDeleteMaterialsOn has been called prior to calling Add, the material will be copied.
Implements IRhRdkCustomRenderMeshes.
◆ Add() [5/5]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  const ON_Cone &  |  cone,
|  const ON_Plane &  |  truncation,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Add primitive (possibly truncated) cone and material.
Parameters
cone | is the cone to add as defined in ON_Cone.
truncation | is the plane used to cut the cone (the non-apex end is kept). Should be equal to cone.plane if not truncated.
pMaterial | is the material to add. Can be NULL if not needed. If SetAutoDeleteMaterialsOn has been called prior to calling Add, the material will be copied.
Implements IRhRdkCustomRenderMeshes.
◆ AddOnTheFlyMeshFromCache()
 virtual void CRhRdkCustomRenderMeshes::AddOnTheFlyMeshFromCache  |  ( |  int  |  index,
|  const ON_Mesh *  |  pMesh
)
virtual
◆ Ancestry()
 virtual const CRhRdkObjectAncestry* CRhRdkCustomRenderMeshes::Ancestry  |  ( |  void  |   | ) |   const
virtual
Implements IRhRdkCustomRenderMeshes.
◆ AutoDeleteMaterialsOn()
 virtual bool CRhRdkCustomRenderMeshes::AutoDeleteMaterialsOn  |  ( |  void  |   | ) |   const
virtual
◆ AutoDeleteMeshesOn()
 virtual bool CRhRdkCustomRenderMeshes::AutoDeleteMeshesOn  |  ( |  void  |   | ) |   const
virtual
◆ Box()
 virtual bool CRhRdkCustomRenderMeshes::Box  |  ( |  int  |  iIndex,
|  ON_PlaneSurface &  |  plane,
|  ON_Interval &  |  z_interval
) |   |  const
virtual
Implements IRhRdkCustomRenderMeshes.
◆ Clear()
 virtual void CRhRdkCustomRenderMeshes::Clear  |  ( |  void  |   | )
virtual
◆ Cone()
 virtual bool CRhRdkCustomRenderMeshes::Cone  |  ( |  int  |  iIndex,
|  ON_Cone &  |  cone,
|  ON_Plane &  |  truncation
) |   |  const
virtual
Implements IRhRdkCustomRenderMeshes.
◆ ConvertMeshesToTriangles()
 virtual void CRhRdkCustomRenderMeshes::ConvertMeshesToTriangles  |  ( |  void  |   | )
virtual
Convert all meshes to triangles if they contain quads.
Implements IRhRdkCustomRenderMeshes.
◆ Count()
 virtual int CRhRdkCustomRenderMeshes::Count  |  ( |  void  |   | ) |   const
virtual
Returns
Number of mesh/material pairs that are in the collection.
Implements IRhRdkCustomRenderMeshes.
◆ EVF()
 virtual void* CRhRdkCustomRenderMeshes::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
Emergency virtual function for future expansion.
Implements IRhRdkCustomRenderMeshes.
◆ GetInstanceTransform()
 virtual const ON_Xform& CRhRdkCustomRenderMeshes::GetInstanceTransform  |  ( |  void  |   | ) |   const
virtual
Returns
The transformation that the meshes have undergone from their original location in instance space. i.e., The mesh should not be transformed by this, but other transformable data (such as primitive mapping types) should have this applied before using them.
Implements IRhRdkCustomRenderMeshes.
◆ Material()
 virtual const CRhRdkMaterial* CRhRdkCustomRenderMeshes::Material  |  ( |  int  |  iIndex | ) |   const
virtual
Get a material by its index.
Parameters
iIndex | is the material index which must be >= 0 and < Count().
Returns
A pointer to the material or NULL if iIndex is out of range.
Implements IRhRdkCustomRenderMeshes.
◆ Mesh()
 virtual const ON_Mesh* CRhRdkCustomRenderMeshes::Mesh  |  ( |  int  |  iIndex | ) |   const
virtual
Get a mesh by its index.
Parameters
iIndex | is the mesh index which must be >= 0 and < Count().
Returns
A pointer to the mesh or NULL if iIndex is out of range.
Note
This always returns a mesh even if this is a primitive type other than mesh; i.e., a suitable mesh is created on the fly.
Implements IRhRdkCustomRenderMeshes.
◆ Object()
 virtual const CRhinoObject* CRhRdkCustomRenderMeshes::Object  |  ( |  void  |   | ) |   const
virtual
Returns
A pointer to the Rhino object.
Implements IRhRdkCustomRenderMeshes.
◆ OriginalMaterialId()
 virtual const UUID& CRhRdkCustomRenderMeshes::OriginalMaterialId  |  ( |  int  |  iIndex | ) |   const
virtual
◆ Plane()
 virtual bool CRhRdkCustomRenderMeshes::Plane  |  ( |  int  |  iIndex,
|  ON_PlaneSurface &  |  plane
) |   |  const
virtual
Implements IRhRdkCustomRenderMeshes.
◆ PrepareRenderMeshesForMapping()
 virtual void CRhRdkCustomRenderMeshes::PrepareRenderMeshesForMapping  |  ( |  void  |   | )
virtual
◆ PrimitiveType()
 virtual RhRdkRenderMeshPrimitiveTypes CRhRdkCustomRenderMeshes::PrimitiveType  |  ( |  int  |  iIndex | ) |   const
virtual
Returns
The primitive type supported by the mesh. Usually just mesh.
Implements IRhRdkCustomRenderMeshes.
◆ ProviderId()
 virtual UUID CRhRdkCustomRenderMeshes::ProviderId  |  ( |  void  |   | ) |   const
virtual
Returns
The id of the provider that called SetProviderId().
Implements IRhRdkCustomRenderMeshes.
◆ SetAncestry()
 virtual void CRhRdkCustomRenderMeshes::SetAncestry  |  ( |  const class CRhRdkObjectAncestry &  |  pAncestry | )
virtual
◆ SetAutoDeleteMaterialsOn()
 virtual void CRhRdkCustomRenderMeshes::SetAutoDeleteMaterialsOn  |  ( |  void  |   | )
virtual
The provider should call this to make the object automatically delete all materials when they are no longer needed. If called, it must be called before calling Add().
Implements IRhRdkCustomRenderMeshes.
◆ SetAutoDeleteMeshesOn()
 virtual void CRhRdkCustomRenderMeshes::SetAutoDeleteMeshesOn  |  ( |  void  |   | )
virtual
The provider should call this to make the object automatically delete all meshes when they are no longer needed. If called, it must be called before calling Add().
Implements IRhRdkCustomRenderMeshes.
◆ SetInstanceTransform()
 virtual void CRhRdkCustomRenderMeshes::SetInstanceTransform  |  ( |  const ON_Xform &  |  xformInstance | )
virtual
Providers should set this information -
See also
GetInstanceTransform() for more information.
Implements IRhRdkCustomRenderMeshes.
◆ SetProviderId()
 virtual void CRhRdkCustomRenderMeshes::SetProviderId  |  ( |  const UUID &  |  uuidRMP | )
virtual
The provider should call this to identify itself. It must be called before calling Add().
Implements IRhRdkCustomRenderMeshes.
◆ SetUseObjectsMappingChannels()
 virtual void CRhRdkCustomRenderMeshes::SetUseObjectsMappingChannels  |  ( |  bool  |  bSet | )
virtual
The provider calls this with true if the texture mapping will be taken from the Rhino object. Otherwise it calls this with false. Then the texture mapping will use the TCs on the mesh only.
Implements IRhRdkCustomRenderMeshes.
◆ Sphere()
 virtual bool CRhRdkCustomRenderMeshes::Sphere  |  ( |  int  |  iIndex,
|  ON_Sphere &  |  sphere
) |   |  const
virtual
Implements IRhRdkCustomRenderMeshes.
◆ UseObjectsMappingChannels()
 virtual bool CRhRdkCustomRenderMeshes::UseObjectsMappingChannels  |  ( |  void  |   | ) |   const
virtual
Returns
true if the texture mapping will be taken from the Rhino object. Otherwise the texture mapping will use the TCs on the mesh only.
Implements IRhRdkCustomRenderMeshes.