Public Member Functions | Protected Member Functions | List of all members
CRhRdkController Class Reference
RDK
#include <RhRdkDataSource.h>
 Inheritance diagram for CRhRdkController:
 Public Member Functions
CRhRdkController ()
virtual void  | Activate (void) override
virtual void  | AddDataSource (IRhinoUiDataSource &ds) override
virtual void  | Commit (const UUID &uuidData, IRhinoUiEventInfo *pInfo=nullptr) override
virtual void  | CopyDataSourcesFrom (IRhinoUiDataSourceHost &host) override
virtual void  | Delete (void) override
virtual void  | Discard (const UUID &uuidData) override
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual void *  | GetData (const UUID &uuidData, bool bForWrite, bool bAutoChangeBracket) const override
virtual void  | GetDataSources (ON_SimpleArray< IRhinoUiDataSource *> &aOut) const override
virtual UUID  | Id (void) const override
virtual bool  | IsActivated (void) const override
virtual void  | OnEvent (const UUID &uuidData, const IRhinoUiEventInfo *pInfo) override
virtual void  | RegisterEventWatcher (IRhinoUiControllerEventWatcher &ew) override
virtual void  | RemoveDataSource (IRhinoUiDataSource &ds) override
virtual EventPriority  | SetEventPriority (EventPriority ep) override
virtual void  | UnregisterEventWatcher (IRhinoUiControllerEventWatcher &ew) override
 Public Member Functions inherited from IRhinoUiController
virtual void  | RequiredDataSources (OUT ON_SimpleArray< ON_UUID > &aId) const =0
 Protected Member Functions
virtual  | ~CRhRdkController ()
 Protected Member Functions inherited from IRhinoUiController
virtual  | ~IRhinoUiController ()
 Protected Member Functions inherited from IRhinoUiDataSourceEventWatcher
virtual  | ~IRhinoUiDataSourceEventWatcher ()
 Additional Inherited Members
 Public Types inherited from IRhinoUiController
enum  | EventPriority : unsigned int { EventPriority::Low, EventPriority::Normal, EventPriority::High, EventPriority::RealTime }
Event priority More...
 Static Public Member Functions inherited from IRhinoUiController
static void  | CustomDeleter (IRhinoUiController *)
static std::shared_ptr< IRhinoUiController >  | make_shared (IRhinoUiController *)
Constructor & Destructor Documentation
◆ CRhRdkController()
 CRhRdkController::CRhRdkController  |  ( |   | )
◆ ~CRhRdkController()
 virtual CRhRdkController::~CRhRdkController  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ Activate()
 virtual void CRhRdkController::Activate  |  ( |  void  |   | )
overridevirtual
Call this method when UI construction is complete and the values should be passed for the first time from the model to the view.
Implements IRhinoUiController.
◆ AddDataSource()
 virtual void CRhRdkController::AddDataSource  |  ( |  IRhinoUiDataSource &  |  ds | )
overridevirtual
Add a data source to the host. The implementation of this method typically also registers the host as a data source event watcher.
Implements IRhinoUiDataSourceHost.
◆ Commit()
 virtual void CRhRdkController::Commit  |  ( |  const UUID &  |  uuidData,
|  IRhinoUiEventInfo *  |  pInfo = nullptr
)
overridevirtual
Commit changes made using GetData() with bForWrite=true.
Parameters
uuidData | is the identifier of the data.
pInfo | is a pointer to optional info to be sent with any event that is raised. Events will be sent for any data objects that have had data committed. Every call to GetData() with bForWrite=true must be matched by a call to either Commit() or Discard(). This method should not be called if the operation is cancelled. Instead you should call Discard().
See also
GetData()
 Discard()
Implements IRhinoUiDataSourceHost.
◆ CopyDataSourcesFrom()
 virtual void CRhRdkController::CopyDataSourcesFrom  |  ( |  IRhinoUiDataSourceHost &  |  host | )
overridevirtual
Copy the data sources from another host. The implementation of this method typically also registers this host as a data source event watcher.
Implements IRhinoUiDataSourceHost.
◆ Delete()
 virtual void CRhRdkController::Delete  |  ( |  void  |   | )
overridevirtual
Implement this method to unregister and delete the event watcher.
Implements IRhinoUiDataSourceEventWatcher.
◆ Discard()
 virtual void CRhRdkController::Discard  |  ( |  const UUID &  |  uuidData | )
overridevirtual
Discard changes made using GetData() with bForWrite=true.
Parameters
uuidData | is the identifier of the data. Every call to GetData() with bForWrite=true must be matched by a call to either Commit() or Discard(). This method should only be called if the operation is cancelled. Otherwise you should call Commit().
See also
GetData()
 Commit()
Implements IRhinoUiDataSourceHost.
◆ EVF()
 virtual void* CRhRdkController::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
overridevirtual
Emergency virtual function for future expansion.
Implements IRhinoUiDataSourceEventWatcher.
◆ GetData()
 virtual void* CRhRdkController::GetData  |  ( |  const UUID &  |  uuidData,
|  bool  |  bForWrite,
|  bool  |  bAutoChangeBracket
) |   |  const
overridevirtual
Get data, specified by a unique id, from one of the host's data source(s). Each data source will be asked to provide the data until either one provides it or there are no more data sources to ask.
Parameters
uuidData | is the identifier of the data.
bForWrite | is true if the data source is going to be written to. Every call to GetData() with bForWrite=true must be matched by a call to either Commit() or Discard().
bAutoChangeBracket | is true if a content change bracket should be applied.
Returns
The data from a data source or null if no such data could be provided.
Implements IRhinoUiDataSourceHost.
◆ GetDataSources()
 virtual void CRhRdkController::GetDataSources  |  ( |  ON_SimpleArray< IRhinoUiDataSource *> &  |  aOut | ) |   const
overridevirtual
Get the data sources that are being hosted.
Implements IRhinoUiDataSourceHost.
◆ Id()
 virtual UUID CRhRdkController::Id  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The unique id of this controller.
Implements IRhinoUiController.
◆ IsActivated()
 virtual bool CRhRdkController::IsActivated  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhinoUiController.
◆ OnEvent()
 virtual void CRhRdkController::OnEvent  |  ( |  const UUID &  |  uuidData,
|  const IRhinoUiEventInfo *  |  pInfo
)
overridevirtual
Implement this method to handle an event when the data of a certain type changes. Your handler will typically transfer data of that type to elements of your user interface.
Parameters
uuidData | is the identifier of the data.
pInfo | is a pointer to an object that contains more information about the event.
See also
IRhinoUiDataSource::RegisterEventWatcher()
Implements IRhinoUiDataSourceEventWatcher.
◆ RegisterEventWatcher()
 virtual void CRhRdkController::RegisterEventWatcher  |  ( |  IRhinoUiControllerEventWatcher &  |  ew | )
overridevirtual
Register an event watcher to be notified when the model changes.
Implements IRhinoUiController.
◆ RemoveDataSource()
 virtual void CRhRdkController::RemoveDataSource  |  ( |  IRhinoUiDataSource &  |  ds | )
overridevirtual
Removes a data source from the host. This is called when a data source is being deleted. The implementation of this method typically also unregisters the host as a data source event watcher.
Implements IRhinoUiDataSourceHost.
◆ SetEventPriority()
 virtual EventPriority CRhRdkController::SetEventPriority  |  ( |  EventPriority  |  ep | )
overridevirtual
Set the event priority. You should only change the event priority around an event send and set it back to the old value afterwards.
Returns
the old event priority.
Implements IRhinoUiController.
◆ UnregisterEventWatcher()
 virtual void CRhRdkController::UnregisterEventWatcher  |  ( |  IRhinoUiControllerEventWatcher &  |  ew | )
overridevirtual
Unregister an event watcher which has been added by RegisterEventWatcher(). This must be done when the event watcher is deleted.
Implements IRhinoUiController.