Public Member Functions | Static Public Member Functions | List of all members
CRhRdkDialogDanger Class Referencefinal
RDK
#include <RhRdkUiSdk.h>
 Public Member Functions
CRhRdkDialogDanger ()
~CRhRdkDialogDanger ()
 Static Public Member Functions
static bool  | IsActive (void)
Constructor & Destructor Documentation
◆ CRhRdkDialogDanger()
 CRhRdkDialogDanger::CRhRdkDialogDanger  |  ( |   | )
◆ ~CRhRdkDialogDanger()
 CRhRdkDialogDanger::~CRhRdkDialogDanger  |  ( |   | )
Member Function Documentation
◆ IsActive()
 static bool CRhRdkDialogDanger::IsActive  |  ( |  void  |   | )
static