CRhRdkSunSettingsSection_MFC Class Reference
RDK
#include <RhRdkSections_MFC.h>
Detailed Description
If you want to put your own custom dialogs in the Sun dialog, you must derive your dialog from this base class and override CRhRdkRenderPlugIn::AddCustomSunSections(). This dialog can be shown in modal, semi-modal and modeless contexts.
See also
IsModal().
 CRhRdkRenderPlugIn::AddCustomSunSections()