Public Member Functions | Protected Member Functions | List of all members
CRhRdkGraphCtrl Class Referenceabstract
RDK
#include <RhRdkGraphCtrl.h>
 Inheritance diagram for CRhRdkGraphCtrl:
 Public Member Functions
CRhRdkGraphCtrl ()
virtual  | ~CRhRdkGraphCtrl ()
virtual COLORREF  | BackgroundColor (void) const
virtual bool  | CreateWnd (DWORD dwStyle, const CRect &rect, HWND pParent, UINT id)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual double  | GraphFunction (double u) const =0
virtual COLORREF  | GridColor (void) const
virtual COLORREF  | InteriorColor (void) const
virtual bool  | IsFilled (void) const
virtual double  | Level (void) const
virtual int  | NumGridLines (void) const
virtual COLORREF  | OutlineColor (void) const
virtual void  | Refresh (void)
virtual void  | SafeInvalidate (void)
virtual void  | SetBackgroundColor (COLORREF col)
virtual void  | SetGridColor (COLORREF col)
virtual void  | SetInteriorColor (COLORREF col)
virtual void  | SetIsFilled (bool bFilled)
virtual void  | SetLevel (double d)
virtual void  | SetNumGridLines (int iNum)
virtual void  | SetOutlineColor (COLORREF col)
 Protected Member Functions
void  | Initialize (void)
afx_msg int  | OnCreate (LPCREATESTRUCT)
afx_msg void  | OnDestroy ()
afx_msg BOOL  | OnEraseBkgnd (CDC *)
afx_msg LRESULT  | OnQueryFocus (WPARAM, LPARAM)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | PreSubclassWindow () override
Constructor & Destructor Documentation
◆ CRhRdkGraphCtrl()
 CRhRdkGraphCtrl::CRhRdkGraphCtrl  |  ( |   | )
◆ ~CRhRdkGraphCtrl()
 virtual CRhRdkGraphCtrl::~CRhRdkGraphCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ BackgroundColor()
 virtual COLORREF CRhRdkGraphCtrl::BackgroundColor  |  ( |  void  |   | ) |   const
virtual
Returns
The background color.
◆ CreateWnd()
 virtual bool CRhRdkGraphCtrl::CreateWnd  |  ( |  DWORD  |  dwStyle,
|  const CRect &  |  rect,
|  HWND  |  pParent,
|  UINT  |  id
)
virtual
Create the control.
◆ EVF()
 virtual void* CRhRdkGraphCtrl::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
◆ GraphFunction()
 virtual double CRhRdkGraphCtrl::GraphFunction  |  ( |  double  |  u | ) |   const
pure virtual
Implement this method to return the V value (0 to 1) corresponding to the supplied U value (0 to 1).
◆ GridColor()
 virtual COLORREF CRhRdkGraphCtrl::GridColor  |  ( |  void  |   | ) |   const
virtual
Returns
The grid color.
◆ Initialize()
 void CRhRdkGraphCtrl::Initialize  |  ( |  void  |   | )
protected
◆ InteriorColor()
 virtual COLORREF CRhRdkGraphCtrl::InteriorColor  |  ( |  void  |   | ) |   const
virtual
Returns
The interior color.
◆ IsFilled()
 virtual bool CRhRdkGraphCtrl::IsFilled  |  ( |  void  |   | ) |   const
virtual
Query whether or not the area under the graph is filled.
Returns
true if filled, else false.
◆ Level()
 virtual double CRhRdkGraphCtrl::Level  |  ( |  void  |   | ) |   const
virtual
Returns
The level used to scale the V value returned by GraphFunction().
◆ NumGridLines()
 virtual int CRhRdkGraphCtrl::NumGridLines  |  ( |  void  |   | ) |   const
virtual
Returns
The number of grid lines across and down the graph.
◆ OnCreate()
 afx_msg int CRhRdkGraphCtrl::OnCreate  |  ( |  LPCREATESTRUCT  |   | )
protected
◆ OnDestroy()
 afx_msg void CRhRdkGraphCtrl::OnDestroy  |  ( |   | )
protected
◆ OnEraseBkgnd()
 afx_msg BOOL CRhRdkGraphCtrl::OnEraseBkgnd  |  ( |  CDC *  |   | )
protected
◆ OnQueryFocus()
 afx_msg LRESULT CRhRdkGraphCtrl::OnQueryFocus  |  ( |  WPARAM  |  ,
|  LPARAM
)
inlineprotected
◆ OnSize()
 afx_msg void CRhRdkGraphCtrl::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
protected
◆ OutlineColor()
 virtual COLORREF CRhRdkGraphCtrl::OutlineColor  |  ( |  void  |   | ) |   const
virtual
Returns
The outline color.
◆ PreSubclassWindow()
 virtual void CRhRdkGraphCtrl::PreSubclassWindow  |  ( |   | )
overrideprotectedvirtual
◆ Refresh()
 virtual void CRhRdkGraphCtrl::Refresh  |  ( |  void  |   | )
virtual
This method is called when the graph needs to be refreshed. Optionally override this method to update any variables prior to the graph being repainted. If you override this method, please be sure to call the base class.
◆ SafeInvalidate()
 virtual void CRhRdkGraphCtrl::SafeInvalidate  |  ( |  void  |   | )
virtual
This method is called when the graph needs to be repainted. If you override this method, please be sure to call the base class.
◆ SetBackgroundColor()
 virtual void CRhRdkGraphCtrl::SetBackgroundColor  |  ( |  COLORREF  |  col | )
virtual
Set the background color.
◆ SetGridColor()
 virtual void CRhRdkGraphCtrl::SetGridColor  |  ( |  COLORREF  |  col | )
virtual
Set the grid color.
◆ SetInteriorColor()
 virtual void CRhRdkGraphCtrl::SetInteriorColor  |  ( |  COLORREF  |  col | )
virtual
Set the interior color.
◆ SetIsFilled()
 virtual void CRhRdkGraphCtrl::SetIsFilled  |  ( |  bool  |  bFilled | )
virtual
Set whether or not the area under the graph is filled.
◆ SetLevel()
 virtual void CRhRdkGraphCtrl::SetLevel  |  ( |  double  |  d | )
virtual
Set the level used to scale the V value returned by GraphFunction().
◆ SetNumGridLines()
 virtual void CRhRdkGraphCtrl::SetNumGridLines  |  ( |  int  |  iNum | )
virtual
Set the number of grid lines across and down the graph.
◆ SetOutlineColor()
 virtual void CRhRdkGraphCtrl::SetOutlineColor  |  ( |  COLORREF  |  col | )
virtual
Set the outline color.