Public Types | Public Member Functions | Public Attributes | List of all members
CRhinoAppFileSettings Class Reference
Rhino
 More...
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | : unsigned int { ImportFileLayerMatchingOptionDefault = 0 }
enum  | clipboard_on_exit : unsigned int { keep_clipboard_data = 0, delete_clipboard_data, prompt_user_when_clipboard_big }
 Public Member Functions
CRhinoAppFileSettings ()
CRhinoAppFileSettings (const CRhinoAppFileSettings &)=default
~CRhinoAppFileSettings ()=default
void  | Defaults ()
unsigned int  | ImportFileLayerMatchingOption () const
void  | LoadProfile (CRhinoProfileContext &pc)
bool  | operator!= (const CRhinoAppFileSettings &src) const
CRhinoAppFileSettings &  | operator= (const CRhinoAppFileSettings &)=default
bool  | operator== (const CRhinoAppFileSettings &src) const
void  | SaveProfile (CRhinoProfileContext &) const
void  | SetImportFileLayerMatchingOption (unsigned int import_file_layer_matching_option)
 Public Attributes
ON_ClassArray< ON_wString >  | m_always_autosave_before_commands
List of commands that force AutoSave prior to running. More...
bool  | m_autosave = true
enable autosave feature More...
ON_wString  | m_autosave_file
AutoSave options. More...
int  | m_autosave_increment = 20
how many minutes between autosaves More...
bool  | m_autosave_meshes = false
save render and display meshes More...
bool  | m_bCreate3dmBakFiles = true
default = true More...
clipboard_on_exit  | m_clipboard_on_exit = CRhinoAppFileSettings::clipboard_on_exit::prompt_user_when_clipboard_big
bool  | m_copy_to_previous_rhino_version = true
Clipboard options. More...
ON_wString  | m_default_template_file
template file loaded when Rhino starts and the default file name for OpenTemplateFile dialog More...
bool  | m_enable_file_locking = true
Ensure that only one person at a time can have a file open for saving. More...
bool  | m_enable_file_locking_open_warning = true
Display information dialog which identifies computer file is open on. More...
bool  | m_keep_multiple_recycled_autosave_files = true
Keep multiple copies of autosave files in recycle bin. More...
bool  | m_recycle_autosave_files = true
Move autosave files to recycle bin. More...
bool  | m_save_view_changes = false
true for users who consider view changes a document change More...
ON_wString  | m_template_files
default template file folder (RhinoInstallFolder) More...
Detailed Description
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned int
Enumerator
ImportFileLayerMatchingOptionDefault
◆ clipboard_on_exit
 enum CRhinoAppFileSettings::clipboard_on_exit : unsigned int
Enumerator
keep_clipboard_data
Always keep clipboard data, regardless of size and never prompt the user.
delete_clipboard_data
Always delete clipboard data, regardless of size and never prompt the user.
prompt_user_when_clipboard_big
Prompt user when clipboard memory is large.
Constructor & Destructor Documentation
◆ CRhinoAppFileSettings() [1/2]
 CRhinoAppFileSettings::CRhinoAppFileSettings  |  ( |   | )
◆ ~CRhinoAppFileSettings()
 CRhinoAppFileSettings::~CRhinoAppFileSettings  |  ( |   | )
default
◆ CRhinoAppFileSettings() [2/2]
 CRhinoAppFileSettings::CRhinoAppFileSettings  |  ( |  const CRhinoAppFileSettings &  |   | )
default
Member Function Documentation
◆ Defaults()
 void CRhinoAppFileSettings::Defaults  |  ( |   | )
◆ ImportFileLayerMatchingOption()
 unsigned int CRhinoAppFileSettings::ImportFileLayerMatchingOption  |  ( |   | ) |   const
The import file layer matching setting belongs on CRhinoAppFileSettings but that class cannot be modified without breaking the SDK. This setting controls what happens to layers when the contents of an external source file are imported into an existing model. The Import, Paste and Insert commands are a few of the ways a file can be imported into an existing model. 0 = import layer names using the full path found in the source file. 1 = if the source file has a layer with named "source_file_parent_layer_path/X" and the current model has a layer named "current_model_parent_layer_path/X", then change all references from "source_file_parent_layer_path/X" to "current_model_parent_layer_path/X" when importing items from the source file. This mimics Rhino 4.0 behavior, where all short layer names had to be unique and the parent path was ignored.
◆ LoadProfile()
 void CRhinoAppFileSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
◆ operator!=()
 bool CRhinoAppFileSettings::operator!=  |  ( |  const CRhinoAppFileSettings &  |  src | ) |   const
◆ operator=()
 CRhinoAppFileSettings& CRhinoAppFileSettings::operator=  |  ( |  const CRhinoAppFileSettings &  |   | )
default
◆ operator==()
 bool CRhinoAppFileSettings::operator==  |  ( |  const CRhinoAppFileSettings &  |  src | ) |   const
◆ SaveProfile()
 void CRhinoAppFileSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
◆ SetImportFileLayerMatchingOption()
 void CRhinoAppFileSettings::SetImportFileLayerMatchingOption  |  ( |  unsigned int  |  import_file_layer_matching_option | )
Member Data Documentation
◆ m_always_autosave_before_commands
 ON_ClassArray<ON_wString> CRhinoAppFileSettings::m_always_autosave_before_commands
List of commands that force AutoSave prior to running.
◆ m_autosave
 bool CRhinoAppFileSettings::m_autosave = true
enable autosave feature
◆ m_autosave_file
 ON_wString CRhinoAppFileSettings::m_autosave_file
AutoSave options.
name of the default autosave file (<RhinoInstallFolder>.3dm)
◆ m_autosave_increment
 int CRhinoAppFileSettings::m_autosave_increment = 20
how many minutes between autosaves
◆ m_autosave_meshes
 bool CRhinoAppFileSettings::m_autosave_meshes = false
save render and display meshes
◆ m_bCreate3dmBakFiles
 bool CRhinoAppFileSettings::m_bCreate3dmBakFiles = true
default = true
means you will double the size of what is saved in the clipboard but will be able to copy from the current to the previous version using the clipboard. By default, any preexisting .3dm files are renamed .3dm.back when Rhino saves. If this m_bCreate3dmBakFiles is false, then Rhino does not create .3dmbak files.
◆ m_clipboard_on_exit
 clipboard_on_exit CRhinoAppFileSettings::m_clipboard_on_exit = CRhinoAppFileSettings::clipboard_on_exit::prompt_user_when_clipboard_big
◆ m_copy_to_previous_rhino_version
 bool CRhinoAppFileSettings::m_copy_to_previous_rhino_version = true
Clipboard options.
Copy both objects to the clipboard in both the current and previous Rhino clipboard formats. This
◆ m_default_template_file
 ON_wString CRhinoAppFileSettings::m_default_template_file
template file loaded when Rhino starts and the default file name for OpenTemplateFile dialog
◆ m_enable_file_locking
 bool CRhinoAppFileSettings::m_enable_file_locking = true
Ensure that only one person at a time can have a file open for saving.
◆ m_enable_file_locking_open_warning
 bool CRhinoAppFileSettings::m_enable_file_locking_open_warning = true
Display information dialog which identifies computer file is open on.
◆ m_keep_multiple_recycled_autosave_files
 bool CRhinoAppFileSettings::m_keep_multiple_recycled_autosave_files = true
Keep multiple copies of autosave files in recycle bin.
◆ m_recycle_autosave_files
 bool CRhinoAppFileSettings::m_recycle_autosave_files = true
Move autosave files to recycle bin.
◆ m_save_view_changes
 bool CRhinoAppFileSettings::m_save_view_changes = false
true for users who consider view changes a document change
◆ m_template_files
 ON_wString CRhinoAppFileSettings::m_template_files
default template file folder (RhinoInstallFolder)