Public Member Functions | List of all members
CRhRdkIORContextMenu Class Referencefinal
RDK
#include <RhRdkIORContextMenu.h>
 Public Member Functions
CRhRdkIORContextMenu ()
~CRhRdkIORContextMenu ()
bool  | TrackMenu (HWND pWnd, const ON_2iPoint &point, double &dIOROut, ON_wString *pStringOut=nullptr) const
Detailed Description
This class displays a context menu containing an extensive list of substances with their IOR values. It is designed to be used from an OnContextMenu handler. Create an instance on the stack and call its TrackMenu() method.
Constructor & Destructor Documentation
◆ CRhRdkIORContextMenu()
 CRhRdkIORContextMenu::CRhRdkIORContextMenu  |  ( |   | )
◆ ~CRhRdkIORContextMenu()
 CRhRdkIORContextMenu::~CRhRdkIORContextMenu  |  ( |   | )
Member Function Documentation
◆ TrackMenu()
 bool CRhRdkIORContextMenu::TrackMenu  |  ( |  HWND  |  pWnd,
|  const ON_2iPoint &  |  point,
|  double &  |  dIOROut,
|  ON_wString *  |  pStringOut = nullptr
) |   |  const
Display and track the context menu.
Parameters
pWnd | is the window that displays the menu, for example an edit box.
point | is the position to display the menu at inside the window.
dIOROut | accepts the IOR value of the user's chosen substance.
pStringOut | accepts the name of the user's chosen substance. Can be NULL if not required.
Returns
true if the user chose a substance, else false.