Public Member Functions | Static Public Attributes | Protected Member Functions | Protected Attributes | List of all members
CRhinoAppAliasList Class Reference
Rhino
 More...
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppAliasList ()
CRhinoAppAliasList (const CRhinoAppAliasList &src)
bool  | AddAlias (const wchar_t *alias, const wchar_t *macro)
const CRhinoCommandAlias *  | Alias (int index) const
start at 0, return NULL when index is out of range More...
int  | AliasIndex (const wchar_t *alias) const
returns -1 if not found More...
int  | Count () const
void  | Defaults ()
bool  | DeleteAlias (int index)
bool  | DeleteAlias (const wchar_t *)
void  | DestroyAliasList ()
remove all aliases from the list More...
const CRhinoCommandAlias *  | FindAlias (const wchar_t *) const
bool  | GetMatchingAliases (const wchar_t *sPartialName, ON_SimpleArray< CRhinoCommandAlias *> &alias_list)
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | ModifyAlias (int index, const wchar_t *alias, const wchar_t *macro)
bool  | ModifyAliasMacro (int index, const wchar_t *macro)
bool  | ModifyAliasName (int index, const wchar_t *alias)
bool  | operator!= (const CRhinoAppAliasList &) const
CRhinoAppAliasList &  | operator= (const CRhinoAppAliasList &src)
bool  | operator== (const CRhinoAppAliasList &) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
 Static Public Attributes
static const CRhinoAppAliasList  | Default
 Protected Member Functions
CRhinoCommandAlias *  | A (int)
bool  | InRange (int) const
 Protected Attributes
ON_ClassArray< CRhinoCommandAlias >  | m_alias_list
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoAppAliasList() [1/2]
 CRhinoAppAliasList::CRhinoAppAliasList  |  ( |   | )
◆ CRhinoAppAliasList() [2/2]
 CRhinoAppAliasList::CRhinoAppAliasList  |  ( |  const CRhinoAppAliasList &  |  src | )
Member Function Documentation
◆ A()
 CRhinoCommandAlias* CRhinoAppAliasList::A  |  ( |  int  |   | )
protected
◆ AddAlias()
 bool CRhinoAppAliasList::AddAlias  |  ( |  const wchar_t *  |  alias,
|  const wchar_t *  |  macro
)
return true if added, false if already in the list.
◆ Alias()
 const CRhinoCommandAlias* CRhinoAppAliasList::Alias  |  ( |  int  |  index | ) |   const
start at 0, return NULL when index is out of range
◆ AliasIndex()
 int CRhinoAppAliasList::AliasIndex  |  ( |  const wchar_t *  |  alias | ) |   const
returns -1 if not found
◆ Count()
 int CRhinoAppAliasList::Count  |  ( |   | ) |   const
◆ Defaults()
 void CRhinoAppAliasList::Defaults  |  ( |   | )
◆ DeleteAlias() [1/2]
 bool CRhinoAppAliasList::DeleteAlias  |  ( |  int  |  index | )
◆ DeleteAlias() [2/2]
 bool CRhinoAppAliasList::DeleteAlias  |  ( |  const wchar_t *  |   | )
◆ DestroyAliasList()
 void CRhinoAppAliasList::DestroyAliasList  |  ( |   | )
remove all aliases from the list
◆ FindAlias()
 const CRhinoCommandAlias* CRhinoAppAliasList::FindAlias  |  ( |  const wchar_t *  |   | ) |   const
◆ GetMatchingAliases()
 bool CRhinoAppAliasList::GetMatchingAliases  |  ( |  const wchar_t *  |  sPartialName,
|  ON_SimpleArray< CRhinoCommandAlias *> &  |  alias_list
)
◆ InRange()
 bool CRhinoAppAliasList::InRange  |  ( |  int  |   | ) |   const
protected
◆ LoadProfile()
 void CRhinoAppAliasList::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ ModifyAlias()
 bool CRhinoAppAliasList::ModifyAlias  |  ( |  int  |  index,
|  const wchar_t *  |  alias,
|  const wchar_t *  |  macro
)
◆ ModifyAliasMacro()
 bool CRhinoAppAliasList::ModifyAliasMacro  |  ( |  int  |  index,
|  const wchar_t *  |  macro
)
◆ ModifyAliasName()
 bool CRhinoAppAliasList::ModifyAliasName  |  ( |  int  |  index,
|  const wchar_t *  |  alias
)
◆ operator!=()
 bool CRhinoAppAliasList::operator!=  |  ( |  const CRhinoAppAliasList &  |   | ) |   const
◆ operator=()
 CRhinoAppAliasList& CRhinoAppAliasList::operator=  |  ( |  const CRhinoAppAliasList &  |  src | )
◆ operator==()
 bool CRhinoAppAliasList::operator==  |  ( |  const CRhinoAppAliasList &  |   | ) |   const
◆ SaveProfile()
 void CRhinoAppAliasList::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
Member Data Documentation
◆ Default
 const CRhinoAppAliasList CRhinoAppAliasList::Default
static
◆ m_alias_list
 ON_ClassArray<CRhinoCommandAlias> CRhinoAppAliasList::m_alias_list
protected