Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
CRhRdkAngleCtrl Class Reference
RDK
#include <RhRdkAngleCtrl.h>
 Inheritance diagram for CRhRdkAngleCtrl:
 Public Types
enum  | Style : unsigned int {
 Style::kUnmarked, Style::kCompass, Style::kAzimuth, Style::kAltitude,
 Style::kAltitude0
 }
 Public Member Functions
RDK_DEPRECATED  | CRhRdkAngleCtrl (eStyle s)
CRhRdkAngleCtrl (Style s)
virtual  | ~CRhRdkAngleCtrl ()
virtual double  | Angle (void) const
virtual bool  | Create (DWORD dwStyle, const ON_4iRect &rect, HWND pParent, UINT uID)
virtual void  | EnableWindow (bool bEnable)
virtual bool  | IsWindow (void) const
virtual void  | MoveWindow (const ON_4iRect &rect)
operator HWND (void) const
virtual void  | SetAngle (double dAngle)
virtual void  | SetBackgroundColor (COLORREF col)
virtual void  | SetDebugColorsOn (bool bOn)
virtual void  | SetDecoratorPost (IRhRdkAngleDialDecorator *pDecorator)
virtual void  | SetDecoratorPre (IRhRdkAngleDialDecorator *pDecorator)
virtual void  | SetDialColors (COLORREF col1, COLORREF col2)
virtual void  | SetHotTrackingOn (bool bOn)
virtual void  | ShowWindow (bool bShow)
HWND  | Wnd (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Static Public Member Functions
static UINT  | ChangedMessageNumber (void)
static UINT  | EndDragMessageNumber (void)
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
 Public Attributes
CImpl *  | m_pImpl
Detailed Description
This class is a control which can be placed on a dialog to allow the user to set an angle.
Member Enumeration Documentation
◆ Style
 enum CRhRdkAngleCtrl::Style : unsigned int
strong
Enumerator
kUnmarked
kCompass
kAzimuth
kAltitude
kAltitude0
Constructor & Destructor Documentation
◆ CRhRdkAngleCtrl() [1/2]
 RDK_DEPRECATED CRhRdkAngleCtrl::CRhRdkAngleCtrl  |  ( |  eStyle  |  s | )
◆ CRhRdkAngleCtrl() [2/2]
 CRhRdkAngleCtrl::CRhRdkAngleCtrl  |  ( |  Style  |  s | )
◆ ~CRhRdkAngleCtrl()
 virtual CRhRdkAngleCtrl::~CRhRdkAngleCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ Angle()
 virtual double CRhRdkAngleCtrl::Angle  |  ( |  void  |   | ) |   const
virtual
Returns
The angle, in degrees, that the control is displaying.
◆ ChangedMessageNumber()
 static UINT CRhRdkAngleCtrl::ChangedMessageNumber  |  ( |  void  |   | )
static
A message is sent continuously to the parent window when the user plays with the control. Example usage:
const UINT uAngleChangedMsg = CRhRdkAngleCtrl::ChangedMessageNumber();
...
BEGIN_MESSAGE_MAP(CMyDialog, CDialog)
 ON_REGISTERED_MESSAGE(uAngleChangedMsg, OnAngleChanged)
END_MESSAGE_MAP()
...
LRESULT CMyDialog::OnAngleChanged(WPARAM, LPARAM ctrlID)
{
 CWnd* pWnd = GetDlgItem(ctrlID);
 ...
 return 1;
}
◆ Create()
 virtual bool CRhRdkAngleCtrl::Create  |  ( |  DWORD  |  dwStyle,
|  const ON_4iRect &  |  rect,
|  HWND  |  pParent,
|  UINT  |  uID
)
virtual
Create the control.
Parameters
dwStyle | specifies window styles for the control.
rect | specifies the size and position of the control in client coords of pParent.
pParent | is the parent window.
uID | is the ID of the control.
Returns
true if created successfully, else false.
◆ EnableWindow()
 virtual void CRhRdkAngleCtrl::EnableWindow  |  ( |  bool  |  bEnable | )
virtual
◆ EndDragMessageNumber()
 static UINT CRhRdkAngleCtrl::EndDragMessageNumber  |  ( |  void  |   | )
static
A message is sent to the parent window when the user stops dragging the control. Example usage:
const UINT uAngleEndDragMsg = CRhRdkAngleCtrl::EndDragMessageNumber();
...
BEGIN_MESSAGE_MAP(CMyDialog, CDialog)
 ON_REGISTERED_MESSAGE(uAngleEndDragMsg, OnAngleEndDrag)
END_MESSAGE_MAP()
...
LRESULT CMyDialog::OnAngleEndDrag(WPARAM, LPARAM ctrlID)
{
 CWnd* pWnd = GetDlgItem(ctrlID);
 ...
 return 1;
}
◆ IsWindow()
 virtual bool CRhRdkAngleCtrl::IsWindow  |  ( |  void  |   | ) |   const
virtual
◆ MoveWindow()
 virtual void CRhRdkAngleCtrl::MoveWindow  |  ( |  const ON_4iRect &  |  rect | )
virtual
◆ operator HWND()
 CRhRdkAngleCtrl::operator HWND  |  ( |  void  |   | ) |   const
◆ SetAngle()
 virtual void CRhRdkAngleCtrl::SetAngle  |  ( |  double  |  dAngle | )
virtual
Set the angle that the control displays.
Parameters
dAngle | is the angle in degrees.
◆ SetBackgroundColor()
 virtual void CRhRdkAngleCtrl::SetBackgroundColor  |  ( |  COLORREF  |  col | )
virtual
Set the background color of the control.
◆ SetDebugColorsOn()
 virtual void CRhRdkAngleCtrl::SetDebugColorsOn  |  ( |  bool  |  bOn | )
virtual
Set debugging colors on or off. This can be used as an aid to placing the control on a dialog. When on, the control is painted in red and the text rectangle is painted in green.
◆ SetDecoratorPost()
 virtual void CRhRdkAngleCtrl::SetDecoratorPost  |  ( |  IRhRdkAngleDialDecorator *  |  pDecorator | )
virtual
Set a decorator to the control. The control takes ownership of the decorator. This decorator is drawn after the dial lines.
◆ SetDecoratorPre()
 virtual void CRhRdkAngleCtrl::SetDecoratorPre  |  ( |  IRhRdkAngleDialDecorator *  |  pDecorator | )
virtual
Set a decorator to the control. The control takes ownership of the decorator. This decorator is drawn before the dial lines.
◆ SetDialColors()
 virtual void CRhRdkAngleCtrl::SetDialColors  |  ( |  COLORREF  |  col1,
|  COLORREF  |  col2
)
virtual
Set the colors of the circular dial when the style is kUnmarked, kCompass or kAzimuth. The dial will be shaded with a blend from col1 to col2 and the blend will rotate with the dial's angle setting.
Note
It is also possible to implement IRhRdkAngleDialDecorator to override these colors dynamically.
◆ SetHotTrackingOn()
 virtual void CRhRdkAngleCtrl::SetHotTrackingOn  |  ( |  bool  |  bOn | )
virtual
Set hot-tracking of the control on or off.
◆ ShowWindow()
 virtual void CRhRdkAngleCtrl::ShowWindow  |  ( |  bool  |  bShow | )
virtual
◆ Wnd()
 HWND CRhRdkAngleCtrl::Wnd  |  ( |  void  |   | ) |   const
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkAngleCtrl::m_pImpl