Public Member Functions | Public Attributes | List of all members
CRhRdkRgbGradientSwatch Class Reference
RDK
#include <RhRdkCurveGraph.h>
 Public Member Functions
CRhRdkRgbGradientSwatch ()
virtual  | ~CRhRdkRgbGradientSwatch ()
virtual bool  | Create (unsigned long uStyle, const ON_4iRect &rect, HWND pParent, unsigned int uID)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
operator HWND (void) const
virtual void  | SetGraphXML (const CRhRdkVariant &vXML)
virtual HWND  | Wnd (void) const
 Public Attributes
CImpl *  | m_pImpl
Detailed Description
Displays a gradient swatch suitable for showing the effect of an RGBA curve.
Constructor & Destructor Documentation
◆ CRhRdkRgbGradientSwatch()
 CRhRdkRgbGradientSwatch::CRhRdkRgbGradientSwatch  |  ( |   | )
◆ ~CRhRdkRgbGradientSwatch()
 virtual CRhRdkRgbGradientSwatch::~CRhRdkRgbGradientSwatch  |  ( |   | )
virtual
Member Function Documentation
◆ Create()
 virtual bool CRhRdkRgbGradientSwatch::Create  |  ( |  unsigned long  |  uStyle,
|  const ON_4iRect &  |  rect,
|  HWND  |  pParent,
|  unsigned int  |  uID
)
virtual
Create the control.
Parameters
uStyle | specifies window styles for the control.
rect | specifies the size and position of the control in client coords of pParent.
pParent | is the parent window.
uID | is the ID of the control.
Returns
true if created successfully, else false.
◆ EVF()
 virtual void* CRhRdkRgbGradientSwatch::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
◆ operator HWND()
 CRhRdkRgbGradientSwatch::operator HWND  |  ( |  void  |   | ) |   const
Get the underlying window of the control.
◆ SetGraphXML()
 virtual void CRhRdkRgbGradientSwatch::SetGraphXML  |  ( |  const CRhRdkVariant &  |  vXML | )
virtual
Set the control up from graph XML.
Parameters
vXML | should be a string containing XML from CRhRdkCurveGraph. This value can be set to 'varies' in which case the swatch displays "(varies)".
◆ Wnd()
 virtual HWND CRhRdkRgbGradientSwatch::Wnd  |  ( |  void  |   | ) |   const
virtual
Get the underlying window of the control.
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkRgbGradientSwatch::m_pImpl