Public Member Functions | List of all members
CRhRdkMaterialCtrl Class Reference
RDK
#include <RhRdkContentCtrl.h>
 Inheritance diagram for CRhRdkMaterialCtrl:
 Public Member Functions
CRhRdkMaterialCtrl ()
virtual CRhRdkContentKindList  | AllowedKinds (void) const
 Public Member Functions inherited from CRhRdkContentCtrl
CRhRdkContentCtrl ()
virtual  | ~CRhRdkContentCtrl ()
virtual bool  | GetContentArray (CRhRdkContentArray &aOut) const
virtual RDK_DEPRECATED CRhRdkVariant  | InstanceId (void) const
virtual bool  | SetContentArray (const CRhRdkContentArray &a)
virtual RDK_DEPRECATED bool  | SetInstanceId (const CRhRdkVariant &vInstance, bool bNotify)
 Public Member Functions inherited from CRhRdkContentCtrlBase
CRhRdkContentCtrlBase ()
virtual  | ~CRhRdkContentCtrlBase ()
virtual bool  | AmountEnabled (void) const
virtual bool  | AmountVaries (void) const
virtual void  | Change (void)
virtual bool  | CheckEnabled (void) const
CRhRdkControllerPtr  | Controller (void) const
virtual bool  | CreateWnd (DWORD dwStyle, const RECT &rect, CWnd *pParent, UINT uID)
virtual void  | DisplayData (void)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual double  | GetAmount (void) const
virtual CRhRdkVariant  | GetChannelCustom (void) const
virtual CRhRdkVariant  | GetChannelMode (void) const
virtual UINT  | GetCheck (void) const
virtual bool  | IsEmpty (void) const
virtual void  | OnAmountChanged (void)
virtual void  | OnChange (void)
virtual void  | OnCheckChanged (void)
virtual bool  | ReadOnly (void) const
virtual void  | SetAmount (double d)
virtual void  | SetAmountBounds (double dMin, double dMax)
virtual void  | SetAmountEnabled (bool b)
virtual void  | SetAmountVaries (bool b=true)
virtual void  | SetChannelCustom (const CRhRdkVariant &vString)
virtual bool  | SetChannelMode (const CRhRdkVariant &vMode)
virtual void  | SetCheck (UINT u)
virtual void  | SetCheckEnabled (bool b)
void  | SetController (CRhRdkControllerPtr con)
virtual void  | SetReadOnly (bool b)
virtual void  | ShowAmount (bool b)
virtual void  | ShowCheck (bool b)
virtual void  | ShowIcon (bool b)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkContentCtrl
static RDK_DEPRECATED UINT  | ChangedMessageNumber (void)
static RDK_DEPRECATED UINT  | ChangingMessageNumber (void)
static void  | NewDataSources (OUT ON_SimpleArray< IRhinoUiDataSource *> &aDS, const CRhRdkDocument *pRdkDoc)
 Static Public Member Functions inherited from CRhRdkContentCtrlBase
static RDK_DEPRECATED UINT  | AmountMessageNumber (void)
static RDK_DEPRECATED UINT  | CheckMessageNumber (void)
 Protected Member Functions inherited from CRhRdkContentCtrl
virtual IRhRdkContentCtrlBase *  | GetBaseInterface (void) const override
RDK_DEPRECATED afx_msg LRESULT  | OnChanged (WPARAM, LPARAM)
RDK_DEPRECATED afx_msg LRESULT  | OnChanging (WPARAM, LPARAM)
 Protected Member Functions inherited from CRhRdkContentCtrlBase
virtual void  | Initialize (void)
RDK_DEPRECATED afx_msg LRESULT  | OnAmount (WPARAM, LPARAM)
RDK_DEPRECATED afx_msg LRESULT  | OnCheck (WPARAM, LPARAM)
afx_msg int  | OnCreate (LPCREATESTRUCT)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnEnable (BOOL bEnable)
afx_msg BOOL  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | PreSubclassWindow () override
 Protected Attributes inherited from CRhRdkContentCtrl
CImpl *  | m_pImpl
Constructor & Destructor Documentation
◆ CRhRdkMaterialCtrl()
 CRhRdkMaterialCtrl::CRhRdkMaterialCtrl  |  ( |   | )
Member Function Documentation
◆ AllowedKinds()
 virtual CRhRdkContentKindList CRhRdkMaterialCtrl::AllowedKinds  |  ( |  void  |   | ) |   const
virtual
Returns
The kinds of content associated with the control. This can be a single kind or a semicolon-delimited string of multiple kinds.
Implements CRhRdkContentCtrl.