Public Types | Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoCurvatureAnalysisSettings Class Reference
Rhino
 More...
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | { kappa_gaussian, kappa_mean, kappa_minradius, kappa_maxradius }
Style for drawing centermark for Radial dimensions and Centermark objects More...
 Public Member Functions
CRhinoCurvatureAnalysisSettings ()
ON__UINT32  | ColorMappingCRC () const
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoCurvatureAnalysisSettings &other) const
bool  | operator== (const CRhinoCurvatureAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
clamp settings to valid values More...
 Public Attributes
ON_Interval  | m_gauss_range
ON_Interval  | m_maxradius_range
ON_Interval  | m_mean_range
ON_Interval  | m_minradius_range
bool  | m_show_isoparms
enum CRhinoCurvatureAnalysisSettings:: { ... }  | m_style
Style for drawing centermark for Radial dimensions and Centermark objects More...
 Static Public Attributes
static const CRhinoCurvatureAnalysisSettings  | Default
Detailed Description
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Style for drawing centermark for Radial dimensions and Centermark objects
Enumerator
kappa_gaussian
kappa_mean
kappa_minradius
kappa_maxradius
Constructor & Destructor Documentation
◆ CRhinoCurvatureAnalysisSettings()
 CRhinoCurvatureAnalysisSettings::CRhinoCurvatureAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ ColorMappingCRC()
 ON__UINT32 CRhinoCurvatureAnalysisSettings::ColorMappingCRC  |  ( |   | ) |   const
◆ Defaults()
 void CRhinoCurvatureAnalysisSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoCurvatureAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoCurvatureAnalysisSettings::operator!=  |  ( |  const CRhinoCurvatureAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoCurvatureAnalysisSettings::operator==  |  ( |  const CRhinoCurvatureAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoCurvatureAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoCurvatureAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoCurvatureAnalysisSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoCurvatureAnalysisSettings CRhinoCurvatureAnalysisSettings::Default
static
◆ m_gauss_range
 ON_Interval CRhinoCurvatureAnalysisSettings::m_gauss_range
◆ m_maxradius_range
 ON_Interval CRhinoCurvatureAnalysisSettings::m_maxradius_range
◆ m_mean_range
 ON_Interval CRhinoCurvatureAnalysisSettings::m_mean_range
◆ m_minradius_range
 ON_Interval CRhinoCurvatureAnalysisSettings::m_minradius_range
◆ m_show_isoparms
 bool CRhinoCurvatureAnalysisSettings::m_show_isoparms
◆ m_style
 enum { ... } CRhinoCurvatureAnalysisSettings::m_style
Style for drawing centermark for Radial dimensions and Centermark objects