Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDEdgePtr Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
class ON_SubDEdge *  | Edge () const
ON__UINT_PTR  | EdgeDirection () const
bool  | IsNull () const
ON_SubDEdgePtr  | Reversed () const
ON_ComponentStatus  | Status () const
 Static Public Member Functions
static ON_SubDEdgePtr  | Create (const class ON_SubDEdge *edge, ON__UINT_PTR direction)
static ON_SubDEdgePtr  | Create (const class ON_SubDComponentPtr &edge_component)
 Public Attributes
ON__UINT_PTR  | m_ptr
 Static Public Attributes
static const ON_SubDEdgePtr  | Null
Member Function Documentation
◆ Create() [1/2]
 static ON_SubDEdgePtr ON_SubDEdgePtr::Create  |  ( |  const class ON_SubDEdge *  |  edge,
|  ON__UINT_PTR  |  direction
)
static
◆ Create() [2/2]
 static ON_SubDEdgePtr ON_SubDEdgePtr::Create  |  ( |  const class ON_SubDComponentPtr &  |  edge_component | )
static
◆ Edge()
 class ON_SubDEdge* ON_SubDEdgePtr::Edge  |  ( |   | ) |   const
◆ EdgeDirection()
 ON__UINT_PTR ON_SubDEdgePtr::EdgeDirection  |  ( |   | ) |   const
◆ IsNull()
 bool ON_SubDEdgePtr::IsNull  |  ( |   | ) |   const
◆ Reversed()
 ON_SubDEdgePtr ON_SubDEdgePtr::Reversed  |  ( |   | ) |   const
Returns: A pointer to the same edge with the direction flipped
◆ Status()
 ON_ComponentStatus ON_SubDEdgePtr::Status  |  ( |   | ) |   const
Member Data Documentation
◆ m_ptr
 ON__UINT_PTR ON_SubDEdgePtr::m_ptr
For performance reasons, m_ptr is not initialized and no constructors are declared or implemented. If you require initialization, then use x = ON_SubDEdgePtr::Null or x = ON_SubDEdgePtr::Create(...).
◆ Null
 const ON_SubDEdgePtr ON_SubDEdgePtr::Null
static