Public Member Functions | List of all members
CRhRdkSdkContentSelector Class Reference
RDK
#include <RhRdkPlugIn.h>
 Public Member Functions
CRhRdkSdkContentSelector (const UUID &uuidTarget, const CRhinoDoc &doc, UINT_PTR uReserved=0)
virtual  | ~CRhRdkSdkContentSelector ()
virtual void *  | EVF (const wchar_t *, void *)
virtual bool  | GetSelection (CRhRdkInstanceIdArray &aContentOut) const
virtual bool  | SetSelection (const CRhRdkInstanceIdArray &aContent) const
virtual bool  | UnselectAllContent (void) const
Detailed Description
This class is deprecated and not implemented.
Constructor & Destructor Documentation
◆ CRhRdkSdkContentSelector()
 CRhRdkSdkContentSelector::CRhRdkSdkContentSelector  |  ( |  const UUID &  |  uuidTarget,
|  const CRhinoDoc &  |  doc,
|  UINT_PTR  |  uReserved = 0
)
◆ ~CRhRdkSdkContentSelector()
 virtual CRhRdkSdkContentSelector::~CRhRdkSdkContentSelector  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* CRhRdkSdkContentSelector::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
◆ GetSelection()
 virtual bool CRhRdkSdkContentSelector::GetSelection  |  ( |  CRhRdkInstanceIdArray &  |  aContentOut | ) |   const
virtual
◆ SetSelection()
 virtual bool CRhRdkSdkContentSelector::SetSelection  |  ( |  const CRhRdkInstanceIdArray &  |  aContent | ) |   const
virtual
◆ UnselectAllContent()
 virtual bool CRhRdkSdkContentSelector::UnselectAllContent  |  ( |  void  |   | ) |   const
virtual