Public Types | Static Public Member Functions | List of all members
CRhinoFilletEdge Class Reference
Rhino
#include <rhinoSdkUtilities.h>
 Public Types
enum  | BlendType { Chamfer, Fillet, Blend }
enum  | RailType { DistFromEdge, RollingBall, DistBetweenRails }
 Static Public Member Functions
static bool  | FilletEdges (const ON_Brep &brep, const ON_SimpleArray< int > &edges, const ON_SimpleArray< double > &radii0, const ON_SimpleArray< double > &radii1, CRhinoFilletEdge::BlendType blend_type, CRhinoFilletEdge::RailType rail_type, double tolerance, ON_SimpleArray< ON_Brep *> &out_breps)
Member Enumeration Documentation
◆ BlendType
 enum CRhinoFilletEdge::BlendType
Enumerator
Chamfer
Creates a ruled surface between brep edges with varying chamfer distances.
Fillet
The brep is trimmed and joined to the chamfer surfaces.
Creates a tangent surface between brep edges with varying radius values.
Blend
The brep is trimmed and joined to the fillet surfaces.
Creates a curvature-continuous blend surface between brep edges with varying radius values.
◆ RailType
 enum CRhinoFilletEdge::RailType
Enumerator
DistFromEdge
The distance from the edge curves determines the intersection.
RollingBall
The radius of a rolling ball determines the intersection.
DistBetweenRails
The distance between the edge rails determines the intersection.
Member Function Documentation
◆ FilletEdges()
 static bool CRhinoFilletEdge::FilletEdges  |  ( |  const ON_Brep &  |  brep,
|  const ON_SimpleArray< int > &  |  edges,
|  const ON_SimpleArray< double > &  |  radii0,
|  const ON_SimpleArray< double > &  |  radii1,
|  CRhinoFilletEdge::BlendType  |  blend_type,
|  CRhinoFilletEdge::RailType  |  rail_type,
|  double  |  tolerance,
|  ON_SimpleArray< ON_Brep *> &  |  out_breps
)
static
Description: Fillets, chamfers, or blends the edges of a brep. Parameters: brep [in] - The brep to fillet, chamfer, or blend edges. edges [in] - An array of one or more edge indices where the fillet, chamfer, or blend will occur. radii0 [in] - An array of starting fillet, chamfer, or blend radaii, one for each edge index. radii1 [in] - An array of end fillet, chamfer, or blend radaii, one for each edge index. blend_type [in] - The blend type (see above). rail_type [in] - The rail type (see above). tolerance [in] - The tolerance to be used to perform calculations. out_breps [out] - The results of the operation. It is the responsibility of the caller to clean up the memory. Return: True if successful, False otherwise Remarks: CRITICAL: Memory for the resulting breps is allocated. It is the calling functions responsibility to clean up the memory.