Public Member Functions | List of all members
CRhRdkTextureCache Class Reference
RDK
#include <RhRdkTextureCache.h>
 Inheritance diagram for CRhRdkTextureCache:
 Public Member Functions
CRhRdkTextureCache (const ON_2iSize &size, DWORD dwCRC)
virtual  | ~CRhRdkTextureCache ()
virtual void  | AddTexture (const CRhinoDib &dib)
virtual ON_wString  | Filename (void) const
virtual bool  | HasCachedTexture (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Detailed Description
This object gives access to RDK's texture cache. Textures are cached on disk using file names that are derived from a combination of the texture size and a CRC of the parameters that were used to render the texture.
Constructor & Destructor Documentation
◆ CRhRdkTextureCache()
 CRhRdkTextureCache::CRhRdkTextureCache  |  ( |  const ON_2iSize &  |  size,
|  DWORD  |  dwCRC
)
Instantiate this object on the stack.
Parameters
size | is the size of the texture in pixels.
dwCRC | is a CRC of all parameters that were used to create the texture imagery.
◆ ~CRhRdkTextureCache()
 virtual CRhRdkTextureCache::~CRhRdkTextureCache  |  ( |   | )
virtual
Member Function Documentation
◆ AddTexture()
 virtual void CRhRdkTextureCache::AddTexture  |  ( |  const CRhinoDib &  |  dib | )
virtual
Add a texture to the cache for this texture size and CRC. If the texture file already exists it will be overwritten.
◆ Filename()
 virtual ON_wString CRhRdkTextureCache::Filename  |  ( |  void  |   | ) |   const
virtual
Get the full path to the texture file on disk.
◆ HasCachedTexture()
 virtual bool CRhRdkTextureCache::HasCachedTexture  |  ( |  void  |   | ) |   const
virtual
Returns
true if there is a cached texture on disk for this texture size and CRC.