Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_ManagedFonts Class Reference
OpenNURBS
#include <opennurbs_internal_glyph.h>
 Public Member Functions
const ON_Font *  | GetFromFontCharacteristics (const ON_Font &font_characteristics, bool bCreateIfNotFound)
const ON_Font *  | GetFromSerialNumber (unsigned int managed_font_runtime_serial_number)
void  | GetInstalledFontFamily (const wchar_t *font_family_name, ON_SimpleArray< const ON_Font * > &installed_fonts) const
const ON_Font *  | InstalledFontBestMatch (const ON_Font *font) const
const ON_SimpleArray< const ON_Font *> &  | InstalledFontsSortedByFamilyName () const
const ON_SimpleArray< const ON_Font *> &  | InstalledFontsSortedByPostScriptName () const
const ON_SimpleArray< const ON_Font *> &  | ManagedFonts () const
 Static Public Member Functions
static void  | GetFontMetrics (const ON_Font *font, ON_FontMetrics &font_unit_font_metrics)
static ON__UINT_PTR  | GetGlyphMetrics (const class ON_Font *font, ON__UINT32 unicode_code_point, class ON_TextBox &font_unit_glyph_box)
 Static Public Attributes
static ON_ManagedFonts  | List
List is the only instance of this class. More...
Member Function Documentation
◆ GetFontMetrics()
 static void ON_ManagedFonts::GetFontMetrics  |  ( |  const ON_Font *  |  font,
|  ON_FontMetrics &  |  font_unit_font_metrics
)
static
◆ GetFromFontCharacteristics()
 const ON_Font* ON_ManagedFonts::GetFromFontCharacteristics  |  ( |  const ON_Font &  |  font_characteristics,
|  bool  |  bCreateIfNotFound
)
◆ GetFromSerialNumber()
 const ON_Font* ON_ManagedFonts::GetFromSerialNumber  |  ( |  unsigned int  |  managed_font_runtime_serial_number | )
◆ GetGlyphMetrics()
 static ON__UINT_PTR ON_ManagedFonts::GetGlyphMetrics  |  ( |  const class ON_Font *  |  font,
|  ON__UINT32  |  unicode_code_point,
|  class ON_TextBox &  |  font_unit_glyph_box
)
static
Returns: 0: failure >0: success font glyph id
◆ GetInstalledFontFamily()
 void ON_ManagedFonts::GetInstalledFontFamily  |  ( |  const wchar_t *  |  font_family_name,
|  ON_SimpleArray< const ON_Font * > &  |  installed_fonts
) |   |  const
◆ InstalledFontBestMatch()
 const ON_Font* ON_ManagedFonts::InstalledFontBestMatch  |  ( |  const ON_Font *  |  font | ) |   const
Parameters: font - [in] font to match Returns: If there is a font installed on the current computer that has the same family name. The one that has the best match in style, weight, and stretch is returned.
◆ InstalledFontsSortedByFamilyName()
 const ON_SimpleArray< const ON_Font* >& ON_ManagedFonts::InstalledFontsSortedByFamilyName  |  ( |   | ) |   const
◆ InstalledFontsSortedByPostScriptName()
 const ON_SimpleArray< const ON_Font* >& ON_ManagedFonts::InstalledFontsSortedByPostScriptName  |  ( |   | ) |   const
Returns A list of fonts available on the current computer. This is typically a long list. The fonts in this list are not managed.
◆ ManagedFonts()
 const ON_SimpleArray< const ON_Font* >& ON_ManagedFonts::ManagedFonts  |  ( |   | ) |   const
Returns Current list of managed fonts sorted by serial number. This list may be modified by any font operations. Use a copy if the list will be referenced after any call to code that may add a new managed font.
Member Data Documentation
◆ List
 ON_ManagedFonts ON_ManagedFonts::List
static
List is the only instance of this class.