Public Member Functions | Protected Member Functions | List of all members
IRhinoUiEventInfo Class Referenceabstract
RDK
#include <RhRdkDataSource.h>
 Inheritance diagram for IRhinoUiEventInfo:
 Public Member Functions
virtual void *  | EVF (const wchar_t *, void *)=0
 Protected Member Functions
virtual  | ~IRhinoUiEventInfo ()
Detailed Description
Used by certain data source events. Depending on the event UUID this interface is cast to a more specific interface to allow information about the event to be retrieved.
Constructor & Destructor Documentation
◆ ~IRhinoUiEventInfo()
 virtual IRhinoUiEventInfo::~IRhinoUiEventInfo  |  ( |   | )
inlineprotectedvirtual
Member Function Documentation
◆ EVF()
 virtual void* IRhinoUiEventInfo::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
pure virtual
Emergency virtual function for future expansion.