Public Member Functions | List of all members
CRhRdkActions Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkActions:
 Public Member Functions
CRhRdkActions ()
virtual  | ~CRhRdkActions ()
virtual CRhRdkAction *  | Action (int iIndex) const
virtual bool  | Add (CRhRdkAction *pAction)
virtual int  | Count (void) const
virtual CRhRdkAction *  | Find (const UUID &uuidAction) const
virtual CRhRdkAction *  | Find (unsigned short cmd) const
 Public Member Functions inherited from IRhRdkActions
virtual  | ~IRhRdkActions ()
virtual void *  | EVF (const wchar_t *, void *)=0
Constructor & Destructor Documentation
◆ CRhRdkActions()
 CRhRdkActions::CRhRdkActions  |  ( |   | )
◆ ~CRhRdkActions()
 virtual CRhRdkActions::~CRhRdkActions  |  ( |   | )
virtual
Member Function Documentation
◆ Action()
 virtual CRhRdkAction* CRhRdkActions::Action  |  ( |  int  |  iIndex | ) |   const
virtual
Get an action by its index (0 <= iIndex < Count()).
Returns
A pointer to the action or NULL if iIndex is out of range.
Implements IRhRdkActions.
◆ Add()
 virtual bool CRhRdkActions::Add  |  ( |  CRhRdkAction *  |  pAction | )
virtual
Add an action to the collection.
Returns
true if successful, else false.
Implements IRhRdkActions.
◆ Count()
 virtual int CRhRdkActions::Count  |  ( |  void  |   | ) |   const
virtual
Returns
The number of actions in the collection.
Implements IRhRdkActions.
◆ Find() [1/2]
 virtual CRhRdkAction* CRhRdkActions::Find  |  ( |  const UUID &  |  uuidAction | ) |   const
virtual
Find an action by its identifier.
Parameters
uuidAction | is the identifier of the action to find.
Returns
A pointer to the action if found, else NULL.
Implements IRhRdkActions.
◆ Find() [2/2]
 virtual CRhRdkAction* CRhRdkActions::Find  |  ( |  unsigned short  |  cmd | ) |   const
virtual
Find an action by its command number.
Parameters
cmd | is the command number of the action to find.
Returns
A pointer to the action if found, else null.
Implements IRhRdkActions.