Public Member Functions | Protected Member Functions | Friends | List of all members
CRhRdkContentFields Class Reference
RDK
#include <RhRdkContentField.h>
 Public Member Functions
CRhRdkContentFields (const CRhRdkContent &c)
virtual  | ~CRhRdkContentFields ()
virtual bool  | AddValuesToParamBlock (IRhRdkParamBlock &paramBlock, int sectionId, const wchar_t *wszExtraRequirementSet=nullptr) const
virtual CRhRdkContent &  | Content (void) const
virtual int  | Count (void) const
virtual void *  | EVF (const wchar_t *, void *)
virtual CRhRdkContentField *  | Field (int iIndex) const
virtual CRhRdkContentField *  | FindField (const wchar_t *wszInternalName) const
virtual RDK_DEPRECATED bool  | GetValuesFromParamBlock (const IRhRdkParamBlock &paramBlock, int sectionId, CRhRdkContent::eChangeContext cc)
virtual bool  | GetValuesFromParamBlock (const IRhRdkParamBlock &paramBlock, int sectionId)
virtual RDK_DEPRECATED bool  | GetValuesFromSection (const IRhRdk_XMLSection &section, CRhRdkContentField::Filter filter, CRhRdkContent::eChangeContext cc)
virtual bool  | GetValuesFromSection (const IRhRdk_XMLSection &section, CRhRdkContentField::Filter filter)
CRhRdkContentFields &  | operator= (const CRhRdkContentFields &f)
virtual bool  | SetValuesToSection (IRhRdk_XMLSection &section, CRhRdkContentField::Filter filter) const
 Protected Member Functions
virtual void  | Add (CRhRdkContentField *pField)
virtual void  | Remove (CRhRdkContentField *pField)
virtual void  | Uninitialize (void)
 Friends
class  | CRhRdkContent
class  | CRhRdkContentField
Detailed Description
A collection of fields. This object is created by the content when its Fields() method is called.
Constructor & Destructor Documentation
◆ CRhRdkContentFields()
 CRhRdkContentFields::CRhRdkContentFields  |  ( |  const CRhRdkContent &  |  c | )
◆ ~CRhRdkContentFields()
 virtual CRhRdkContentFields::~CRhRdkContentFields  |  ( |   | )
virtual
Member Function Documentation
◆ Add()
 virtual void CRhRdkContentFields::Add  |  ( |  CRhRdkContentField *  |  pField | )
protectedvirtual
Add a field. Called automatically by the field constructor.
◆ AddValuesToParamBlock()
 virtual bool CRhRdkContentFields::AddValuesToParamBlock  |  ( |  IRhRdkParamBlock &  |  paramBlock,
|  int  |  sectionId,
|  const wchar_t *  |  wszExtraRequirementSet = nullptr
) |   |  const
virtual
Add values to a param block from fields with the same internal name.
◆ Content()
 virtual CRhRdkContent& CRhRdkContentFields::Content  |  ( |  void  |   | ) |   const
virtual
Returns
The content that this field collection belongs to.
◆ Count()
 virtual int CRhRdkContentFields::Count  |  ( |  void  |   | ) |   const
virtual
Returns
The number of fields in the collection.
◆ EVF()
 virtual void* CRhRdkContentFields::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
Emergency virtual function for future expansion.
◆ Field()
 virtual CRhRdkContentField* CRhRdkContentFields::Field  |  ( |  int  |  iIndex | ) |   const
virtual
Get a field in the collection.
Parameters
iIndex | is the index of the field. This must be 0 <= iIndex < Count().
Returns
The field at the required position or nullptr if the index is out of range.
◆ FindField()
 virtual CRhRdkContentField* CRhRdkContentFields::FindField  |  ( |  const wchar_t *  |  wszInternalName | ) |   const
virtual
Returns
A field in the collection found by its internal name.
Parameters
wszInternalName | is the name of the field to find.
Returns
The field with the specified name, or nullptr if the field does not exist.
◆ GetValuesFromParamBlock() [1/2]
 virtual RDK_DEPRECATED bool CRhRdkContentFields::GetValuesFromParamBlock  |  ( |  const IRhRdkParamBlock &  |  paramBlock,
|  int  |  sectionId,
|  CRhRdkContent::eChangeContext  |  cc
)
virtual
This method is deprecated in favor of the one below.
◆ GetValuesFromParamBlock() [2/2]
 virtual bool CRhRdkContentFields::GetValuesFromParamBlock  |  ( |  const IRhRdkParamBlock &  |  paramBlock,
|  int  |  sectionId
)
virtual
Get values from a param block into fields with the same internal name.
◆ GetValuesFromSection() [1/2]
 virtual RDK_DEPRECATED bool CRhRdkContentFields::GetValuesFromSection  |  ( |  const IRhRdk_XMLSection &  |  section,
|  CRhRdkContentField::Filter  |  filter,
|  CRhRdkContent::eChangeContext  |  cc
)
virtual
This method is deprecated in favor of the one below.
◆ GetValuesFromSection() [2/2]
 virtual bool CRhRdkContentFields::GetValuesFromSection  |  ( |  const IRhRdk_XMLSection &  |  section,
|  CRhRdkContentField::Filter  |  filter
)
virtual
Get values from a section into fields with the same internal name.
Parameters
section | is the section to read values from.
filter | is a filter to control which fields are modified.
cc | is the context of the change which requires this operation.
Returns
true if at least one field was actually changed, else false.
◆ operator=()
 CRhRdkContentFields& CRhRdkContentFields::operator=  |  ( |  const CRhRdkContentFields &  |  f | )
◆ Remove()
 virtual void CRhRdkContentFields::Remove  |  ( |  CRhRdkContentField *  |  pField | )
protectedvirtual
Remove a field. Called automatically by the field destructor.
◆ SetValuesToSection()
 virtual bool CRhRdkContentFields::SetValuesToSection  |  ( |  IRhRdk_XMLSection &  |  section,
|  CRhRdkContentField::Filter  |  filter
) |   |  const
virtual
Set values into a section from fields with the same internal name.
Parameters
section | is the section to write values to.
filter | is a filter to control which fields are transferred to the section.
Returns
true. The return value is for future use only.
◆ Uninitialize()
 virtual void CRhRdkContentFields::Uninitialize  |  ( |  void  |   | )
protectedvirtual
Called during content deletion.
Friends And Related Function Documentation
◆ CRhRdkContent
 friend class CRhRdkContent
friend
◆ CRhRdkContentField
 friend class CRhRdkContentField
friend