Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
CRhRdkDecalWidget Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkDecalWidget:
 Public Member Functions
CRhRdkDecalWidget ()
CRhRdkDecalWidget (const CRhinoObject &obj, RDK_DECAL_CRC crc)
virtual  | ~CRhRdkDecalWidget ()
CRhRdkDecalWidgetGeometry &  | DecalGeometry (void) const
UUID  | DecalId (void) const
virtual bool  | GumballHack (const CRhinoDoc &doc, CRhinoGumball &gumball, bool bAlignToObject) const override
Added to support '15 March 2012, Mikko: Hack to get planar mapping widget gumball to behave the way it used to.'. More...
UUID  | ObjectId (void) const
const CRhRdkDecalWidget &  | operator= (const CRhRdkDecalWidget &w)
 Public Member Functions inherited from CRhinoWidget
CRhinoWidget ()
virtual ON_BoundingBox  | BoundingBox () const
virtual ON_BoundingBox  | BoundingBox (const CRhinoViewport *) const
virtual bool  | CanDrawMarquee (void) const
virtual void  | Draw (CRhinoDisplayPipeline &dp) const
Draws object based on pipeline display attributes... More...
IRhWidgetDrawCache &  | DrawCache (void) const
virtual void  | EnableGrips (bool bEnable)
CRhinoWidgetGeometry &  | Geometry (void) const
virtual void  | GetGeometryTransformData (const CRhinoWidgetGeometry &newGeom, ON_Xform &xform) const
virtual bool  | GetXformLocal (ON_Xform &xformLocalOut) const
bool  | IsAssociatedWithListObject (ON_SimpleArray< CRhinoObject *> &list) const
Added to support 'ALB 2011.6.3 - partial fix for TRR#34533, #34544'. More...
virtual bool  | IsDeletable () const
virtual bool  | IsSelectableWithGripsOn () const
true if can be selected while grips are on More...
virtual ON::object_type  | ObjectType () const
const CRhinoWidget &  | operator= (const CRhinoWidget &w)
virtual int  | Pick (const CRhinoPickContext &, CRhinoObjRefArray &a) const
virtual bool  | PickFilter (const CRhinoGetObject &go, bool bCheckSubObjects) const
virtual void  | PreDrawUpdate (CRhinoDisplayPipeline &dp) const
void  | SetInitialGeometry (ON_Geometry *)
For internal use only. More...
virtual void  | SetInterestObject (const UUID &uuidObject) const
 Public Member Functions inherited from CRhinoObject
CRhinoObject ()
assigns a new object UUID More...
CRhinoObject (const ON_3dmObjectAttributes &)
CRhinoObject (const CRhinoObject &)
copies source object UUID More...
virtual  | ~CRhinoObject ()
BOOL  | AttachAttributeUserData (ON_UserData *pUserData)
bool  | AttachGeometryUserData (ON_UserData *pUserData)
virtual const CRhinoObjectAttributes &  | Attributes () const
virtual void  | BeginTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
virtual ON_BoundingBox  | BoundingBox (const class CRhinoViewport *pViewport) const
unsigned int  | BrepReferenceCount () const
class CRhObjectReferenceCounter *  | BrepReferenceCounter (void) const
void  | BrepReferenceCounter_DestroyRuntimeCache (bool bDelete) const
bool  | BrepReferenceCounterExists () const
virtual int  | CreateMeshes (ON::mesh_type mesh_type, const ON_MeshParameters &mp, bool bIgnoreCustom=false)
BOOL  | DeleteAttributeUserData (ON_UUID userdata_uuid)
void  | DeleteDynamicTransform ()
bool  | DeleteGeometryUserData (ON_UUID userdata_uuid)
virtual void  | DestroyMeshes (ON::mesh_type mesh_type, bool bDeleteMeshes=true)
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object override More...
class CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
void  | Draw (CRhinoViewport &) const
virtual void  | DrawGrips (class CRhinoDisplayPipeline &) const
virtual void  | DrawHighlightedSubObjects (class CRhinoDisplayPipeline &) const
virtual void  | DrawSubObject (class CRhinoDisplayPipeline &, ON_COMPONENT_INDEX) const
Draws wireframe representation of a sub object. More...
virtual void  | DrawV6 (class CRhinoObjectDrawContext *draw_context) const RHINO_NOEXCEPT
virtual CRhinoObject *  | DuplicateRhinoObject () const
*enum ANALYSIS_MODE **bool  | EnableAnalysisMode (ON_UUID am_id, bool bEnable=true) const
new way (not virtual) More...
virtual bool  | EnableCustomGrips (class CRhinoObjectGrips *custom_grips)
virtual void  | EndTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
const ON_Geometry *  | Geometry () const
returns a pointer to the object's geometry More...
ON_UserData *  | GetAttributeUserData (ON_UUID userdata_uuid) const
bool  | GetDynamicTransform (ON_Xform &dynamic_xform) const
virtual bool  | GetFrame (ON_Plane &plane) const
ON_UserData *  | GetGeometryUserData (ON_UUID userdata_uuid) const
virtual int  | GetGrips (ON_SimpleArray< class CRhinoGripObject *> &grip_list) const
virtual int  | GetHighlightedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const
virtual int  | GetMeshes (ON::mesh_type mesh_type, ON_SimpleArray< const ON_Mesh *> &meshes) const
void  | GetRenderMeshParameters (ON_MeshParameters &mp) const
virtual int  | GetSelectedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const
virtual int  | GetSubobjectMaterialComponents (ON_SimpleArray< ON_COMPONENT_INDEX > &components_with_subobject_materials) const
virtual int  | GetSubObjects (ON_SimpleArray< CRhinoObject *> &subObjects, const class CRhinoViewport *pViewport=NULL) const
virtual bool  | GetTightBoundingBox (ON_BoundingBox &tight_bbox, bool bGrowBox=false, const ON_Xform *xform=nullptr) const
virtual int  | GetWireframeCurves (ON_SimpleArray< ON_Curve *> &curve_list) const
const class CRhinoGripsEnabler *  | GripsEnabler () const
int  | GripsOn () const
bool  | GripsSelected () const
bool  | HasDynamicTransform () const
virtual bool  | HasSubobjectMaterials (void) const
bool  | Highlight (bool bHighlight=true) const
virtual bool  | HighlightRequiresRedraw () const
virtual bool  | HighlightSubObject (ON_COMPONENT_INDEX component_index, bool bHighlight=true) const
const CRhinoHistoryRecord *  | HistoryRecord () const
const ON_UUID  | Id () const
bool  | InAnalysisMode (const ON_UUID &am_id) const
bool AnalysisMode( ANALYSIS_MODE am ) const; ///< old way More...
bool  | InAnalysisMode () const
const class CRhinoVisualAnalysisMode *  | InShadedAnalysisMode () const
unsigned int  | IsActiveInDocument () const
virtual bool  | IsActiveInViewport (const class CRhinoViewport &) const
bool  | IsDeleted () const
virtual bool  | IsGroupObject () const
bool  | IsHidden () const
int  | IsHighlighted (BOOL bCheckSubObjects=false) const
highlighted state (almost always = IsSelected() except in one or two commands) More...
bool  | IsInstanceDefinitionGeometry () const
int  | IsInstanceDefinitionGeometryEx () const
bool  | IsLocked () const
int  | IsMarked () const
virtual bool  | IsMeshable (ON::mesh_type) const
Returns true if the object is capable of having a mesh of the specified type. More...
bool  | IsModelObject () const
bool  | IsNormal () const
bool  | IsPageObject () const
int  | IsProxy () const
bool  | IsReference () const
bool  | IsSelectable (bool bIgnoreSelectionState=false, bool bIgnoreGripsState=false) const
bool  | IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
int  | IsSelected (bool bCheckSubObjects=false) const
virtual bool  | IsSolid () const
virtual bool  | IsSubObjectHighlighted (ON_COMPONENT_INDEX component_index) const
true if specified component is highlighted More...
bool  | IsSubObjectSelectable (ON_COMPONENT_INDEX component_index, bool bIgnoreSelectionState=false) const
virtual bool  | IsSubObjectSelected (ON_COMPONENT_INDEX component_index) const
bool  | IsValid (ON_TextLog *text_log=nullptr) const override
bool  | IsVisible () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
void  | Mark (int)
void  | MemoryRelocate () override
virtual ON_Object override More...
virtual int  | MeshCount (ON::mesh_type mesh_type, const ON_MeshParameters *mp=0) const
virtual const class CDisplayPipelineAttributes *  | MeshDisplayAttributes (int mesh_index, const ON_Mesh &mesh, const class CDisplayPipelineAttributes &display_attrs) const
const ON_ModelComponent &  | ModelComponent () const
ON_UUID  | ModelObjectId () const override
virtual bool  | ModifyAttributes (const ON_3dmObjectAttributes &new_attributes, bool bEnableUndo=true, bool bQuiet=false)
const ON_wString  | Name () const
ON_Color  | ObjectDrawColor (bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, const ON_UUID &viewport_id, bool bIgnoreObjectState) const
const class CRhinoLayer &  | ObjectLayer () const
const CRhinoLinetype &  | ObjectLinetype () const
virtual const CRhinoMaterial &  | ObjectMaterial () const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_UUID &plugin_id) const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_3dmObjectAttributes &attrs) const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
This is now the preferred version of the function. This should be used to get materials component-wise in all cases. More...
virtual const CRhRdkMaterial *  | ObjectRdkMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
virtual ON_wString  | OnDoubleClick (const CRhinoDoubleClickContext &double_click_context) const
CRhinoObject &  | operator= (const CRhinoObject &)
copies source object UUID More...
bool  | PerViewportIsVisible (ON_UUID viewport_id) const
virtual bool  | PickFilter (const class CRhinoGetObject &, bool) const
virtual bool  | PrepareToWrite (int archive_3dm_version)
virtual bool  | PromotePreviewMeshes (ON::mesh_type)
unsigned int  | RuntimeSerialNumber () const
int  | Select (bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=true, bool bIgnoreGripsState=false) const
int  | Select (bool bSelect, bool bSynchHighlight, bool bPersistentSelect, bool bIgnoreGripsState, bool bIgnoreLayerLocking, bool bIgnoreLayerVisibility) const
virtual int  | SelectSubObject (ON_COMPONENT_INDEX component_index, bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=false) const
bool  | SetDynamicTransform (const ON_Xform &dynamic_xform)
bool  | SetHistory (class CRhinoHistory &history)
virtual bool  | SetRenderMeshParameters (const ON_MeshParameters &mp)
virtual bool  | SetTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
virtual bool  | SetTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, int mapping_channel_id) const
virtual unsigned int  | SizeOf () const
returns number of bytes used by this particular instance More...
virtual ON_ComponentStatus  | SubObjectStatus () const
virtual bool  | SupportsBrepProxyReferenceCounting () const
bool  | UndoModifyAttributes (unsigned int ur_sn=0)
virtual int  | UnhighlightAllSubObjects ()
returns number of changed subobjects More...
virtual int  | UnselectAllSubObjects ()
returns number of unselected subobjects More...
void  | UpdateBoundingBox ()
unsigned int  | WorksessionReferenceModelSerialNumber () const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static void  | UnselectBrokenWidgets (CRhinoDoc &doc)
 Static Public Member Functions inherited from CRhinoObject
static const CRhinoObject *  | FromId (unsigned int rhino_doc_runtime_serial_number, ON_UUID rhino_object_id)
static const CRhinoObject *  | FromRuntimeSerialNumber (unsigned int rhino_doc_runtime_serial_number, unsigned int rhino_object_runtime_serial_number)
static unsigned int  | NextRuntimeObjectSerialNumber ()
 Protected Member Functions
virtual void  | AddToDrawCache (CRhinoWidgetGeometry &geom)
virtual void  | ApplyTransformation (const ON_Xform &xform)
virtual void  | ComputeFeedback (const ON_Xform &xformDynamic) const
virtual void  | DrawFeedback (const ON_Xform &xformDynamic, CRhinoDisplayPipeline &dp) const
virtual void  | GetGripPoints (ON_3dPointArray &aOut) const
virtual bool  | GetXformTrans (ON_Xform &xformTransOut) const
virtual int  | GripOppositeIndex (int index, int count) const
virtual int  | GripOriginIndex (void) const
virtual bool  | IsAssociatedWithObject (const CRhinoObject &obj) const
virtual bool  | MovesWithAssociatedObjects (void) const
virtual CRhinoWidgetGeometry *  | NewGeometry (void) const
virtual CRhinoWidgetGeometry *  | NewGeometryForMovedGrip (const CRhinoWidgetGrip &movedGrip) const
virtual CRhinoWidgetGrip *  | NewGrip (int index) const
virtual void  | OnUserDataTransformed (const CRhinoObject &obj)
virtual void  | OnWidgetDeleted (void)
virtual void  | SetGeometryWhenGripDropped (CRhinoWidgetGeometry &newGeom, bool bApplyToDynamicDecal)
virtual const wchar_t *  | ShortDescription (bool bPlural) const
virtual bool  | SnapTo (const CRhinoSnapContext &sc, CRhinoSnapEvent &se) const
virtual void  | UpdateFeedbackManager (const CRhinoWidgetGeometry &geom, const ON_Xform &xformLocal) const
virtual bool  | VetoTransformObject (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory) const override
 Protected Member Functions inherited from CRhinoWidget
virtual  | ~CRhinoWidget ()
virtual void  | AddToDocNotification ()
ON_BoundingBox  | BoundingBoxImpl (void)
void  | CalculateXformForMovedGrip (const CRhinoWidgetGrip &movedGrip, ON_Xform &xformOut, bool constrain_axis[3]={}) const
void  | CheckUpdateGrips (void)
virtual void  | DeleteFromDocNotification ()
void  | RefreshGrips (void)
 Protected Member Functions inherited from CRhinoObject
void  | Destroy ()
virtual bool  | InternalVirtual_IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
virtual int  | SubObjectsAreHighlighted () const
returns number of highlighted subobjects More...
virtual int  | SubObjectsAreSelected () const
returns number of selected subobjects More...
virtual void  | SynchAttributes ()
light objects are special because they are not in the geometry lists More...
 Protected Member Functions inherited from CRhRdkEventWatcher
CRhRdkEventWatcher (bool bAutoRegister=true)
virtual  | ~CRhRdkEventWatcher ()
virtual void  | Enable (bool bEnable) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual bool  | IsEnabled (void) const
virtual RDK_DEPRECATED void  | OnAddRhinoObject (CRhinoDoc &, CRhinoObject &)
virtual void  | OnAllFactoriesAdded (void)
virtual RDK_DEPRECATED void  | OnAutomaticParamChanged (HWND, DWORD_PTR)
virtual void  | OnCacheImageChanged (void)
virtual void  | OnClientPlugInUnloading (const UUID &uuidPlugIn)
virtual RDK_DEPRECATED void  | OnContentAdded (const CRhRdkContent *)
virtual void  | OnContentAddedByUser (const CRhRdkDocument &rdkDoc, const CRhRdkContentArray &aContent, bool bNameWasLoaded)
virtual void  | OnContentAttached (const CRhRdkDocument &rdkDoc, const CRhRdkContent &c, AttachReason r)
virtual void  | OnContentAutoDeletion (const CRhRdkDocument &rdkDoc, const CRhRdkContent &c, AutoDeletionStateChange change)
virtual void  | OnContentBlossomBegin (const CRhRdkBasicMaterial &v4Material)
virtual void  | OnContentBlossomEnd (const CRhRdkBasicMaterial *pBlossom)
virtual RDK_DEPRECATED void  | OnContentBlossomEnd (const CRhRdkBasicMaterial &)
virtual void  | OnContentChanged (const CRhRdkContent &c, const CRhRdkContent &old, RhRdkChangeContext cc)
virtual RDK_DEPRECATED void  | OnContentChanged (const CRhRdkContent *, RhRdkChangeContext)
virtual RDK_DEPRECATED void  | OnContentCurrencyChanged (const wchar_t *, const CRhRdkContent *)
virtual RDK_DEPRECATED void  | OnContentDeleted (void)
virtual RDK_DEPRECATED void  | OnContentDeleting (const CRhRdkContent *)
virtual void  | OnContentDetached (const CRhRdkDocument &rdkDoc, const CRhRdkContent &c, DetachReason r)
virtual void  | OnContentDetaching (const CRhRdkDocument &rdkDoc, const CRhRdkContent &c, DetachReason r)
virtual RDK_DEPRECATED void  | OnContentEditorActivated (const IRhRdkContentEditor &)
virtual RDK_DEPRECATED void  | OnContentEditorExtended (bool)
virtual void  | OnContentFilterChanged (const CRhRdkDocument &rdkDoc, const CRhRdkUuidCollection &excludedRenderEngines)
virtual RDK_DEPRECATED void  | OnContentFilterChanged (const CRhRdkUuidCollection &)
virtual void  | OnContentGroupIdChanged (const CRhRdkContent &c, const UUID &uuidGroupNew, const UUID &uuidGroupOld)
virtual void  | OnContentListCleared (const CRhRdkDocument &rdkDoc, const IRhRdkContentList &list)
virtual RDK_DEPRECATED void  | OnContentListCleared (const IRhRdkContentList &)
virtual void  | OnContentListClearing (const CRhRdkDocument &rdkDoc, const IRhRdkContentList &list)
virtual RDK_DEPRECATED void  | OnContentListClearing (const IRhRdkContentList &)
virtual void  | OnContentListLoaded (const CRhRdkDocument &rdkDoc, const IRhRdkContentList &list)
virtual RDK_DEPRECATED void  | OnContentListLoaded (const IRhRdkContentList &)
virtual RDK_DEPRECATED void  | OnContentMoved (const CRhRdkContent *, const CRhRdkContent *, const IRhRdkContentEditor *)
virtual void  | OnContentNotesChanged (const CRhRdkContent &c)
virtual void  | OnContentNotesChanging (const CRhRdkContent &c)
virtual void  | OnContentRenamed (const CRhRdkContent &c)
virtual RDK_DEPRECATED void  | OnContentRenamed (const CRhRdkContent *)
virtual void  | OnContentRenaming (const CRhRdkContent &c)
virtual void  | OnContentReplaced (const CRhRdkDocument &rdkDoc, const CRhRdkContent &newContent)
virtual RDK_DEPRECATED void  | OnContentReplaced (CRhRdkContent *)
virtual void  | OnContentReplacing (const CRhRdkDocument &rdkDoc, const CRhRdkContent &oldContent)
virtual RDK_DEPRECATED void  | OnContentReplacing (const CRhRdkContent *)
virtual RDK_DEPRECATED void  | OnContentSelected (const CRhRdkContent *, const IRhRdkContentEditor &)
virtual void  | OnContentSelection (const CRhRdkContentArray &aContentSel, const CRhRdkContentArray &aContentEdit, const UUID &uuidEditor)
virtual void  | OnContentTagsChanged (const CRhRdkContent &c)
virtual void  | OnContentTagsChanging (const CRhRdkContent &c)
virtual void  | OnContentUpdateMarkers (const CRhRdkDocument &rdkDoc, CRhRdkContent::Kinds kind)
virtual RDK_DEPRECATED void  | OnContentUpdateMarkers (const CRhRdkContent *)
virtual void  | OnContentUpdatePreview (const CRhRdkContent &c)
virtual RDK_DEPRECATED void  | OnContentUpdatePreview (const CRhRdkContent *)
virtual void  | OnCurrentEnvironmentChanged (const CRhRdkDocument &rdkDoc, IRhRdkCurrentEnvironment::Usage usage, const CRhRdkContent *pContent)
virtual void  | OnCustomEvent (const UUID &uuidCode, void *pvContext)
virtual void  | OnCustomRenderMeshesChanged (const CRhRdkDocument &rdkDoc, const CRhinoObject *pObject, eCRMChanged crmc)
virtual void  | OnDecalAdded (const CRhinoObject &obj, const IRhRdkDecal &decal)
virtual void  | OnDecalDeleted (const CRhinoObject &obj, RDK_DECAL_CRC old_decal_crc)
virtual void  | OnDecalModified (const CRhinoObject &obj, const IRhRdkDecal &decal, RDK_DECAL_CRC old_decal_crc)
virtual RDK_DEPRECATED void  | OnDeleteRhinoObject (CRhinoDoc &, CRhinoObject &)
virtual void  | OnDisplayUpdateBegin (void)
virtual void  | OnDisplayUpdateEnded (void)
virtual RDK_DEPRECATED void  | OnDocumentSettingsChanged (UINT, UINT_PTR)
virtual void  | OnFactoryAdded (const CRhRdkContentFactory &factory)
virtual void  | OnFactoryDeleted (CRhRdkContent::Kinds kind)
virtual void  | OnFactoryDeleting (const CRhRdkContentFactory &factory)
virtual void  | OnGlobalSettingsChanged (void)
virtual void  | OnGroundPlaneSettingsChanged (const CRhRdkDocument &rdkDoc, const IRhRdkGroundPlane &newGP, const IRhRdkGroundPlane &oldGP, const void *pSender)
virtual void  | OnInternalProxyUpdate (const CRhRdkInstanceIdArray &, UINT_PTR)
virtual void  | OnLayerMaterialAssignmentChanged (const CRhinoDoc &doc, const CRhinoLayer &layer, const UUID &uuidInstanceNew, const UUID &uuidInstanceOld)
virtual void  | OnLazyTimer (void)
virtual void  | OnMenuChecksDirty (void)
virtual void  | OnModifyObjectTextureMapping (const CRhRdkDocument &rdkDoc, const CRhinoObject &obj)
virtual RDK_DEPRECATED void  | OnModifyObjectTextureMapping (CRhinoDoc &, const CRhinoObject &)
virtual void  | OnNewRdkDocument (const CRhRdkDocument &)
virtual RDK_DEPRECATED void  | OnNewRdkDocument (void)
virtual void  | OnObjectMaterialAssignmentChanged (const CRhinoDoc &doc, const CRhinoObject &obj, const UUID &uuidInstanceNew, const UUID &uuidInstanceOld)
virtual void  | OnPostEffectSettingsChanged (const CRhRdkDocument &rdkDoc, const void *pSender)
virtual void  | OnPreviewRendered (const CRhinoDib &dib, RhRdkPreviewQuality qual, const CRhRdkPreviewJobSignature &sig)
virtual void  | OnRenderEngineStateChanged (bool bBusy)
virtual void  | OnRendererChanged (void)
virtual void  | OnRenderingDeleted (const IRhRdkRenderingFileInfo &info)
virtual RDK_DEPRECATED void  | OnRenderingFinished (bool bSuccessful)
virtual void  | OnRenderingFinished (const IRhRdkRenderSession &session, bool bSuccess)
virtual void  | OnRenderingLoaded (const IRhRdkRenderingFileInfo &info)
virtual void  | OnRenderingSaved (const IRhRdkRenderingFileInfo &info)
virtual void  | OnRenderingSettingsChanged (const CRhRdkDocument &rdkDoc, rendering_info info, const void *pSender)
virtual void  | OnRenderWindowCloned (const UUID &uuidRenderSessionOld, const UUID &uuidRenderSessionNew)
virtual RDK_DEPRECATED void  | OnReplaceRhinoObject (CRhinoDoc &, CRhinoObject &, CRhinoObject &)
virtual void  | OnRhinoSettingsChanged (const CRhRdkDocument &rdkDoc)
virtual void  | OnSafeFrameSettingsChanged (const CRhRdkDocument &rdkDoc, const IRhRdkSafeFrame &newSF, const IRhRdkSafeFrame &oldSF, const void *pSender)
virtual void  | OnSelectionChanged (const CRhRdkDocument &rdkDoc)
virtual RDK_DEPRECATED void  | OnSelectionChanged (CRhinoDoc &)
virtual void  | OnSkylightSettingsChanged (const CRhRdkDocument &rdkDoc, const IRhRdkSkylight &newSun, const IRhRdkSkylight &oldSun, const void *pSender)
virtual void  | OnSunSettingsChanged (const CRhRdkDocument &rdkDoc, const IRhRdkSun &newSun, const IRhRdkSun &oldSun, const void *pSender)
virtual void  | OnUndoRedo (const CRhRdkDocument &rdkDoc, bool bRedo)
virtual void  | OnUndoRedoBegin (CRhinoDoc &doc)
virtual void  | OnUndoRedoEnded (CRhinoDoc &doc)
virtual void  | OnUpdateAllPreviews (const CRhRdkDocument &rdkDoc)
virtual RDK_DEPRECATED void  | OnUpdateAllPreviews (void)
virtual void  | OnUpdateThumbDropTL (const CRhRdkDocument &)
virtual void  | TextureMappingTableEvent (const CRhRdkDocument &rdkDoc, const ON_TextureMapping &tm)
virtual RDK_DEPRECATED void  | TextureMappingTableEvent (const ON_TextureMapping &)
 Additional Inherited Members
 Public Types inherited from CRhinoObject
enum  | GEOMETRY_TYPE {
 unknown_object_type = ON::object_type::unknown_object_type, point_object = ON::object_type::point_object, pointset_object = ON::object_type::pointset_object, curve_object = ON::object_type::curve_object,
 surface_object = ON::object_type::surface_object, polysrf_object = ON::object_type::polysrf_filter, edge_object = ON::object_type::edge_filter, polyedge_object = ON::object_type::polyedge_filter,
 loop_object = ON::object_type::loop_object, brepvertex_filter = ON::object_type::brepvertex_filter, mesh_object = ON::object_type::mesh_object, annotation_object = ON::object_type::annotation_object,
 light_object = ON::object_type::light_object, instance_reference = ON::object_type::instance_reference, grip_object = ON::object_type::grip_object, morph_control_object = ON::object_type::morph_control_object,
 subd_object = ON::object_type::subd_object, meshvertex_filter = ON::object_type::meshvertex_filter, meshedge_filter = ON::object_type::meshedge_filter, meshface_filter = ON::object_type::meshface_filter,
 meshcomponent_reference = ON::object_type::meshcomponent_reference, cage_object = ON::object_type::cage_object, hatch_object = ON::object_type::hatch_object, phantom_object = ON::object_type::phantom_object,
 extrusion_object = ON::object_type::extrusion_object, any_object = ON::object_type::any_object
 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Attributes inherited from CRhinoObject
class CRhObjectSdkExtension *  | m__object_sdk_extension
const class CRhinoObjectVisualAnalysisMode *  | m_analysis_mode_list
list of enabled analysis modes More...
CRhinoCacheHandle  | m_cache
class CRhinoObjectGrips *  | m_grips
managed by derived objects More...
unsigned char  | m_use_preview_mesh
 Static Public Attributes inherited from CRhinoObject
static int  | m_no_show_mark
 Protected Types inherited from CRhRdkEventWatcher
enum  | AttachReason : unsigned int {
 AttachReason::Attach, AttachReason::Change, AttachReason::Undo, AttachReason::Open,
 AttachReason::Edit
 }
enum  | AutoDeletionStateChange : unsigned int { AutoDeletionStateChange::Enter, AutoDeletionStateChange::Leave }
enum  | DetachReason : unsigned int {
 DetachReason::Detach, DetachReason::Change, DetachReason::Undo, DetachReason::Delete,
 DetachReason::Edit
 }
enum  | eCRMChanged { eCRMChanged::kSingleObject = 0, eCRMChanged::kWholeDocument = 1, eCRMChanged::kDocumentRenderMeshes = 2 }
enum  | rendering_info {
 ri_save_support_files = 1, ri_dithering = 2, ri_gamma = 3, ri_use_linear_workflow = 4,
 ri_tone_mapping = 5, ri_tone_mapper_params = 6, ri_custom_reflective_env = 7, ri_rhino_settings = 8,
 ri_force32bit = 0xFFFFFFFF
 }
 Protected Attributes inherited from CRhinoObject
ON_BoundingBox  | m_bbox
world coordinate bounding box More...
unsigned char  | m_geomem_type
ON_Geometry *  | m_geometry
const CRhinoHistoryRecord *  | m_history_record
Constructor & Destructor Documentation
◆ CRhRdkDecalWidget() [1/2]
 CRhRdkDecalWidget::CRhRdkDecalWidget  |  ( |   | )
◆ CRhRdkDecalWidget() [2/2]
 CRhRdkDecalWidget::CRhRdkDecalWidget  |  ( |  const CRhinoObject &  |  obj,
|  RDK_DECAL_CRC  |  crc
)
◆ ~CRhRdkDecalWidget()
 virtual CRhRdkDecalWidget::~CRhRdkDecalWidget  |  ( |   | )
virtual
Member Function Documentation
◆ AddToDrawCache()
 virtual void CRhRdkDecalWidget::AddToDrawCache  |  ( |  CRhinoWidgetGeometry &  |  geom | )
protectedvirtual
Add the widget's geometry to the draw cache.
Implements CRhinoWidget.
◆ ApplyTransformation()
 virtual void CRhRdkDecalWidget::ApplyTransformation  |  ( |  const ON_Xform &  |  xform | )
protectedvirtual
Apply a transformation to the widget's data.
Implements CRhinoWidget.
◆ ComputeFeedback()
 virtual void CRhRdkDecalWidget::ComputeFeedback  |  ( |  const ON_Xform &  |   | ) |   const
protectedvirtual
Compute feedback-related data when the widget is being moved.
Reimplemented from CRhinoWidget.
◆ DecalGeometry()
 CRhRdkDecalWidgetGeometry& CRhRdkDecalWidget::DecalGeometry  |  ( |  void  |   | ) |   const
◆ DecalId()
 UUID CRhRdkDecalWidget::DecalId  |  ( |  void  |   | ) |   const
◆ DrawFeedback()
 virtual void CRhRdkDecalWidget::DrawFeedback  |  ( |  const ON_Xform &  |  xformDynamic,
|  CRhinoDisplayPipeline &  |  dp
) |   |  const
protectedvirtual
Draw feedback when the widget is being moved.
Implements CRhinoWidget.
◆ GetGripPoints()
 virtual void CRhRdkDecalWidget::GetGripPoints  |  ( |  ON_3dPointArray &  |  aOut | ) |   const
protectedvirtual
Get the widget's grip points.
Implements CRhinoWidget.
◆ GetXformTrans()
 virtual bool CRhRdkDecalWidget::GetXformTrans  |  ( |  ON_Xform &  |  xformTransOut | ) |   const
protectedvirtual
Get the widget's transformation.
Parameters
xformTransOut | accepts the xform that transforms the unit widget into world space. Return true if successful, else false.
Implements CRhinoWidget.
◆ GripOppositeIndex()
 virtual int CRhRdkDecalWidget::GripOppositeIndex  |  ( |  int  |  index,
|  int  |  count
) |   |  const
protectedvirtual
The grip at (count - index) is usually the opposite one. Optionally override this method to return a different index.
Reimplemented from CRhinoWidget.
◆ GripOriginIndex()
 virtual int CRhRdkDecalWidget::GripOriginIndex  |  ( |  void  |   | ) |   const
protectedvirtual
The first grip is usually the 'origin'. Optionally override this method to return a different index.
Reimplemented from CRhinoWidget.
◆ GumballHack()
 virtual bool CRhRdkDecalWidget::GumballHack  |  ( |  const CRhinoDoc &  |  doc,
|  CRhinoGumball &  |  gumball,
|  bool  |  bAlignToObject
) |   |  const
overridevirtual
Added to support '15 March 2012, Mikko: Hack to get planar mapping widget gumball to behave the way it used to.'.
Reimplemented from CRhinoWidget.
◆ IsAssociatedWithObject()
 virtual bool CRhRdkDecalWidget::IsAssociatedWithObject  |  ( |  const CRhinoObject &  |  obj | ) |   const
protectedvirtual
Return true if the widget is associated with the specified object. Widgets can optionally be associated with objects if they happen to have something in common with them. They can also optionally move with these objects.
Implements CRhinoWidget.
◆ MovesWithAssociatedObjects()
 virtual bool CRhRdkDecalWidget::MovesWithAssociatedObjects  |  ( |  void  |   | ) |   const
protectedvirtual
If the widget automatically moves with an associated object, it should return true.
Implements CRhinoWidget.
◆ NewGeometry()
 virtual CRhinoWidgetGeometry* CRhRdkDecalWidget::NewGeometry  |  ( |  void  |   | ) |   const
protectedvirtual
Return a new geometry object for the widget.
Implements CRhinoWidget.
◆ NewGeometryForMovedGrip()
 virtual CRhinoWidgetGeometry* CRhRdkDecalWidget::NewGeometryForMovedGrip  |  ( |  const CRhinoWidgetGrip &  |  movedGrip | ) |   const
protectedvirtual
Return a new geometry object to use when grips are being manipulated.
Implements CRhinoWidget.
◆ NewGrip()
 virtual CRhinoWidgetGrip* CRhRdkDecalWidget::NewGrip  |  ( |  int  |  index | ) |   const
protectedvirtual
Optionally override this method to return a new special grip. The default implementation returns a new standard grip.
Parameters
index | is the index of the grip (in point order).
Reimplemented from CRhinoWidget.
◆ ObjectId()
 UUID CRhRdkDecalWidget::ObjectId  |  ( |  void  |   | ) |   const
◆ OnUserDataTransformed()
 virtual void CRhRdkDecalWidget::OnUserDataTransformed  |  ( |  const CRhinoObject &  |  obj | )
protectedvirtual
Called after any RDK user data has been transformed This can be used to capture decal transformation.
Reimplemented from CRhRdkEventWatcher.
◆ OnWidgetDeleted()
 virtual void CRhRdkDecalWidget::OnWidgetDeleted  |  ( |  void  |   | )
protectedvirtual
Called when the user deletes the associated widget by using the 'Delete' command. Perform any extra actions here; for example, you may want to delete the data associated with the widget.
Reimplemented from CRhinoWidget.
◆ operator=()
 const CRhRdkDecalWidget& CRhRdkDecalWidget::operator=  |  ( |  const CRhRdkDecalWidget &  |  w | )
◆ SetGeometryWhenGripDropped()
 virtual void CRhRdkDecalWidget::SetGeometryWhenGripDropped  |  ( |  CRhinoWidgetGeometry &  |  newGeom,
|  bool  |  bApplyToDynamicDecal
)
protectedvirtual
When grips are dragged and dropped, new geometry is automatically created. Implement this method to use the new geometry to update your data.
Implements CRhinoWidget.
◆ ShortDescription()
 virtual const wchar_t* CRhRdkDecalWidget::ShortDescription  |  ( |  bool  |  bPlural | ) |   const
protectedvirtual
Description: Localized short description of object like "curve", "surface", "mesh", etc.). Parameters: bPlural - [in] If true, then a plural, like "curves", "surfaces", etc., is returned. Returns: NULL terminated string.
Implements CRhinoObject.
◆ SnapTo()
 virtual bool CRhRdkDecalWidget::SnapTo  |  ( |  const CRhinoSnapContext &  |  snap_context,
|  CRhinoSnapEvent &  |  snap_event
) |   |  const
protectedvirtual
Description: Low level tool for internal use only. See definition of CRhinoObject::SnapTo for detailed information. Remarks: This function should not be used in Rhino plug-ins.
Reimplemented from CRhinoObject.
◆ UnselectBrokenWidgets()
 static void CRhRdkDecalWidget::UnselectBrokenWidgets  |  ( |  CRhinoDoc &  |  doc | )
static
◆ UpdateFeedbackManager()
 virtual void CRhRdkDecalWidget::UpdateFeedbackManager  |  ( |  const CRhinoWidgetGeometry &  |  geom,
|  const ON_Xform &  |  xformLocal
) |   |  const
protectedvirtual
Implements CRhinoWidget.
◆ VetoTransformObject()
 virtual bool CRhRdkDecalWidget::VetoTransformObject  |  ( |  CRhinoDoc &  |  doc,
|  bool  |  bDeleteOriginal,
|  bool  |  bAddNewObjectToDoc,
|  bool  |  bAddTransformHistory
) |   |  const
overrideprotectedvirtual
transformation callbacks Description: Expert user tool Called to determine if the object supports transformation in this case. The default implementation to returns true. MappingWidgets return false.
Reimplemented from CRhinoObject.