Public Member Functions | Public Attributes | List of all members
ON_3dmView Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmView ()
~ON_3dmView ()
void  | Default ()
void  | Dump (ON_TextLog &text_log) const
double  | FocalBlurAperture (void) const
double  | FocalBlurDistance (void) const
double  | FocalBlurJitter (void) const
ON_FocalBlurModes  | FocalBlurMode (void) const
unsigned int  | FocalBlurSampleCount (void) const
bool  | IsValid (ON_TextLog *text_log=0) const
bool  | Read (ON_BinaryArchive &)
ON_2iSize  | RenderingSize () const
void  | SetFocalBlurAperture (double d)
void  | SetFocalBlurDistance (double d)
void  | SetFocalBlurJitter (double d)
void  | SetFocalBlurMode (ON_FocalBlurModes m)
void  | SetFocalBlurSampleCount (unsigned int count)
void  | SetRenderingSize (const ON_2iSize &size)
bool  | SetTargetPoint (ON_3dPoint target_point)
ON_3dPoint  | TargetPoint () const
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bLockedProjection
bool  | m_bShowConstructionAxes
bool  | m_bShowConstructionGrid
bool  | m_bShowConstructionZAxis
bool  | m_bShowWorldAxes
world axes icon More...
ON_SimpleArray< ON_ClippingPlaneInfo >  | m_clipping_planes
ON_3dmConstructionPlane  | m_cplane
ON_UUID  | m_display_mode_id
ON_wString  | m_name
ON_UUID  | m_named_view_id
ON_3dmPageSettings  | m_page_settings
ON_3dmViewPosition  | m_position
ON_3dmViewTraceImage  | m_trace_image
tracing image More...
ON::view_type  | m_view_type
model, page, or nested More...
ON_Viewport  | m_vp
view projection information More...
ON_3dmWallpaperImage  | m_wallpaper_image
wallpaper image More...
Constructor & Destructor Documentation
◆ ON_3dmView()
 ON_3dmView::ON_3dmView  |  ( |   | )
◆ ~ON_3dmView()
 ON_3dmView::~ON_3dmView  |  ( |   | )
Member Function Documentation
◆ Default()
 void ON_3dmView::Default  |  ( |   | )
The C++ default copy constructor and operator= work fine. Do not provide customized versions. NO ///< ON_3dmView(const ON_3dmView&); NO ///< ON_3dmView& operator=(const ON_3dmView&);
◆ Dump()
 void ON_3dmView::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ FocalBlurAperture()
 double ON_3dmView::FocalBlurAperture  |  ( |  void  |   | ) |   const
◆ FocalBlurDistance()
 double ON_3dmView::FocalBlurDistance  |  ( |  void  |   | ) |   const
◆ FocalBlurJitter()
 double ON_3dmView::FocalBlurJitter  |  ( |  void  |   | ) |   const
◆ FocalBlurMode()
 ON_FocalBlurModes ON_3dmView::FocalBlurMode  |  ( |  void  |   | ) |   const
◆ FocalBlurSampleCount()
 unsigned int ON_3dmView::FocalBlurSampleCount  |  ( |  void  |   | ) |   const
◆ IsValid()
 bool ON_3dmView::IsValid  |  ( |  ON_TextLog *  |  text_log = 0 | ) |   const
◆ Read()
 bool ON_3dmView::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ RenderingSize()
 ON_2iSize ON_3dmView::RenderingSize  |  ( |   | ) |   const
◆ SetFocalBlurAperture()
 void ON_3dmView::SetFocalBlurAperture  |  ( |  double  |  d | )
◆ SetFocalBlurDistance()
 void ON_3dmView::SetFocalBlurDistance  |  ( |  double  |  d | )
◆ SetFocalBlurJitter()
 void ON_3dmView::SetFocalBlurJitter  |  ( |  double  |  d | )
◆ SetFocalBlurMode()
 void ON_3dmView::SetFocalBlurMode  |  ( |  ON_FocalBlurModes  |  m | )
◆ SetFocalBlurSampleCount()
 void ON_3dmView::SetFocalBlurSampleCount  |  ( |  unsigned int  |  count | )
◆ SetRenderingSize()
 void ON_3dmView::SetRenderingSize  |  ( |  const ON_2iSize &  |  size | )
◆ SetTargetPoint()
 bool ON_3dmView::SetTargetPoint  |  ( |  ON_3dPoint  |  target_point | )
Description: Sets the viewport target point. Parameters: target_point - [in] When in doubt, the point m_vp.FrustumCenterPoint(ON_UNSET_VALUE) is a good choice. Remarks: This point is saved on m_vp.m_target_point.
◆ TargetPoint()
 ON_3dPoint ON_3dmView::TargetPoint  |  ( |   | ) |   const
target point Returns: Target point. This point is saved on m_vp.m_target_point. The default constructor sets the target point to ON_3dPoint::UnsetPoint. You must explicitly set the target point if you want to use it. Remarks: The target point is stored on m_vp.m_target_point. The value ON_3dmView.m_target is obsolete. This function always returns the value of m_vp.m_target_point.
◆ Write()
 bool ON_3dmView::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bLockedProjection
 bool ON_3dmView::m_bLockedProjection
If true, the the camera location, camera direction, and lens angle should not be changed. It is ok to adjust clipping planes.
◆ m_bShowConstructionAxes
 bool ON_3dmView::m_bShowConstructionAxes
◆ m_bShowConstructionGrid
 bool ON_3dmView::m_bShowConstructionGrid
◆ m_bShowConstructionZAxis
 bool ON_3dmView::m_bShowConstructionZAxis
◆ m_bShowWorldAxes
 bool ON_3dmView::m_bShowWorldAxes
world axes icon
◆ m_clipping_planes
 ON_SimpleArray<ON_ClippingPlaneInfo> ON_3dmView::m_clipping_planes
clipping planes Prior to Dec 14, 2010 m_clipping_planes was not saved with the view. After Dec 14, 2010 m_clipping_planes is saved.
◆ m_cplane
 ON_3dmConstructionPlane ON_3dmView::m_cplane
Construction plane
◆ m_display_mode_id
 ON_UUID ON_3dmView::m_display_mode_id
The value of m_display_mode_id can be one of the "standard" ids from ON_StandardDisplayModeId, nil, or a custom display mode settings on a particular computer. If you encounter a nil id or any other id that is not one of the "standard" display mode ids, then your application should use a default display mode, typically either wireframe or shaded, that is appropriate for general model viewing. The function ON::RhinoV3DisplayMode(id) will convert a display mode id into a legacy Rhino V3 display mode enum value.
◆ m_name
 ON_wString ON_3dmView::m_name
name on window
◆ m_named_view_id
 ON_UUID ON_3dmView::m_named_view_id
Named view information
If this view was created from a named view, then m_named_view_id identifies the named view.
The named views are ON_3dmView classes saved in ON_3dmSettings.m_named_views[]. A named view's id is the value returned by ON_3dmView.m_vp.ViewportId() A named view's name is the value returned by ON_3dmView.m_name
If this view is a named view, then m_named_view_id should be equal to m_vp.m_viewport_id.
If this view is not a named view and not created from a named view, then m_named_view_id is equal to ON_nil_uuid.
◆ m_page_settings
 ON_3dmPageSettings ON_3dmView::m_page_settings
If m_view_type == ON::page_view_type, then the m_page_settings records the page size. Otherwise, m_page_settings should be ignored.
◆ m_position
 ON_3dmViewPosition ON_3dmView::m_position
position of view in parent window (relative display device coordinates)
◆ m_trace_image
 ON_3dmViewTraceImage ON_3dmView::m_trace_image
tracing image
◆ m_view_type
 ON::view_type ON_3dmView::m_view_type
model, page, or nested
◆ m_vp
 ON_Viewport ON_3dmView::m_vp
view projection information
◆ m_wallpaper_image
 ON_3dmWallpaperImage ON_3dmView::m_wallpaper_image
wallpaper image