Public Member Functions | List of all members
CRhRdkCurveGraph Class Reference
RDK
#include <RhRdkCurveGraph.h>
 Inheritance diagram for CRhRdkCurveGraph:
 Public Member Functions
CRhRdkCurveGraph (IRhRdkCustomCurveCtrl::Styles s, bool bCreateBlank=false)
virtual  | ~CRhRdkCurveGraph ()
virtual void  | GetGraphXML (ON_wString &sXMLOut) const
virtual void  | Reset (void) const
virtual void  | SetGraphXML (const wchar_t *wszXML)
virtual void  | SetLiveUpdateOn (bool bOn)
virtual bool  | ShowModalDialog (HWND pParent)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Detailed Description
Displays a modal curve-graph editor window containing a red, green and blue curve. Optionally also displays a gray alpha curve.
See also
CRhRdkCurveGraphEvaluator
Constructor & Destructor Documentation
◆ ~CRhRdkCurveGraph()
 virtual CRhRdkCurveGraph::~CRhRdkCurveGraph  |  ( |   | )
virtual
◆ CRhRdkCurveGraph()
 CRhRdkCurveGraph::CRhRdkCurveGraph  |  ( |  IRhRdkCustomCurveCtrl::Styles  |  s,
|  bool  |  bCreateBlank = false
)
Parameters
eStyle | determines whether the graph has one, three or four curves.
bCreateBlank | determines if the graph should begin blank (faster) or if it should begin as a linear graph with 1, 3 or 4 curves (slower). Set this to true if you intend to call SetGraphXML() immediately after creating it.
See also
SetGraphXML()
Member Function Documentation
◆ GetGraphXML()
 virtual void CRhRdkCurveGraph::GetGraphXML  |  ( |  ON_wString &  |  sXMLOut | ) |   const
virtual
Get an XML string representing the state of the graph.
◆ Reset()
 virtual void CRhRdkCurveGraph::Reset  |  ( |  void  |   | ) |   const
virtual
Reset all curves on the graph to straight lines from (0,0) to (1,1).
◆ SetGraphXML()
 virtual void CRhRdkCurveGraph::SetGraphXML  |  ( |  const wchar_t *  |  wszXML | )
virtual
Set the state of the graph from an XML string.
Note
This can change every aspect of the graph including the number of curves. Therefore the use of eStyle as passed to the constructor could be overridden by this method.
◆ SetLiveUpdateOn()
 virtual void CRhRdkCurveGraph::SetLiveUpdateOn  |  ( |  bool  |  bOn | )
virtual
◆ ShowModalDialog()
 virtual bool CRhRdkCurveGraph::ShowModalDialog  |  ( |  HWND  |  pParent | )
virtual
Show the modal curve editor dialog. The curve graph contains a red, green and blue curve, and optionally also an alpha curve.
Returns
true if successful, false if the user canceled the dialog.