Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoZebraAnalysisSettings Class Reference
Rhino
 More...
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoZebraAnalysisSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoZebraAnalysisSettings &other) const
bool  | operator== (const CRhinoZebraAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
clamp settings to valid values More...
 Public Attributes
BYTE  | m_show_isoparms
ON_Color  | m_stripe_color
BYTE  | m_stripe_direction
0 = horizontal, 1 = vertical More...
int  | m_stripe_thickness
0 = thinnest ... 6 = thickest More...
BYTE  | reserved [2]
 Static Public Attributes
static const CRhinoZebraAnalysisSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoZebraAnalysisSettings()
 CRhinoZebraAnalysisSettings::CRhinoZebraAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoZebraAnalysisSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoZebraAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoZebraAnalysisSettings::operator!=  |  ( |  const CRhinoZebraAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoZebraAnalysisSettings::operator==  |  ( |  const CRhinoZebraAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoZebraAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoZebraAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoZebraAnalysisSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoZebraAnalysisSettings CRhinoZebraAnalysisSettings::Default
static
◆ m_show_isoparms
 BYTE CRhinoZebraAnalysisSettings::m_show_isoparms
◆ m_stripe_color
 ON_Color CRhinoZebraAnalysisSettings::m_stripe_color
◆ m_stripe_direction
 BYTE CRhinoZebraAnalysisSettings::m_stripe_direction
0 = horizontal, 1 = vertical
◆ m_stripe_thickness
 int CRhinoZebraAnalysisSettings::m_stripe_thickness
0 = thinnest ... 6 = thickest
◆ reserved
 BYTE CRhinoZebraAnalysisSettings::reserved[2]