Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoAppShortcutKeys Class Reference
Rhino
 More...
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | shortcut_key {
 f1 = 0, f2, f3, f4,
 f5, f6, f7, f8,
 f9, f10, f11, f12,
 ctrl_f1, ctrl_f2, ctrl_f3, ctrl_f4,
 ctrl_f5, ctrl_f6, ctrl_f7, ctrl_f8,
 ctrl_f9, ctrl_f10, ctrl_f11, ctrl_f12,
 shift_ctrl_f1, shift_ctrl_f2, shift_ctrl_f3, shift_ctrl_f4,
 shift_ctrl_f5, shift_ctrl_f6, shift_ctrl_f7, shift_ctrl_f8,
 shift_ctrl_f9, shift_ctrl_f10, shift_ctrl_f11, shift_ctrl_f12,
 alt_ctrl_f1, alt_ctrl_f2, alt_ctrl_f3, alt_ctrl_f4,
 alt_ctrl_f5, alt_ctrl_f6, alt_ctrl_f7, alt_ctrl_f8,
 alt_ctrl_f9, alt_ctrl_f10, alt_ctrl_f11, alt_ctrl_f12,
 ctrl_a, ctrl_b, ctrl_c, ctrl_d,
 ctrl_e, ctrl_f, ctrl_g, ctrl_h,
 ctrl_i, ctrl_j, ctrl_k, ctrl_l,
 ctrl_m, ctrl_n, ctrl_o, ctrl_p,
 ctrl_q, ctrl_r, ctrl_s, ctrl_t,
 ctrl_u, ctrl_v, ctrl_w, ctrl_x,
 ctrl_y, ctrl_z, shift_ctrl_a, shift_ctrl_b,
 shift_ctrl_c, shift_ctrl_d, shift_ctrl_e, shift_ctrl_f,
 shift_ctrl_g, shift_ctrl_h, shift_ctrl_i, shift_ctrl_j,
 shift_ctrl_k, shift_ctrl_l, shift_ctrl_m, shift_ctrl_n,
 shift_ctrl_o, shift_ctrl_p, shift_ctrl_q, shift_ctrl_r,
 shift_ctrl_s, shift_ctrl_t, shift_ctrl_u, shift_ctrl_v,
 shift_ctrl_w, shift_ctrl_x, shift_ctrl_y, shift_ctrl_z,
 alt_ctrl_a, alt_ctrl_b, alt_ctrl_c, alt_ctrl_d,
 alt_ctrl_e, alt_ctrl_f, alt_ctrl_g, alt_ctrl_h,
 alt_ctrl_i, alt_ctrl_j, alt_ctrl_k, alt_ctrl_l,
 alt_ctrl_m, alt_ctrl_n, alt_ctrl_o, alt_ctrl_p,
 alt_ctrl_q, alt_ctrl_r, alt_ctrl_s, alt_ctrl_t,
 alt_ctrl_u, alt_ctrl_v, alt_ctrl_w, alt_ctrl_x,
 alt_ctrl_y, alt_ctrl_z, ctrl_0, ctrl_1,
 ctrl_2, ctrl_3, ctrl_4, ctrl_5,
 ctrl_6, ctrl_7, ctrl_8, ctrl_9,
 shift_ctrl_0, shift_ctrl_1, shift_ctrl_2, shift_ctrl_3,
 shift_ctrl_4, shift_ctrl_5, shift_ctrl_6, shift_ctrl_7,
 shift_ctrl_8, shift_ctrl_9, alt_ctrl_0, alt_ctrl_1,
 alt_ctrl_2, alt_ctrl_3, alt_ctrl_4, alt_ctrl_5,
 alt_ctrl_6, alt_ctrl_7, alt_ctrl_8, alt_ctrl_9,
 home, end, ctrl_home, ctrl_end,
 shift_home, shift_end, shift_ctrl_home, shift_ctrl_end,
 alt_ctrl_home, alt_ctrl_end, page_up, page_down,
 shift_page_up, shift_page_down, ctrl_page_up, ctrl_page_down,
 shift_ctrl_page_up, shift_ctrl_page_down, alt_ctrl_page_up, alt_ctrl_page_down,
 shortcut_key_count
 }
 Public Member Functions
CRhinoAppShortcutKeys ()
CRhinoAppShortcutKeys (const CRhinoAppShortcutKeys &src)
void  | ClearAllMacros ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
const wchar_t *  | Macro (shortcut_key) const
bool  | operator!= (const CRhinoAppShortcutKeys &src) const
CRhinoAppShortcutKeys &  | operator= (const CRhinoAppShortcutKeys &src)
bool  | operator== (const CRhinoAppShortcutKeys &src) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | SetMacro (shortcut_key, const wchar_t *)
 Static Public Member Functions
static void  | Label (int key, ON_wString &label)
 Protected Member Functions
bool  | KeyInRange (shortcut_key) const
 Protected Attributes
ON_wString  | m_macros [shortcut_key_count]
Detailed Description
Member Enumeration Documentation
◆ shortcut_key
 enum CRhinoAppShortcutKeys::shortcut_key
Enumerator
f1
f2
f3
f4
f5
f6
f7
f8
f9
f10
f11
f12
ctrl_f1
ctrl_f2
ctrl_f3
ctrl_f4
ctrl_f5
ctrl_f6
ctrl_f7
ctrl_f8
ctrl_f9
ctrl_f10
ctrl_f11
ctrl_f12
shift_ctrl_f1
shift_ctrl_f2
shift_ctrl_f3
shift_ctrl_f4
shift_ctrl_f5
shift_ctrl_f6
shift_ctrl_f7
shift_ctrl_f8
shift_ctrl_f9
shift_ctrl_f10
shift_ctrl_f11
shift_ctrl_f12
alt_ctrl_f1
alt_ctrl_f2
alt_ctrl_f3
alt_ctrl_f4
alt_ctrl_f5
alt_ctrl_f6
alt_ctrl_f7
alt_ctrl_f8
alt_ctrl_f9
alt_ctrl_f10
alt_ctrl_f11
alt_ctrl_f12
ctrl_a
ctrl_b
ctrl_c
ctrl_d
ctrl_e
ctrl_f
ctrl_g
ctrl_h
ctrl_i
ctrl_j
ctrl_k
ctrl_l
ctrl_m
ctrl_n
ctrl_o
ctrl_p
ctrl_q
ctrl_r
ctrl_s
ctrl_t
ctrl_u
ctrl_v
ctrl_w
ctrl_x
ctrl_y
ctrl_z
shift_ctrl_a
shift_ctrl_b
shift_ctrl_c
shift_ctrl_d
shift_ctrl_e
shift_ctrl_f
shift_ctrl_g
shift_ctrl_h
shift_ctrl_i
shift_ctrl_j
shift_ctrl_k
shift_ctrl_l
shift_ctrl_m
shift_ctrl_n
shift_ctrl_o
shift_ctrl_p
shift_ctrl_q
shift_ctrl_r
shift_ctrl_s
shift_ctrl_t
shift_ctrl_u
shift_ctrl_v
shift_ctrl_w
shift_ctrl_x
shift_ctrl_y
shift_ctrl_z
alt_ctrl_a
alt_ctrl_b
alt_ctrl_c
alt_ctrl_d
alt_ctrl_e
alt_ctrl_f
alt_ctrl_g
alt_ctrl_h
alt_ctrl_i
alt_ctrl_j
alt_ctrl_k
alt_ctrl_l
alt_ctrl_m
alt_ctrl_n
alt_ctrl_o
alt_ctrl_p
alt_ctrl_q
alt_ctrl_r
alt_ctrl_s
alt_ctrl_t
alt_ctrl_u
alt_ctrl_v
alt_ctrl_w
alt_ctrl_x
alt_ctrl_y
alt_ctrl_z
ctrl_0
ctrl_1
ctrl_2
ctrl_3
ctrl_4
ctrl_5
ctrl_6
ctrl_7
ctrl_8
ctrl_9
shift_ctrl_0
shift_ctrl_1
shift_ctrl_2
shift_ctrl_3
shift_ctrl_4
shift_ctrl_5
shift_ctrl_6
shift_ctrl_7
shift_ctrl_8
shift_ctrl_9
alt_ctrl_0
alt_ctrl_1
alt_ctrl_2
alt_ctrl_3
alt_ctrl_4
alt_ctrl_5
alt_ctrl_6
alt_ctrl_7
alt_ctrl_8
alt_ctrl_9
home
end
ctrl_home
ctrl_end
shift_home
shift_end
shift_ctrl_home
shift_ctrl_end
alt_ctrl_home
alt_ctrl_end
page_up
page_down
shift_page_up
shift_page_down
ctrl_page_up
ctrl_page_down
shift_ctrl_page_up
shift_ctrl_page_down
alt_ctrl_page_up
alt_ctrl_page_down
shortcut_key_count
Constructor & Destructor Documentation
◆ CRhinoAppShortcutKeys() [1/2]
 CRhinoAppShortcutKeys::CRhinoAppShortcutKeys  |  ( |   | )
◆ CRhinoAppShortcutKeys() [2/2]
 CRhinoAppShortcutKeys::CRhinoAppShortcutKeys  |  ( |  const CRhinoAppShortcutKeys &  |  src | )
Member Function Documentation
◆ ClearAllMacros()
 void CRhinoAppShortcutKeys::ClearAllMacros  |  ( |   | )
◆ Defaults()
 void CRhinoAppShortcutKeys::Defaults  |  ( |   | )
◆ KeyInRange()
 bool CRhinoAppShortcutKeys::KeyInRange  |  ( |  shortcut_key  |   | ) |   const
protected
◆ Label()
 static void CRhinoAppShortcutKeys::Label  |  ( |  int  |  key,
|  ON_wString &  |  label
)
static
◆ LoadProfile()
 void CRhinoAppShortcutKeys::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ Macro()
 const wchar_t* CRhinoAppShortcutKeys::Macro  |  ( |  shortcut_key  |   | ) |   const
◆ operator!=()
 bool CRhinoAppShortcutKeys::operator!=  |  ( |  const CRhinoAppShortcutKeys &  |  src | ) |   const
◆ operator=()
 CRhinoAppShortcutKeys& CRhinoAppShortcutKeys::operator=  |  ( |  const CRhinoAppShortcutKeys &  |  src | )
◆ operator==()
 bool CRhinoAppShortcutKeys::operator==  |  ( |  const CRhinoAppShortcutKeys &  |  src | ) |   const
◆ SaveProfile()
 void CRhinoAppShortcutKeys::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetMacro()
 void CRhinoAppShortcutKeys::SetMacro  |  ( |  shortcut_key  |  ,
|  const wchar_t *
)
Member Data Documentation
◆ m_macros
 ON_wString CRhinoAppShortcutKeys::m_macros[shortcut_key_count]
protected