Public Member Functions | Static Public Member Functions | List of all members
CRhRdkObject Class Reference
RDK
#include <RhRdkObject.h>
 Inheritance diagram for CRhRdkObject:
 Public Member Functions
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Static Public Member Functions
static void  | CheckMemory (void)
Detailed Description
Base class for objects which are created by RDK but deleted by the client (or vice-versa). Overrides of new and delete allow you to delete such objects from your client DLL without any complications.
Constructor & Destructor Documentation
◆ CRhRdkObject()
 CRhRdkObject::CRhRdkObject  |  ( |   | )
◆ ~CRhRdkObject()
 virtual CRhRdkObject::~CRhRdkObject  |  ( |   | )
virtual
Member Function Documentation
◆ CheckMemory()
 static void CRhRdkObject::CheckMemory  |  ( |  void  |   | )
static
◆ EVF()
 virtual void* CRhRdkObject::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
Reimplemented in CRhRdkContent, CRhRdkImageAdjust, CRhRdkContent::CChildSlotIterator, CRhRdkTexture, CRhRdkCustomRenderMeshProvider, CRhRdkTextureEvaluator, CRhRdkEnvironment, CRhRdkMaterial, CRhRdkBasicMaterialCCI, CRhRdkContentFactory, CRhRdkLightManagerSupport, CRhRdkRenderMesh, CRhRdkContentIOPlugIn, CRhRdkSunStorage, CRhRdkBasicEnvironmentCCI, CRhRdkOneColorEvaluator, and CRhRdkCompoundContentImplementor.
◆ operator delete()
 void CRhRdkObject::operator delete  |  ( |  void *  |  buf | )
◆ operator delete[]()
 void CRhRdkObject::operator delete[]  |  ( |  void *  |  buf | )
◆ operator new()
 void* CRhRdkObject::operator new  |  ( |  size_t  |  size | )
◆ operator new[]()
 void* CRhRdkObject::operator new[]  |  ( |  size_t  |  size | )