Public Types | Public Member Functions | Friends | List of all members
CRhinoAppSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | osnap_command {
 osc_none = 0x00000000, osc_between = 0x00000010, osc_from_point = 0x00000100, osc_perpendicular_from = 0x00000200,
 osc_tangent_from = 0x00000400, osc_along_line = 0x00001000, osc_along_parallel = 0x00002000, osc_on_curve = 0x00010000,
 osc_on_surface = 0x00020000, osc_on_polysurface = 0x00040000
 }
enum  | osnap_mode {
 os_none = ON::os_none, os_near = ON::os_near, os_focus = ON::os_focus, os_center = ON::os_center,
 os_vertex = ON::os_vertex, os_knot = ON::os_knot, os_quadrant = ON::os_quadrant, os_midpoint = ON::os_midpoint,
 os_intersection = ON::os_intersection, os_end = ON::os_end, os_perpendicular = ON::os_perpendicular, os_tangent = ON::os_tangent,
 os_point = ON::os_point
 }
 Public Member Functions
ON_Color  | ActiveLayerColor () const
const CRhinoAppAliasList &  | Aliases () const
ON_Color  | AmbientLightColor (const CRhinoDoc *) const
const CRhinoAppAppearanceSettings &  | AppearanceSettings (bool synch_with_ui=false) const
bool  | AskOnLoadProtection () const
bool  | AutocompleteCommands () const
If true, commands are in-line autocompleted and exact matches are shown in a popup menu. More...
ON_Color  | BackgroundColor (const CRhinoDoc *) const
const CRhinoAppChooseOneObjectSettings &  | ChooseOneObjectSettings () const
bool  | CommandPromptIsVisible () const
command prompt visibility and position More...
CRhinoAppAppearanceSettings::command_prompt_position  | CommandPromptPosition () const
const CRhinoAppContextMenuSettings &  | ContextMenuSettings () const
const CRhinoAppCursorToolTipSettings &  | CursorToolTipSettings () const
const CRhinoCurvatureAnalysisSettings &  | CurvatureAnalysisSettings () const
const CRhinoCurvatureGraphSettings &  | CurvatureGraphSettings () const
const ON_Font &  | DefaultFont ()
void  | DefaultFontFaceName (ON_wString &font) const
const ON_Light &  | DefaultLight () const
const class CRhinoMaterial &  | DefaultMaterial () const
ON_Color  | DefaultObjectColor () const
default properties and light More...
void  | Defaults ()
bool  | DefaultWorldCoordIconMoveLabels () const
double  | DigitizerOsnapPickboxRadius () const
3D digitizer object snap pick box size More...
int  | DirectionArrowIconHeadSize () const
Length of direction arrow icon head in pixels. More...
int  | DirectionArrowIconShaftSize () const
Length of direction arrow icon shaft in pixels. More...
bool  | DisplayCurvesAndIsocurvesInRenderedViews (const CRhinoDoc *) const
const CRhinoDisplaySettings &  | DisplaySettings () const
bool  | DisplayTextAndDimensionsInRenderedViews (const CRhinoDoc *) const
bool  | DisplayViewportTitles () const
viewport options More...
const CRhinoAppDontRepeatCommandSettings &  | DontRepeatCommands () const
const CRhinoDraftAngleAnalysisSettings &  | DraftAngleAnalysisSettings () const
bool  | EchoCommandsToHistory () const
bool  | EchoPromptsToHistory () const
const CRhinoEdgeAnalysisSettings &  | EdgeAnalysisSettings () const
const CRhinoEmapAnalysisSettings &  | EmapAnalysisSettings () const
void  | EnableGridSnap (bool=true)
void  | EnableOrtho (bool=true)
bool  | EnableOsnapHighlight () const
bool  | EnableOsnaps () const
void  | EnablePlanar (bool=true)
ON_Color  | FeedbackColor () const
const CRhinoAppFileSettings &  | FileSettings () const
ON_Color  | FrameBackgroundColor () const
bool  | FuzzyAutocomplete () const
If true, in-line auto-complete uses popularity sorting, and pop-up menu includes closest inexact matches. More...
const CRhinoAppGeneralSettings &  | GeneralSettings () const
bool  | GetRenderedViewSettingsFromDoc () const
rendered views options More...
int  | GridAxisLineWidth () const
const CRhinoAppGridSettings &  | GridSettings () const
bool  | GridSnap () const
Grid snap setting. More...
ON_Color  | GridThickLineColor () const
int  | GridThickLineWidth () const
construction plane grid line properties More...
ON_Color  | GridThinLineColor () const
construction plane grid colors More...
ON_Color  | GridXAxisColor () const
ON_Color  | GridYAxisColor () const
ON_Color  | GridZAxisColor () const
unsigned int  | ImportFileLayerMatchingOption () const
void  | LoadProfile (CRhinoProfileContext &context)
void  | LoadRepeatCommandSettings (CRhinoProfileContext &context)
ON_Color  | LockedObjectColor (bool bIsReferenceObject=false) const
const class CRhinoMaterial &  | LockedObjectMaterial () const
for RenderPreview More...
const CRhinoAppModelAidSettings &  | ModelAidSettings () const
int  | MousePickboxRadius () const
mouse pick box size More...
const CRhinoAppMouseSettings &  | MouseSettings () const
const ON_ClassArray< CRhinoNamedColor > &  | NamedColorList ()
const CRhinoOpenGLSettings &  | OpenGLSettings () const
bool  | Ortho () const
Ortho setting. More...
bool  | OsnapDialogVisible ()
bool  | OsnapEnabled () const
Returns: true if any osnaps are enabled. More...
unsigned int  | OsnapMode () const
bool  | OsnapMode (osnap_mode) const
Persistant Osnaps. More...
int  | OsnapPickboxRadius () const
object snap pick box size More...
bool  | Planar () const
Planar setting. More...
CRhinoAppModelAidSettings::point_display_mode  | PointDisplayMode () const
class CRhAppSettingsData *  | Private () const
For internal use only. More...
bool  | ProjectOsnaps () const
void  | RemapMouse (int, int &, UINT &) const
void  | SaveProfile (CRhinoProfileContext &context) const
bool  | SaveViewChanges () const
true if changing a view should mark a document as modified More...
ON_Color  | SelectedGripColor () const
ON_Color  | SelectedObjectColor (bool bIsReferenceObject=false) const
object state colors More...
void  | SetAliases (const CRhinoAppAliasList &settings)
void  | SetAppearanceSettings (const CRhinoAppAppearanceSettings &settings)
void  | SetAskOnLoadProtection (bool bAsk)
void  | SetAutocompleteCommands (bool bEnable)
void  | SetChooseOneObjectSettings (const CRhinoAppChooseOneObjectSettings &settings)
void  | SetContextMenuSettings (const CRhinoAppContextMenuSettings &settings)
void  | SetCursorToolTipSettings (const CRhinoAppCursorToolTipSettings &settings)
void  | SetCurvatureAnalysisSettings (const CRhinoCurvatureAnalysisSettings &settings)
void  | SetCurvatureGraphSettings (const CRhinoCurvatureGraphSettings &settings)
void  | SetDisplaySettings (const CRhinoDisplaySettings &settings)
void  | SetDontRepeatCommands (const CRhinoAppDontRepeatCommandSettings &settings)
void  | SetDraftAngleAnalysisSettings (const CRhinoDraftAngleAnalysisSettings &settings)
void  | SetEdgeAnalysisSettings (const CRhinoEdgeAnalysisSettings &settings)
void  | SetEmapAnalysisSettings (const CRhinoEmapAnalysisSettings &settings)
void  | SetEnableOsnapHighlight (bool bEnable)
bool  | SetEnableOsnaps (bool bEnable=true)
void  | SetFileSettings (const CRhinoAppFileSettings &settings)
void  | SetFuzzyAutocomplete (bool bEnable)
void  | SetGeneralSettings (const CRhinoAppGeneralSettings &settings)
bool  | SetGetRenderedViewSettingsFromDoc (bool b)
void  | SetGridSettings (const CRhinoAppGridSettings &settings)
void  | SetGumballColors (CRhinoGumballColors gumball_colors)
void  | SetGumballSizes (CRhinoGumballSizes gumball_sizes)
void  | SetImportFileLayerMatchingOption (unsigned int import_file_layer_matching_option)
void  | SetModelAidSettings (const CRhinoAppModelAidSettings &settings)
void  | SetMouseSettings (const CRhinoAppMouseSettings &settings)
void  | SetOpenGLSettings (const CRhinoOpenGLSettings &)
void  | SetOsnapMode (osnap_mode mode, bool b)
bool  | SetProjectOsnaps (bool bEnable=true)
void  | SetShortCutKeys (const CRhinoAppShortcutKeys &settings)
void  | SetShowAutoGumball (bool bShowAutoGumball)
void  | SetSmartTrackSettings (const CRhinoAppSmartTrackSettings &settings)
void  | SetSnappyGumball (bool bSnappyGumball)
void  | SetSpaceBallSettings (const CRhinoAppSpaceBallSettings &settings)
void  | SetThicknessAnalysisSettings (const CRhinoThicknessAnalysisSettings &settings)
void  | SetUiPaintColorSettings (const CRhinoUiPaintColorSettings &settings)
void  | SetViewSettings (const CRhinoAppViewSettings &settings)
void  | SetWidgetColorSettings (const CRhinoWidgetColorSettings &settings)
void  | SetZebraAnalysisSettings (const CRhinoZebraAnalysisSettings &settings)
const CRhinoAppShortcutKeys &  | ShortCutKeys () const
bool  | ShowAutoGumball () const
ON_Color  | ShowEdgeColor () const
void  | ShowOsnapDialog (bool=true)
Show and Hide the Osnap dialog. More...
bool  | ShowStatusBar (bool bShow=true)
bool  | ShowZAxis (void) const
const CRhinoAppSmartTrackSettings &  | SmartTrackSettings () const
bool  | SnappyGumball () const
const CRhinoAppSpaceBallSettings &  | SpaceBallSettings () const
bool  | StatusBarIsVisisble () const
status bar state More...
const CRhinoThicknessAnalysisSettings &  | ThicknessAnalysisSettings () const
ON_Color  | TrackingColor () const
const CRhinoUiPaintColorSettings &  | UiPaintColorSettings () const
bool  | UseDontRepeatList () const
bool  | UseHiddenLightsInRenderedViews (const CRhinoDoc *) const
ON_Color  | ViewportBackgroundColor () const
viewport colors More...
const CRhinoAppViewSettings &  | ViewSettings () const
const CRhinoWidgetColorSettings &  | WidgetColorSettings () const
int  | WorldCoordIconAxisSize () const
length of the axes lines in pixels More...
int  | WorldCoordIconLabelSize () const
radius of the axes labels in pixels More...
bool  | WorldCoordIconMoveLabels () const
ON_Color  | WorldCoordIconXAxisColor () const
world coordinate icon axes colors More...
ON_Color  | WorldCoordIconYAxisColor () const
ON_Color  | WorldCoordIconZAxisColor () const
const CRhinoZebraAnalysisSettings &  | ZebraAnalysisSettings () const
 Friends
class  | CRhinoApp
Detailed Description
CRhinoAppSettings class - Rhino application settings
Member Enumeration Documentation
◆ osnap_command
 enum CRhinoAppSettings::osnap_command
Enumerator
osc_none
osc_between
osc_from_point
osc_perpendicular_from
osc_tangent_from
osc_along_line
osc_along_parallel
osc_on_curve
osc_on_surface
osc_on_polysurface
◆ osnap_mode
 enum CRhinoAppSettings::osnap_mode
The CRhinoAppSettings::osnap_mode enum is OBSOLETE. Use the ON::osnap_mode values. The reason for the change is that history records are saving these values in ON_ObjRefs.
Currently lots of files are checked out and I can't convert Rhino's use CRhinoAppSettings::osnap_mode to ON::osnap_mode.
Enumerator
os_none
os_near
os_focus
os_center
os_vertex
os_knot
os_quadrant
os_midpoint
os_intersection
os_end
os_perpendicular
os_tangent
os_point
Member Function Documentation
◆ ActiveLayerColor()
 ON_Color CRhinoAppSettings::ActiveLayerColor  |  ( |   | ) |   const
◆ Aliases()
 const CRhinoAppAliasList& CRhinoAppSettings::Aliases  |  ( |   | ) |   const
◆ AmbientLightColor()
 ON_Color CRhinoAppSettings::AmbientLightColor  |  ( |  const CRhinoDoc *  |   | ) |   const
◆ AppearanceSettings()
 const CRhinoAppAppearanceSettings& CRhinoAppSettings::AppearanceSettings  |  ( |  bool  |  synch_with_ui = false | ) |   const
◆ AskOnLoadProtection()
 bool CRhinoAppSettings::AskOnLoadProtection  |  ( |   | ) |   const
If true, a dialog will be shown when load protected plug-ins are being loaded. If false, load protected plug-ins will silently not load
◆ AutocompleteCommands()
 bool CRhinoAppSettings::AutocompleteCommands  |  ( |   | ) |   const
If true, commands are in-line autocompleted and exact matches are shown in a popup menu.
◆ BackgroundColor()
 ON_Color CRhinoAppSettings::BackgroundColor  |  ( |  const CRhinoDoc *  |   | ) |   const
◆ ChooseOneObjectSettings()
 const CRhinoAppChooseOneObjectSettings& CRhinoAppSettings::ChooseOneObjectSettings  |  ( |   | ) |   const
◆ CommandPromptIsVisible()
 bool CRhinoAppSettings::CommandPromptIsVisible  |  ( |   | ) |   const
command prompt visibility and position
◆ CommandPromptPosition()
 CRhinoAppAppearanceSettings::command_prompt_position CRhinoAppSettings::CommandPromptPosition  |  ( |   | ) |   const
◆ ContextMenuSettings()
 const CRhinoAppContextMenuSettings& CRhinoAppSettings::ContextMenuSettings  |  ( |   | ) |   const
◆ CursorToolTipSettings()
 const CRhinoAppCursorToolTipSettings& CRhinoAppSettings::CursorToolTipSettings  |  ( |   | ) |   const
◆ CurvatureAnalysisSettings()
 const CRhinoCurvatureAnalysisSettings& CRhinoAppSettings::CurvatureAnalysisSettings  |  ( |   | ) |   const
◆ CurvatureGraphSettings()
 const CRhinoCurvatureGraphSettings& CRhinoAppSettings::CurvatureGraphSettings  |  ( |   | ) |   const
◆ DefaultFont()
 const ON_Font& CRhinoAppSettings::DefaultFont  |  ( |   | )
Returns: A managed font with facename = DefaultFontFaceName().
◆ DefaultFontFaceName()
 void CRhinoAppSettings::DefaultFontFaceName  |  ( |  ON_wString &  |  font | ) |   const
◆ DefaultLight()
 const ON_Light& CRhinoAppSettings::DefaultLight  |  ( |   | ) |   const
◆ DefaultMaterial()
 const class CRhinoMaterial& CRhinoAppSettings::DefaultMaterial  |  ( |   | ) |   const
◆ DefaultObjectColor()
 ON_Color CRhinoAppSettings::DefaultObjectColor  |  ( |   | ) |   const
default properties and light
◆ Defaults()
 void CRhinoAppSettings::Defaults  |  ( |   | )
◆ DefaultWorldCoordIconMoveLabels()
 bool CRhinoAppSettings::DefaultWorldCoordIconMoveLabels  |  ( |   | ) |   const
◆ DigitizerOsnapPickboxRadius()
 double CRhinoAppSettings::DigitizerOsnapPickboxRadius  |  ( |   | ) |   const
3D digitizer object snap pick box size
◆ DirectionArrowIconHeadSize()
 int CRhinoAppSettings::DirectionArrowIconHeadSize  |  ( |   | ) |   const
Length of direction arrow icon head in pixels.
◆ DirectionArrowIconShaftSize()
 int CRhinoAppSettings::DirectionArrowIconShaftSize  |  ( |   | ) |   const
Length of direction arrow icon shaft in pixels.
◆ DisplayCurvesAndIsocurvesInRenderedViews()
 bool CRhinoAppSettings::DisplayCurvesAndIsocurvesInRenderedViews  |  ( |  const CRhinoDoc *  |   | ) |   const
If GetRenderedViewSettingsFromDoc() returns true then values for the following are returned from CRhinoDoc::Properties().RenderSettings() otherwise they are returned from CRhinoDisplaySettings
◆ DisplaySettings()
 const CRhinoDisplaySettings& CRhinoAppSettings::DisplaySettings  |  ( |   | ) |   const
◆ DisplayTextAndDimensionsInRenderedViews()
 bool CRhinoAppSettings::DisplayTextAndDimensionsInRenderedViews  |  ( |  const CRhinoDoc *  |   | ) |   const
◆ DisplayViewportTitles()
 bool CRhinoAppSettings::DisplayViewportTitles  |  ( |   | ) |   const
viewport options
◆ DontRepeatCommands()
 const CRhinoAppDontRepeatCommandSettings& CRhinoAppSettings::DontRepeatCommands  |  ( |   | ) |   const
◆ DraftAngleAnalysisSettings()
 const CRhinoDraftAngleAnalysisSettings& CRhinoAppSettings::DraftAngleAnalysisSettings  |  ( |   | ) |   const
◆ EchoCommandsToHistory()
 bool CRhinoAppSettings::EchoCommandsToHistory  |  ( |   | ) |   const
◆ EchoPromptsToHistory()
 bool CRhinoAppSettings::EchoPromptsToHistory  |  ( |   | ) |   const
◆ EdgeAnalysisSettings()
 const CRhinoEdgeAnalysisSettings& CRhinoAppSettings::EdgeAnalysisSettings  |  ( |   | ) |   const
◆ EmapAnalysisSettings()
 const CRhinoEmapAnalysisSettings& CRhinoAppSettings::EmapAnalysisSettings  |  ( |   | ) |   const
◆ EnableGridSnap()
 void CRhinoAppSettings::EnableGridSnap  |  ( |  bool  |   = true | )
◆ EnableOrtho()
 void CRhinoAppSettings::EnableOrtho  |  ( |  bool  |   = true | )
◆ EnableOsnapHighlight()
 bool CRhinoAppSettings::EnableOsnapHighlight  |  ( |   | ) |   const
END Gumball settingsBy default active osnap is indicated by thickening the wireframe of the osnapped object. Disable osnap highlight to remove the effect.
◆ EnableOsnaps()
 bool CRhinoAppSettings::EnableOsnaps  |  ( |   | ) |   const
◆ EnablePlanar()
 void CRhinoAppSettings::EnablePlanar  |  ( |  bool  |   = true | )
◆ FeedbackColor()
 ON_Color CRhinoAppSettings::FeedbackColor  |  ( |   | ) |   const
◆ FileSettings()
 const CRhinoAppFileSettings& CRhinoAppSettings::FileSettings  |  ( |   | ) |   const
◆ FrameBackgroundColor()
 ON_Color CRhinoAppSettings::FrameBackgroundColor  |  ( |   | ) |   const
◆ FuzzyAutocomplete()
 bool CRhinoAppSettings::FuzzyAutocomplete  |  ( |   | ) |   const
If true, in-line auto-complete uses popularity sorting, and pop-up menu includes closest inexact matches.
◆ GeneralSettings()
 const CRhinoAppGeneralSettings& CRhinoAppSettings::GeneralSettings  |  ( |   | ) |   const
◆ GetRenderedViewSettingsFromDoc()
 bool CRhinoAppSettings::GetRenderedViewSettingsFromDoc  |  ( |   | ) |   const
rendered views options
◆ GridAxisLineWidth()
 int CRhinoAppSettings::GridAxisLineWidth  |  ( |   | ) |   const
◆ GridSettings()
 const CRhinoAppGridSettings& CRhinoAppSettings::GridSettings  |  ( |   | ) |   const
◆ GridSnap()
 bool CRhinoAppSettings::GridSnap  |  ( |   | ) |   const
Grid snap setting.
◆ GridThickLineColor()
 ON_Color CRhinoAppSettings::GridThickLineColor  |  ( |   | ) |   const
◆ GridThickLineWidth()
 int CRhinoAppSettings::GridThickLineWidth  |  ( |   | ) |   const
construction plane grid line properties
◆ GridThinLineColor()
 ON_Color CRhinoAppSettings::GridThinLineColor  |  ( |   | ) |   const
construction plane grid colors
◆ GridXAxisColor()
 ON_Color CRhinoAppSettings::GridXAxisColor  |  ( |   | ) |   const
◆ GridYAxisColor()
 ON_Color CRhinoAppSettings::GridYAxisColor  |  ( |   | ) |   const
◆ GridZAxisColor()
 ON_Color CRhinoAppSettings::GridZAxisColor  |  ( |   | ) |   const
◆ ImportFileLayerMatchingOption()
 unsigned int CRhinoAppSettings::ImportFileLayerMatchingOption  |  ( |   | ) |   const
The import file layer matching setting belongs on CRhinoAppFileSettings but that class cannot be modified without breaking the SDK. This setting controls what happens to layers when the contents of an external source file are imported into an existing model. The Import, Paste and Insert commands are a few of the ways a file can be imported into an existing model. 0 = import layer names using the full path found in the source file. 1 = if the source file has a layer with named "source_file_parent_layer_path/X" and the current model has a layer named "current_model_parent_layer_path/X", then change all references from "source_file_parent_layer_path/X" to "current_model_parent_layer_path/X" when importing items from the source file. This mimics Rhino 4.0 behavior, where all short layer names had to be unique and the parent path was ignored.
◆ LoadProfile()
 void CRhinoAppSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  context | )
This function WILL call OnAppSettingsChanged event watchers if any settings change.
◆ LoadRepeatCommandSettings()
 void CRhinoAppSettings::LoadRepeatCommandSettings  |  ( |  CRhinoProfileContext &  |  context | )
◆ LockedObjectColor()
 ON_Color CRhinoAppSettings::LockedObjectColor  |  ( |  bool  |  bIsReferenceObject = false | ) |   const
◆ LockedObjectMaterial()
 const class CRhinoMaterial& CRhinoAppSettings::LockedObjectMaterial  |  ( |   | ) |   const
for RenderPreview
◆ ModelAidSettings()
 const CRhinoAppModelAidSettings& CRhinoAppSettings::ModelAidSettings  |  ( |   | ) |   const
◆ MousePickboxRadius()
 int CRhinoAppSettings::MousePickboxRadius  |  ( |   | ) |   const
mouse pick box size
◆ MouseSettings()
 const CRhinoAppMouseSettings& CRhinoAppSettings::MouseSettings  |  ( |   | ) |   const
◆ NamedColorList()
 const ON_ClassArray<CRhinoNamedColor>& CRhinoAppSettings::NamedColorList  |  ( |   | )
◆ OpenGLSettings()
 const CRhinoOpenGLSettings& CRhinoAppSettings::OpenGLSettings  |  ( |   | ) |   const
◆ Ortho()
 bool CRhinoAppSettings::Ortho  |  ( |   | ) |   const
Ortho setting.
◆ OsnapDialogVisible()
 bool CRhinoAppSettings::OsnapDialogVisible  |  ( |   | )
◆ OsnapEnabled()
 bool CRhinoAppSettings::OsnapEnabled  |  ( |   | ) |   const
Returns: true if any osnaps are enabled.
◆ OsnapMode() [1/2]
 unsigned int CRhinoAppSettings::OsnapMode  |  ( |   | ) |   const
Returns: An unsigned int with CRhinoAppSettings::osnap_mode bits set if an osnap is enabled.
◆ OsnapMode() [2/2]
 bool CRhinoAppSettings::OsnapMode  |  ( |  osnap_mode  |   | ) |   const
Persistant Osnaps.
◆ OsnapPickboxRadius()
 int CRhinoAppSettings::OsnapPickboxRadius  |  ( |   | ) |   const
object snap pick box size
◆ Planar()
 bool CRhinoAppSettings::Planar  |  ( |   | ) |   const
Planar setting.
◆ PointDisplayMode()
 CRhinoAppModelAidSettings::point_display_mode CRhinoAppSettings::PointDisplayMode  |  ( |   | ) |   const
◆ Private()
 class CRhAppSettingsData* CRhinoAppSettings::Private  |  ( |   | ) |   const
For internal use only.
◆ ProjectOsnaps()
 bool CRhinoAppSettings::ProjectOsnaps  |  ( |   | ) |   const
◆ RemapMouse()
 void CRhinoAppSettings::RemapMouse  |  ( |  int  |  ,
|  int &  |  ,
|  UINT &
) |   |  const
The "original" mouse event is passed in and can be modified by users who want to change one action to another.
◆ SaveProfile()
 void CRhinoAppSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |  context | ) |   const
◆ SaveViewChanges()
 bool CRhinoAppSettings::SaveViewChanges  |  ( |   | ) |   const
true if changing a view should mark a document as modified
◆ SelectedGripColor()
 ON_Color CRhinoAppSettings::SelectedGripColor  |  ( |   | ) |   const
◆ SelectedObjectColor()
 ON_Color CRhinoAppSettings::SelectedObjectColor  |  ( |  bool  |  bIsReferenceObject = false | ) |   const
object state colors
◆ SetAliases()
 void CRhinoAppSettings::SetAliases  |  ( |  const CRhinoAppAliasList &  |  settings | )
◆ SetAppearanceSettings()
 void CRhinoAppSettings::SetAppearanceSettings  |  ( |  const CRhinoAppAppearanceSettings &  |  settings | )
◆ SetAskOnLoadProtection()
 void CRhinoAppSettings::SetAskOnLoadProtection  |  ( |  bool  |  bAsk | )
◆ SetAutocompleteCommands()
 void CRhinoAppSettings::SetAutocompleteCommands  |  ( |  bool  |  bEnable | )
◆ SetChooseOneObjectSettings()
 void CRhinoAppSettings::SetChooseOneObjectSettings  |  ( |  const CRhinoAppChooseOneObjectSettings &  |  settings | )
◆ SetContextMenuSettings()
 void CRhinoAppSettings::SetContextMenuSettings  |  ( |  const CRhinoAppContextMenuSettings &  |  settings | )
◆ SetCursorToolTipSettings()
 void CRhinoAppSettings::SetCursorToolTipSettings  |  ( |  const CRhinoAppCursorToolTipSettings &  |  settings | )
◆ SetCurvatureAnalysisSettings()
 void CRhinoAppSettings::SetCurvatureAnalysisSettings  |  ( |  const CRhinoCurvatureAnalysisSettings &  |  settings | )
◆ SetCurvatureGraphSettings()
 void CRhinoAppSettings::SetCurvatureGraphSettings  |  ( |  const CRhinoCurvatureGraphSettings &  |  settings | )
◆ SetDisplaySettings()
 void CRhinoAppSettings::SetDisplaySettings  |  ( |  const CRhinoDisplaySettings &  |  settings | )
◆ SetDontRepeatCommands()
 void CRhinoAppSettings::SetDontRepeatCommands  |  ( |  const CRhinoAppDontRepeatCommandSettings &  |  settings | )
◆ SetDraftAngleAnalysisSettings()
 void CRhinoAppSettings::SetDraftAngleAnalysisSettings  |  ( |  const CRhinoDraftAngleAnalysisSettings &  |  settings | )
◆ SetEdgeAnalysisSettings()
 void CRhinoAppSettings::SetEdgeAnalysisSettings  |  ( |  const CRhinoEdgeAnalysisSettings &  |  settings | )
◆ SetEmapAnalysisSettings()
 void CRhinoAppSettings::SetEmapAnalysisSettings  |  ( |  const CRhinoEmapAnalysisSettings &  |  settings | )
◆ SetEnableOsnapHighlight()
 void CRhinoAppSettings::SetEnableOsnapHighlight  |  ( |  bool  |  bEnable | )
◆ SetEnableOsnaps()
 bool CRhinoAppSettings::SetEnableOsnaps  |  ( |  bool  |  bEnable = true | )
◆ SetFileSettings()
 void CRhinoAppSettings::SetFileSettings  |  ( |  const CRhinoAppFileSettings &  |  settings | )
◆ SetFuzzyAutocomplete()
 void CRhinoAppSettings::SetFuzzyAutocomplete  |  ( |  bool  |  bEnable | )
◆ SetGeneralSettings()
 void CRhinoAppSettings::SetGeneralSettings  |  ( |  const CRhinoAppGeneralSettings &  |  settings | )
◆ SetGetRenderedViewSettingsFromDoc()
 bool CRhinoAppSettings::SetGetRenderedViewSettingsFromDoc  |  ( |  bool  |  b | )
◆ SetGridSettings()
 void CRhinoAppSettings::SetGridSettings  |  ( |  const CRhinoAppGridSettings &  |  settings | )
◆ SetGumballColors()
 void CRhinoAppSettings::SetGumballColors  |  ( |  CRhinoGumballColors  |  gumball_colors | )
BEGIN Gumball settingsNOTE: When we are closer to shipping a finished gumball, There will be a CRhinoGumballSettings class that can be used to set/get all gumball related settings. While we are still testing the look and feel of the gumball, individual settings will be added here. Rhino default gumball colors The CRhinoGumballColors() constructor uses these values.
◆ SetGumballSizes()
 void CRhinoAppSettings::SetGumballSizes  |  ( |  CRhinoGumballSizes  |  gumball_sizes | )
Set Rhino gumball sizes. The CRhinoGumballSizes() constructor uses these values.
◆ SetImportFileLayerMatchingOption()
 void CRhinoAppSettings::SetImportFileLayerMatchingOption  |  ( |  unsigned int  |  import_file_layer_matching_option | )
See the comment above the declaration of CRhinoApp::ImportFileLayerMatchingOption() for a description of the values import_file_layer_matching_option can have.
◆ SetModelAidSettings()
 void CRhinoAppSettings::SetModelAidSettings  |  ( |  const CRhinoAppModelAidSettings &  |  settings | )
◆ SetMouseSettings()
 void CRhinoAppSettings::SetMouseSettings  |  ( |  const CRhinoAppMouseSettings &  |  settings | )
◆ SetOpenGLSettings()
 void CRhinoAppSettings::SetOpenGLSettings  |  ( |  const CRhinoOpenGLSettings &  |   | )
◆ SetOsnapMode()
 void CRhinoAppSettings::SetOsnapMode  |  ( |  osnap_mode  |  mode,
|  bool  |  b
)
◆ SetProjectOsnaps()
 bool CRhinoAppSettings::SetProjectOsnaps  |  ( |  bool  |  bEnable = true | )
◆ SetShortCutKeys()
 void CRhinoAppSettings::SetShortCutKeys  |  ( |  const CRhinoAppShortcutKeys &  |  settings | )
◆ SetShowAutoGumball()
 void CRhinoAppSettings::SetShowAutoGumball  |  ( |  bool  |  bShowAutoGumball | )
◆ SetSmartTrackSettings()
 void CRhinoAppSettings::SetSmartTrackSettings  |  ( |  const CRhinoAppSmartTrackSettings &  |  settings | )
◆ SetSnappyGumball()
 void CRhinoAppSettings::SetSnappyGumball  |  ( |  bool  |  bSnappyGumball | )
◆ SetSpaceBallSettings()
 void CRhinoAppSettings::SetSpaceBallSettings  |  ( |  const CRhinoAppSpaceBallSettings &  |  settings | )
◆ SetThicknessAnalysisSettings()
 void CRhinoAppSettings::SetThicknessAnalysisSettings  |  ( |  const CRhinoThicknessAnalysisSettings &  |  settings | )
◆ SetUiPaintColorSettings()
 void CRhinoAppSettings::SetUiPaintColorSettings  |  ( |  const CRhinoUiPaintColorSettings &  |  settings | )
◆ SetViewSettings()
 void CRhinoAppSettings::SetViewSettings  |  ( |  const CRhinoAppViewSettings &  |  settings | )
◆ SetWidgetColorSettings()
 void CRhinoAppSettings::SetWidgetColorSettings  |  ( |  const CRhinoWidgetColorSettings &  |  settings | )
◆ SetZebraAnalysisSettings()
 void CRhinoAppSettings::SetZebraAnalysisSettings  |  ( |  const CRhinoZebraAnalysisSettings &  |  settings | )
◆ ShortCutKeys()
 const CRhinoAppShortcutKeys& CRhinoAppSettings::ShortCutKeys  |  ( |   | ) |   const
◆ ShowAutoGumball()
 bool CRhinoAppSettings::ShowAutoGumball  |  ( |   | ) |   const
When AutoGumball is on, a gumball automatically appears when objects are prepicked.
◆ ShowEdgeColor()
 ON_Color CRhinoAppSettings::ShowEdgeColor  |  ( |   | ) |   const
◆ ShowOsnapDialog()
 void CRhinoAppSettings::ShowOsnapDialog  |  ( |  bool  |   = true | )
Show and Hide the Osnap dialog.
◆ ShowStatusBar()
 bool CRhinoAppSettings::ShowStatusBar  |  ( |  bool  |  bShow = true | )
◆ ShowZAxis()
 bool CRhinoAppSettings::ShowZAxis  |  ( |  void  |   | ) |   const
◆ SmartTrackSettings()
 const CRhinoAppSmartTrackSettings& CRhinoAppSettings::SmartTrackSettings  |  ( |   | ) |   const
◆ SnappyGumball()
 bool CRhinoAppSettings::SnappyGumball  |  ( |   | ) |   const
When SnappyGumball is on, a dragging a gumball moves the center point. When snappy gumball is off, dragging a gumball moves the mouse down point.
◆ SpaceBallSettings()
 const CRhinoAppSpaceBallSettings& CRhinoAppSettings::SpaceBallSettings  |  ( |   | ) |   const
◆ StatusBarIsVisisble()
 bool CRhinoAppSettings::StatusBarIsVisisble  |  ( |   | ) |   const
status bar state
◆ ThicknessAnalysisSettings()
 const CRhinoThicknessAnalysisSettings& CRhinoAppSettings::ThicknessAnalysisSettings  |  ( |   | ) |   const
◆ TrackingColor()
 ON_Color CRhinoAppSettings::TrackingColor  |  ( |   | ) |   const
◆ UiPaintColorSettings()
 const CRhinoUiPaintColorSettings& CRhinoAppSettings::UiPaintColorSettings  |  ( |   | ) |   const
◆ UseDontRepeatList()
 bool CRhinoAppSettings::UseDontRepeatList  |  ( |   | ) |   const
◆ UseHiddenLightsInRenderedViews()
 bool CRhinoAppSettings::UseHiddenLightsInRenderedViews  |  ( |  const CRhinoDoc *  |   | ) |   const
◆ ViewportBackgroundColor()
 ON_Color CRhinoAppSettings::ViewportBackgroundColor  |  ( |   | ) |   const
viewport colors
◆ ViewSettings()
 const CRhinoAppViewSettings& CRhinoAppSettings::ViewSettings  |  ( |   | ) |   const
◆ WidgetColorSettings()
 const CRhinoWidgetColorSettings& CRhinoAppSettings::WidgetColorSettings  |  ( |   | ) |   const
◆ WorldCoordIconAxisSize()
 int CRhinoAppSettings::WorldCoordIconAxisSize  |  ( |   | ) |   const
length of the axes lines in pixels
◆ WorldCoordIconLabelSize()
 int CRhinoAppSettings::WorldCoordIconLabelSize  |  ( |   | ) |   const
radius of the axes labels in pixels
◆ WorldCoordIconMoveLabels()
 bool CRhinoAppSettings::WorldCoordIconMoveLabels  |  ( |   | ) |   const
If WorldCoordIconMoveLabels() returns true, the world axes icon labels position themselves so that the axes lines are not drawn on top of the axes labels. If false, the labels are always drawn to the right of the ends of the axes.
◆ WorldCoordIconXAxisColor()
 ON_Color CRhinoAppSettings::WorldCoordIconXAxisColor  |  ( |   | ) |   const
world coordinate icon axes colors
◆ WorldCoordIconYAxisColor()
 ON_Color CRhinoAppSettings::WorldCoordIconYAxisColor  |  ( |   | ) |   const
◆ WorldCoordIconZAxisColor()
 ON_Color CRhinoAppSettings::WorldCoordIconZAxisColor  |  ( |   | ) |   const
◆ ZebraAnalysisSettings()
 const CRhinoZebraAnalysisSettings& CRhinoAppSettings::ZebraAnalysisSettings  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ CRhinoApp
 friend class CRhinoApp
friend