Public Member Functions | List of all members
CRhRdkDecalCRCList Class Referencefinal
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkDecalCRCList:
 Public Member Functions
CRhRdkDecalCRCList ()
bool  | ContainsDecalCRC (RDK_DECAL_CRC crc) const
 Public Member Functions inherited from ON_SimpleArray< RDK_DECAL_CRC >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< RDK_DECAL_CRC > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_SimpleArray ()
void  | Append (const RDK_DECAL_CRC &)
void  | Append (int, const RDK_DECAL_CRC *)
Append copy of an array T[count]. More...
RDK_DECAL_CRC &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
RDK_DECAL_CRC *  | Array ()
The Array() function return the. More...
const RDK_DECAL_CRC *  | Array () const
m_a pointer value. More...
RDK_DECAL_CRC *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
RDK_DECAL_CRC *  | At (unsigned int)
RDK_DECAL_CRC *  | At (ON__INT64)
RDK_DECAL_CRC *  | At (ON__UINT64)
const RDK_DECAL_CRC *  | At (int) const
const RDK_DECAL_CRC *  | At (unsigned int) const
const RDK_DECAL_CRC *  | At (ON__INT64) const
const RDK_DECAL_CRC *  | At (ON__UINT64) const
int  | BinarySearch (const RDK_DECAL_CRC *, int(*)(const RDK_DECAL_CRC *, const RDK_DECAL_CRC *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
int  | BinarySearch (const RDK_DECAL_CRC *, int(*)(const RDK_DECAL_CRC *, const RDK_DECAL_CRC *), int) const
int  | Capacity () const
capacity of array More...
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
RDK_DECAL_CRC *  | First ()
const RDK_DECAL_CRC *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*)(const RDK_DECAL_CRC *, const RDK_DECAL_CRC *))
void  | Insert (int, const RDK_DECAL_CRC &)
RDK_DECAL_CRC *  | KeepArray ()
RDK_DECAL_CRC *  | Last ()
const RDK_DECAL_CRC *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const RDK_DECAL_CRC * () const
operator RDK_DECAL_CRC * ()
The cast operators return a pointer. More...
ON_SimpleArray< RDK_DECAL_CRC > &  | operator= (const ON_SimpleArray< RDK_DECAL_CRC > &)
RDK_DECAL_CRC &  | operator[] (int)
RDK_DECAL_CRC &  | operator[] (unsigned int)
RDK_DECAL_CRC &  | operator[] (ON__INT64)
RDK_DECAL_CRC &  | operator[] (ON__UINT64)
const RDK_DECAL_CRC &  | operator[] (int) const
const RDK_DECAL_CRC &  | operator[] (unsigned int) const
const RDK_DECAL_CRC &  | operator[] (ON__INT64) const
const RDK_DECAL_CRC &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const RDK_DECAL_CRC *, const RDK_DECAL_CRC *))
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
virtual RDK_DECAL_CRC *  | Realloc (RDK_DECAL_CRC *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
RDK_DECAL_CRC *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const RDK_DECAL_CRC &) const
int  | Search (const RDK_DECAL_CRC *, int(*)(const RDK_DECAL_CRC *, const RDK_DECAL_CRC *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
void  | SetArray (RDK_DECAL_CRC *)
void  | SetArray (RDK_DECAL_CRC *, int, int)
RDK_DECAL_CRC *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const RDK_DECAL_CRC *, const RDK_DECAL_CRC *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const RDK_DECAL_CRC *, const RDK_DECAL_CRC *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< RDK_DECAL_CRC >
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< RDK_DECAL_CRC >
RDK_DECAL_CRC *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ CRhRdkDecalCRCList()
 CRhRdkDecalCRCList::CRhRdkDecalCRCList  |  ( |   | )
Member Function Documentation
◆ ContainsDecalCRC()
 bool CRhRdkDecalCRCList::ContainsDecalCRC  |  ( |  RDK_DECAL_CRC  |  crc | ) |   const