Public Types | Public Member Functions | List of all members
CRhRdkTextureGraphInfo Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkTextureGraphInfo:
 Public Types
enum  | Axis : unsigned int { Axis::kU = 0, Axis::kV = 1, Axis::kW = 2 }
enum  | Channel : unsigned int {
 Channel::kRed = 0, Channel::kGrn = 1, Channel::kBlu = 2, Channel::kAlp = 3,
 Channel::kLum = 4
 }
 Public Member Functions
CRhRdkTextureGraphInfo ()
CRhRdkTextureGraphInfo (const CRhRdkTextureGraphInfo &info)
virtual  | ~CRhRdkTextureGraphInfo ()
Axis  | ActiveAxis (void) const
Channel  | ActiveChannel (void) const
double  | AmountU (void) const
double  | AmountV (void) const
double  | AmountW (void) const
bool  | operator!= (const CRhRdkTextureGraphInfo &info)
const CRhRdkTextureGraphInfo &  | operator= (const CRhRdkTextureGraphInfo &info)
bool  | operator== (const CRhRdkTextureGraphInfo &info)
void  | SetActiveAxis (Axis)
void  | SetActiveChannel (Channel)
void  | SetAmountU (double)
void  | SetAmountV (double)
void  | SetAmountW (double)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Member Enumeration Documentation
◆ Axis
 enum CRhRdkTextureGraphInfo::Axis : unsigned int
strong
Enumerator
kU
kV
kW
◆ Channel
 enum CRhRdkTextureGraphInfo::Channel : unsigned int
strong
Enumerator
kRed
kGrn
kBlu
kAlp
kLum
Constructor & Destructor Documentation
◆ CRhRdkTextureGraphInfo() [1/2]
 CRhRdkTextureGraphInfo::CRhRdkTextureGraphInfo  |  ( |   | )
◆ CRhRdkTextureGraphInfo() [2/2]
 CRhRdkTextureGraphInfo::CRhRdkTextureGraphInfo  |  ( |  const CRhRdkTextureGraphInfo &  |  info | )
◆ ~CRhRdkTextureGraphInfo()
 virtual CRhRdkTextureGraphInfo::~CRhRdkTextureGraphInfo  |  ( |   | )
virtual
Member Function Documentation
◆ ActiveAxis()
 Axis CRhRdkTextureGraphInfo::ActiveAxis  |  ( |  void  |   | ) |   const
◆ ActiveChannel()
 Channel CRhRdkTextureGraphInfo::ActiveChannel  |  ( |  void  |   | ) |   const
◆ AmountU()
 double CRhRdkTextureGraphInfo::AmountU  |  ( |  void  |   | ) |   const
◆ AmountV()
 double CRhRdkTextureGraphInfo::AmountV  |  ( |  void  |   | ) |   const
◆ AmountW()
 double CRhRdkTextureGraphInfo::AmountW  |  ( |  void  |   | ) |   const
◆ operator!=()
 bool CRhRdkTextureGraphInfo::operator!=  |  ( |  const CRhRdkTextureGraphInfo &  |  info | )
◆ operator=()
 const CRhRdkTextureGraphInfo& CRhRdkTextureGraphInfo::operator=  |  ( |  const CRhRdkTextureGraphInfo &  |  info | )
◆ operator==()
 bool CRhRdkTextureGraphInfo::operator==  |  ( |  const CRhRdkTextureGraphInfo &  |  info | )
◆ SetActiveAxis()
 void CRhRdkTextureGraphInfo::SetActiveAxis  |  ( |  Axis  |   | )
◆ SetActiveChannel()
 void CRhRdkTextureGraphInfo::SetActiveChannel  |  ( |  Channel  |   | )
◆ SetAmountU()
 void CRhRdkTextureGraphInfo::SetAmountU  |  ( |  double  |   | )
◆ SetAmountV()
 void CRhRdkTextureGraphInfo::SetAmountV  |  ( |  double  |   | )
◆ SetAmountW()
 void CRhRdkTextureGraphInfo::SetAmountW  |  ( |  double  |   | )