Public Member Functions | List of all members
CRhRdkToneMapper Class Referenceabstract
RDK
#include <RhRdkToneMappers.h>
 Inheritance diagram for CRhRdkToneMapper:
 Public Member Functions
virtual  | ~CRhRdkToneMapper ()
virtual ON_wString  | GetFriendlyParamName (const wchar_t *wszParamName, bool bEnglish) const =0
virtual void  | GetParametersFromSection (const IRhRdk_XMLSection &section)=0
virtual void  | SetParametersToSection (IRhRdk_XMLSection &section) const =0
Constructor & Destructor Documentation
◆ ~CRhRdkToneMapper()
 virtual CRhRdkToneMapper::~CRhRdkToneMapper  |  ( |   | )
inlinevirtual
Member Function Documentation
◆ GetFriendlyParamName()
 virtual ON_wString CRhRdkToneMapper::GetFriendlyParamName  |  ( |  const wchar_t *  |  wszParamName,
|  bool  |  bEnglish
) |   |  const
pure virtual
Implemented in CRhRdkToneMapper_Logarithmic, and CRhRdkToneMapper_BlackWhitePoint.
◆ GetParametersFromSection()
 virtual void CRhRdkToneMapper::GetParametersFromSection  |  ( |  const IRhRdk_XMLSection &  |  section | )
pure virtual
Implemented in CRhRdkToneMapper_Logarithmic, and CRhRdkToneMapper_BlackWhitePoint.
◆ SetParametersToSection()
 virtual void CRhRdkToneMapper::SetParametersToSection  |  ( |  IRhRdk_XMLSection &  |  section | ) |   const
pure virtual
Implemented in CRhRdkToneMapper_Logarithmic, and CRhRdkToneMapper_BlackWhitePoint.