Public Member Functions | Public Attributes | Protected Member Functions | Protected Attributes | List of all members
ON_HLD_Object Class Referenceabstract
OpenNURBS
#include <opennurbs_plus_hiddenline.h>
 Public Member Functions
virtual void  | DestroyRuntimeCache (bool bDelete)=0
virtual const ON_Geometry *  | Geometry () const =0
const ON_Xform &  | GetXform () const
ON_HLD_Object &  | operator= (const ON_HLD_Object &)=default
bool  | UseXform () const
 Public Attributes
ON__UINT_PTR  | m_obj_id
ON_UUID  | m_obj_UUID
 Protected Member Functions
ON_HLD_Object ()=default
ON_HLD_Object (const ON_HLD_Object &)=delete
virtual  | ~ON_HLD_Object ()
 Protected Attributes
bool  | m_bUseXform
if true use xform. This allows a simple test instead always testing for th More...
void *  | m_Reserved = nullptr
ON_Xform  | m_xform
the xform is applied to the geometry, *geom, before it is located in the 3d world coordinates of the scene More...
Constructor & Destructor Documentation
◆ ON_HLD_Object() [1/2]
 ON_HLD_Object::ON_HLD_Object  |  ( |   | )
protecteddefault
◆ ON_HLD_Object() [2/2]
 ON_HLD_Object::ON_HLD_Object  |  ( |  const ON_HLD_Object &  |   | )
protecteddelete
◆ ~ON_HLD_Object()
 virtual ON_HLD_Object::~ON_HLD_Object  |  ( |   | )
inlineprotectedvirtual
Member Function Documentation
◆ DestroyRuntimeCache()
 virtual void ON_HLD_Object::DestroyRuntimeCache  |  ( |  bool  |  bDelete | )
pure virtual
◆ Geometry()
 virtual const ON_Geometry* ON_HLD_Object::Geometry  |  ( |   | ) |   const
pure virtual
Geometry() is in world coordinates if UseXform() is false, otherwise geometry is in object space coordinates (see GetXform() below).
◆ GetXform()
 const ON_Xform& ON_HLD_Object::GetXform  |  ( |   | ) |   const
Description GetXform returns the mapping from object space to world coordinates. If UseXform() is false then GetXform() returns the identity transform.
◆ operator=()
 ON_HLD_Object& ON_HLD_Object::operator=  |  ( |  const ON_HLD_Object &  |   | )
default
◆ UseXform()
 bool ON_HLD_Object::UseXform  |  ( |   | ) |   const
Description Returns true if there is an xform that must be applied to transform geom into the world coordinate system
Member Data Documentation
◆ m_bUseXform
 bool ON_HLD_Object::m_bUseXform
protected
if true use xform. This allows a simple test instead always testing for th
◆ m_obj_id
 ON__UINT_PTR ON_HLD_Object::m_obj_id
◆ m_obj_UUID
 ON_UUID ON_HLD_Object::m_obj_UUID
These user specified identifiers are available for the caller to identify the source of objects in the hidden line drawing. These fields are not used by the ON_HiddenLineDrawing class.
◆ m_Reserved
 void* ON_HLD_Object::m_Reserved = nullptr
protected
◆ m_xform
 ON_Xform ON_HLD_Object::m_xform
protected
the xform is applied to the geometry, *geom, before it is located in the 3d world coordinates of the scene