Public Member Functions | List of all members
CRhRdkPreviewJobSignature Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkPreviewJobSignature:
 Public Member Functions
CRhRdkPreviewJobSignature (int imageWidth, int imageHeight, unsigned long sceneSignature)
CRhRdkPreviewJobSignature (const CRhRdkPreviewJobSignature &sig)
virtual  | ~CRhRdkPreviewJobSignature ()
ON_wString  | AsString (void) const
void  | Clear (void)
int  | ImageHeight (void) const
int  | ImageWidth (void) const
bool  | IsNull (void) const
bool  | IsSceneSignatureEqualTo (DWORD dwSceneSig) const
bool  | operator!= (const CRhRdkPreviewJobSignature &sig) const
const CRhRdkPreviewJobSignature &  | operator= (const CRhRdkPreviewJobSignature &sig)
bool  | operator== (const CRhRdkPreviewJobSignature &sig) const
unsigned long  | SceneSignature (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Constructor & Destructor Documentation
◆ CRhRdkPreviewJobSignature() [1/2]
 CRhRdkPreviewJobSignature::CRhRdkPreviewJobSignature  |  ( |  int  |  imageWidth,
|  int  |  imageHeight,
|  unsigned long  |  sceneSignature
)
◆ CRhRdkPreviewJobSignature() [2/2]
 CRhRdkPreviewJobSignature::CRhRdkPreviewJobSignature  |  ( |  const CRhRdkPreviewJobSignature &  |  sig | )
◆ ~CRhRdkPreviewJobSignature()
 virtual CRhRdkPreviewJobSignature::~CRhRdkPreviewJobSignature  |  ( |   | )
virtual
Member Function Documentation
◆ AsString()
 ON_wString CRhRdkPreviewJobSignature::AsString  |  ( |  void  |   | ) |   const
◆ Clear()
 void CRhRdkPreviewJobSignature::Clear  |  ( |  void  |   | )
◆ ImageHeight()
 int CRhRdkPreviewJobSignature::ImageHeight  |  ( |  void  |   | ) |   const
◆ ImageWidth()
 int CRhRdkPreviewJobSignature::ImageWidth  |  ( |  void  |   | ) |   const
◆ IsNull()
 bool CRhRdkPreviewJobSignature::IsNull  |  ( |  void  |   | ) |   const
◆ IsSceneSignatureEqualTo()
 bool CRhRdkPreviewJobSignature::IsSceneSignatureEqualTo  |  ( |  DWORD  |  dwSceneSig | ) |   const
◆ operator!=()
 bool CRhRdkPreviewJobSignature::operator!=  |  ( |  const CRhRdkPreviewJobSignature &  |  sig | ) |   const
◆ operator=()
 const CRhRdkPreviewJobSignature& CRhRdkPreviewJobSignature::operator=  |  ( |  const CRhRdkPreviewJobSignature &  |  sig | )
◆ operator==()
 bool CRhRdkPreviewJobSignature::operator==  |  ( |  const CRhRdkPreviewJobSignature &  |  sig | ) |   const
◆ SceneSignature()
 unsigned long CRhRdkPreviewJobSignature::SceneSignature  |  ( |  void  |   | ) |   const