Public Member Functions | List of all members
CRhRdkContentEditor Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkContentEditor:
 Public Member Functions
CRhRdkContentEditor (RhRdkUiFrameworks f, IRhRdkEditor::Types t, CRhRdkContent::Kinds kind, int inPlaceId=0)
virtual  | ~CRhRdkContentEditor ()
virtual CRhRdkControllerPtr  | Controller (void) const override
virtual void *  | EVF (const wchar_t *, void *) override
virtual RhRdkUiFrameworks  | Framework (void) const override
virtual UUID  | Id (void) const override
virtual RhRdkUiModalities  | Modality (void) const override
virtual void  | OnContentUICreated (class IRhRdkContentUI &ui) override
void  | SetController (CRhRdkControllerPtr con)
void  | SetUiHostWindow (HWND h)
virtual CRhRdkContent::Kinds  | TopLevelKind (void) const override
virtual Types  | Type (void) const override
virtual HWND  | UiHostWindow (void) const override
 Public Member Functions inherited from IRhRdkContentEditor
virtual  | ~IRhRdkContentEditor ()
 Additional Inherited Members
 Public Types inherited from IRhRdkContentEditor
enum  | EditMethods : unsigned int { EditMethods::Local, EditMethods::Modal, EditMethods::Floating }
 Public Types inherited from IRhRdkEditor
enum  | Types : unsigned int {
 Types::Unset, Types::Main, Types::Modal, Types::Floating,
 Types::InPlace
 }
 Static Public Member Functions inherited from IRhRdkContentEditor
static IRhRdkContentEditor *  | Find (const UUID &uuidEditor)
 Static Public Member Functions inherited from IRhRdkEditor
static IRhRdkEditor *  | Find (const UUID &uuidEditor)
 Protected Member Functions inherited from IRhRdkEditor
virtual  | ~IRhRdkEditor ()
Detailed Description
You should derive your content editor class from this instead of trying to implement IRhRdkContentEditor which will not work because this class does some critical operations behind the scenes.
Constructor & Destructor Documentation
◆ CRhRdkContentEditor()
 CRhRdkContentEditor::CRhRdkContentEditor  |  ( |  RhRdkUiFrameworks  |  f,
|  IRhRdkEditor::Types  |  t,
|  CRhRdkContent::Kinds  |  kind,
|  int  |  inPlaceId = 0
)
◆ ~CRhRdkContentEditor()
 virtual CRhRdkContentEditor::~CRhRdkContentEditor  |  ( |   | )
virtual
Member Function Documentation
◆ Controller()
 virtual CRhRdkControllerPtr CRhRdkContentEditor::Controller  |  ( |  void  |   | ) |   const
overridevirtual
Returns
the editor's controller.
Implements IRhRdkContentEditor.
◆ EVF()
 virtual void* CRhRdkContentEditor::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
overridevirtual
Emergency virtual function for future expansion.
Implements IRhRdkContentEditor.
◆ Framework()
 virtual RhRdkUiFrameworks CRhRdkContentEditor::Framework  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The UI framework.
Implements IRhRdkEditor.
◆ Id()
 virtual UUID CRhRdkContentEditor::Id  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The unique identifier of the editor.
Implements IRhRdkEditor.
◆ Modality()
 virtual RhRdkUiModalities CRhRdkContentEditor::Modality  |  ( |  void  |   | ) |   const
overridevirtual
Returns
the modality of the editor.
Implements IRhRdkEditor.
◆ OnContentUICreated()
 virtual void CRhRdkContentEditor::OnContentUICreated  |  ( |  class IRhRdkContentUI &  |  ui | )
overridevirtual
Called just after a content UI has been created.
Implements IRhRdkContentEditor.
◆ SetController()
 void CRhRdkContentEditor::SetController  |  ( |  CRhRdkControllerPtr  |  con | )
◆ SetUiHostWindow()
 void CRhRdkContentEditor::SetUiHostWindow  |  ( |  HWND  |  h | )
◆ TopLevelKind()
 virtual CRhRdkContent::Kinds CRhRdkContentEditor::TopLevelKind  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The kind of top-level content being displayed in the editor.
Implements IRhRdkContentEditor.
◆ Type()
 virtual Types CRhRdkContentEditor::Type  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The editor type.
Implements IRhRdkEditor.
◆ UiHostWindow()
 virtual HWND CRhRdkContentEditor::UiHostWindow  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhRdkContentEditor.