Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
CRhRdkContentCtrlBase Class Referenceabstract
RDK
#include <RhRdkContentCtrlBase.h>
 Inheritance diagram for CRhRdkContentCtrlBase:
 Public Member Functions
CRhRdkContentCtrlBase ()
virtual  | ~CRhRdkContentCtrlBase ()
virtual bool  | AmountEnabled (void) const
virtual bool  | AmountVaries (void) const
virtual void  | Change (void)
virtual bool  | CheckEnabled (void) const
CRhRdkControllerPtr  | Controller (void) const
virtual bool  | CreateWnd (DWORD dwStyle, const RECT &rect, CWnd *pParent, UINT uID)
virtual void  | DisplayData (void)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual double  | GetAmount (void) const
virtual CRhRdkVariant  | GetChannelCustom (void) const
virtual CRhRdkVariant  | GetChannelMode (void) const
virtual UINT  | GetCheck (void) const
virtual bool  | IsEmpty (void) const
virtual void  | OnAmountChanged (void)
virtual void  | OnChange (void)
virtual void  | OnCheckChanged (void)
virtual bool  | ReadOnly (void) const
virtual void  | SetAmount (double d)
virtual void  | SetAmountBounds (double dMin, double dMax)
virtual void  | SetAmountEnabled (bool b)
virtual void  | SetAmountVaries (bool b=true)
virtual void  | SetChannelCustom (const CRhRdkVariant &vString)
virtual bool  | SetChannelMode (const CRhRdkVariant &vMode)
virtual void  | SetCheck (UINT u)
virtual void  | SetCheckEnabled (bool b)
void  | SetController (CRhRdkControllerPtr con)
virtual void  | SetReadOnly (bool b)
virtual void  | ShowAmount (bool b)
virtual void  | ShowCheck (bool b)
virtual void  | ShowIcon (bool b)
 Static Public Member Functions
static RDK_DEPRECATED UINT  | AmountMessageNumber (void)
static RDK_DEPRECATED UINT  | CheckMessageNumber (void)
 Protected Member Functions
virtual class IRhRdkContentCtrlBase *  | GetBaseInterface (void) const =0
virtual void  | Initialize (void)
RDK_DEPRECATED afx_msg LRESULT  | OnAmount (WPARAM, LPARAM)
RDK_DEPRECATED afx_msg LRESULT  | OnCheck (WPARAM, LPARAM)
afx_msg int  | OnCreate (LPCREATESTRUCT)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnEnable (BOOL bEnable)
afx_msg BOOL  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | PreSubclassWindow () override
Detailed Description
Base class for content controls. This is the old-style control that looks like a hyperlink. It also optionally has a check box and amount edit box.
Constructor & Destructor Documentation
◆ CRhRdkContentCtrlBase()
 CRhRdkContentCtrlBase::CRhRdkContentCtrlBase  |  ( |   | )
◆ ~CRhRdkContentCtrlBase()
 virtual CRhRdkContentCtrlBase::~CRhRdkContentCtrlBase  |  ( |   | )
virtual
Member Function Documentation
◆ AmountEnabled()
 virtual bool CRhRdkContentCtrlBase::AmountEnabled  |  ( |  void  |   | ) |   const
virtual
Returns
The enable state of the amount control.
◆ AmountMessageNumber()
 static RDK_DEPRECATED UINT CRhRdkContentCtrlBase::AmountMessageNumber  |  ( |  void  |   | )
static
◆ AmountVaries()
 virtual bool CRhRdkContentCtrlBase::AmountVaries  |  ( |  void  |   | ) |   const
virtual
Returns
true if the amount varies, else false.
◆ Change()
 virtual void CRhRdkContentCtrlBase::Change  |  ( |  void  |   | )
virtual
Executes the change command - as if the button on the right had been pressed.
◆ CheckEnabled()
 virtual bool CRhRdkContentCtrlBase::CheckEnabled  |  ( |  void  |   | ) |   const
virtual
Returns
The enable state of the check mark.
◆ CheckMessageNumber()
 static RDK_DEPRECATED UINT CRhRdkContentCtrlBase::CheckMessageNumber  |  ( |  void  |   | )
static
◆ Controller()
 CRhRdkControllerPtr CRhRdkContentCtrlBase::Controller  |  ( |  void  |   | ) |   const
◆ CreateWnd()
 virtual bool CRhRdkContentCtrlBase::CreateWnd  |  ( |  DWORD  |  dwStyle,
|  const RECT &  |  rect,
|  CWnd *  |  pParent,
|  UINT  |  uID
)
virtual
Create the control.
Parameters
dwStyle | specifies window styles for the control.
rect | specifies the size and position of the control in client coords of pParent.
pParent | is the parent window.
uID | is the ID of the control.
Returns
true if created successfully, else false.
◆ DisplayData()
 virtual void CRhRdkContentCtrlBase::DisplayData  |  ( |  void  |   | )
virtual
Force the control to re-display its content information.
◆ EVF()
 virtual void* CRhRdkContentCtrlBase::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
◆ GetAmount()
 virtual double CRhRdkContentCtrlBase::GetAmount  |  ( |  void  |   | ) |   const
virtual
Returns
The amount shown by the amount control in the range of its bounds.
◆ GetBaseInterface()
 virtual class IRhRdkContentCtrlBase* CRhRdkContentCtrlBase::GetBaseInterface  |  ( |  void  |   | ) |   const
protectedpure virtual
Implemented in CRhRdkSubNodeCtrl, and CRhRdkContentCtrl.
◆ GetChannelCustom()
 virtual CRhRdkVariant CRhRdkContentCtrlBase::GetChannelCustom  |  ( |  void  |   | ) |   const
virtual
Returns
The custom channel string set in the Properties dialog expressed as a string variant.
◆ GetChannelMode()
 virtual CRhRdkVariant CRhRdkContentCtrlBase::GetChannelMode  |  ( |  void  |   | ) |   const
virtual
Returns
The channel mode set in the Properties dialog expressed as a string variant.
◆ GetCheck()
 virtual UINT CRhRdkContentCtrlBase::GetCheck  |  ( |  void  |   | ) |   const
virtual
Returns
The state of the check mark. Same as CButton::GetCheck().
◆ Initialize()
 virtual void CRhRdkContentCtrlBase::Initialize  |  ( |  void  |   | )
protectedvirtual
◆ IsEmpty()
 virtual bool CRhRdkContentCtrlBase::IsEmpty  |  ( |  void  |   | ) |   const
virtual
Returns
true if the control is displaying "(none)", else false.
◆ OnAmount()
 RDK_DEPRECATED afx_msg LRESULT CRhRdkContentCtrlBase::OnAmount  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnAmountChanged()
 virtual void CRhRdkContentCtrlBase::OnAmountChanged  |  ( |  void  |   | )
inlinevirtual
This is called after the user has changed the amount value. Optionally override this method to handle amount changes in a subclass of the control.
◆ OnChange()
 virtual void CRhRdkContentCtrlBase::OnChange  |  ( |  void  |   | )
inlinevirtual
This function is called after the user has changed the content. Optionally override this method to handle changes in a subclass of the control.
◆ OnCheck()
 RDK_DEPRECATED afx_msg LRESULT CRhRdkContentCtrlBase::OnCheck  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnCheckChanged()
 virtual void CRhRdkContentCtrlBase::OnCheckChanged  |  ( |  void  |   | )
inlinevirtual
This is called after the user has changed the check box state. Optionally override this method to handle check changes in a subclass of the control.
◆ OnCreate()
 afx_msg int CRhRdkContentCtrlBase::OnCreate  |  ( |  LPCREATESTRUCT  |   | )
protected
◆ OnCtlColor()
 afx_msg HBRUSH CRhRdkContentCtrlBase::OnCtlColor  |  ( |  CDC *  |  pDC,
|  CWnd *  |  pWnd,
|  UINT  |  nCtlColor
)
protected
◆ OnEnable()
 afx_msg void CRhRdkContentCtrlBase::OnEnable  |  ( |  BOOL  |  bEnable | )
protected
◆ OnEraseBkgnd()
 afx_msg BOOL CRhRdkContentCtrlBase::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
protected
◆ OnSize()
 afx_msg void CRhRdkContentCtrlBase::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
protected
◆ PreSubclassWindow()
 virtual void CRhRdkContentCtrlBase::PreSubclassWindow  |  ( |   | )
overrideprotectedvirtual
Called just before the control is subclassed.
◆ ReadOnly()
 virtual bool CRhRdkContentCtrlBase::ReadOnly  |  ( |  void  |   | ) |   const
virtual
Returns
true if the control is read-only.
◆ SetAmount()
 virtual void CRhRdkContentCtrlBase::SetAmount  |  ( |  double  |  d | )
virtual
Set the amount shown by the amount control in the range of its bounds.
◆ SetAmountBounds()
 virtual void CRhRdkContentCtrlBase::SetAmountBounds  |  ( |  double  |  dMin,
|  double  |  dMax
)
virtual
Set the bounds of the amount control in the range -1.0 to 1.0. The default bounds are 0.0 and 1.0.
◆ SetAmountEnabled()
 virtual void CRhRdkContentCtrlBase::SetAmountEnabled  |  ( |  bool  |  b | )
virtual
Set the enable state of the amount control.
◆ SetAmountVaries()
 virtual void CRhRdkContentCtrlBase::SetAmountVaries  |  ( |  bool  |  b = true | )
virtual
Set the varies state of the amount control.
◆ SetChannelCustom()
 virtual void CRhRdkContentCtrlBase::SetChannelCustom  |  ( |  const CRhRdkVariant &  |  vString | )
virtual
Set the custom channel string for the Properties dialog.
◆ SetChannelMode()
 virtual bool CRhRdkContentCtrlBase::SetChannelMode  |  ( |  const CRhRdkVariant &  |  vMode | )
virtual
Set the channel mode for the Properties dialog.
Parameters
vMode | is a string variant. Valid values are "default" or "custom"
◆ SetCheck()
 virtual void CRhRdkContentCtrlBase::SetCheck  |  ( |  UINT  |  u | )
virtual
Set the state of the check mark. Same as CButton::SetCheck().
◆ SetCheckEnabled()
 virtual void CRhRdkContentCtrlBase::SetCheckEnabled  |  ( |  bool  |  b | )
virtual
Set the enable state of the check mark.
◆ SetController()
 void CRhRdkContentCtrlBase::SetController  |  ( |  CRhRdkControllerPtr  |  con | )
◆ SetReadOnly()
 virtual void CRhRdkContentCtrlBase::SetReadOnly  |  ( |  bool  |  b | )
virtual
Make the control read-only. This prevents the user from changing or removing the child.
◆ ShowAmount()
 virtual void CRhRdkContentCtrlBase::ShowAmount  |  ( |  bool  |  b | )
virtual
Shows or hides an amount control on the right of the content control.
Note
The amount control is 'percentile'; it shows 0% to 100% but actual values are always in the range 0.0 to 1.0.
◆ ShowCheck()
 virtual void CRhRdkContentCtrlBase::ShowCheck  |  ( |  bool  |  b | )
virtual
Shows or hides a check mark on the left of the content control.
◆ ShowIcon()
 virtual void CRhRdkContentCtrlBase::ShowIcon  |  ( |  bool  |  b | )
virtual
Shows or hides an icon on the left of the content control. The icon is generated from the content.