Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoOpenGLSettings Class Reference
Rhino
 More...
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoOpenGLSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
bool  | operator!= (const CRhinoOpenGLSettings &other) const
bool  | operator== (const CRhinoOpenGLSettings &other) const
The default copy constructor, operator=, and destructor work fine. More...
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
void  | Validate ()
clamp settings to valid values More...
 Public Attributes
bool  | m_bLineSmoothing = true
bool  | m_bRegenBufferOnHardwareSwap = true
Some cards can't reproduce the backbuffer in certain situations. More...
bool  | m_bUseHardwareDriverModes = true
Try to use non-generic modes... More...
bool  | m_bUseTessellationShaders = true
use tessellation shaders when available More...
bool  | m_bUseTextureCompression = false
int  | m_max_gl_level = 45
int  | m_nAnisotropicMode = 3
0 = none, 1 = Low, 2 = Medium, 3 = High More...
int  | m_nAntialiasMode = 2
0 = none, 1 = Low, 2 = Medium, 3 = High More...
int  | m_nMipMapMode = 2
0 = none, 1 = Nearest, 2 = Linear More...
bool  | m_use_core_profile = false
 Static Public Attributes
static const CRhinoOpenGLSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoOpenGLSettings()
 CRhinoOpenGLSettings::CRhinoOpenGLSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoOpenGLSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoOpenGLSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
◆ operator!=()
 bool CRhinoOpenGLSettings::operator!=  |  ( |  const CRhinoOpenGLSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoOpenGLSettings::operator==  |  ( |  const CRhinoOpenGLSettings &  |  other | ) |   const
The default copy constructor, operator=, and destructor work fine.
◆ ProfileKey()
 const wchar_t* CRhinoOpenGLSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoOpenGLSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
◆ Validate()
 void CRhinoOpenGLSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoOpenGLSettings CRhinoOpenGLSettings::Default
static
◆ m_bLineSmoothing
 bool CRhinoOpenGLSettings::m_bLineSmoothing = true
alpha blend wires out from the edge of the curve. No line smoothing will have higher performance, but lower quality
◆ m_bRegenBufferOnHardwareSwap
 bool CRhinoOpenGLSettings::m_bRegenBufferOnHardwareSwap = true
Some cards can't reproduce the backbuffer in certain situations.
◆ m_bUseHardwareDriverModes
 bool CRhinoOpenGLSettings::m_bUseHardwareDriverModes = true
Try to use non-generic modes...
◆ m_bUseTessellationShaders
 bool CRhinoOpenGLSettings::m_bUseTessellationShaders = true
use tessellation shaders when available
◆ m_bUseTextureCompression
 bool CRhinoOpenGLSettings::m_bUseTextureCompression = false
◆ m_max_gl_level
 int CRhinoOpenGLSettings::m_max_gl_level = 45
used to cap the OpenGL operating level (40 would mean only use OpenGL 4.0 functionality and below)
◆ m_nAnisotropicMode
 int CRhinoOpenGLSettings::m_nAnisotropicMode = 3
0 = none, 1 = Low, 2 = Medium, 3 = High
◆ m_nAntialiasMode
 int CRhinoOpenGLSettings::m_nAntialiasMode = 2
0 = none, 1 = Low, 2 = Medium, 3 = High
◆ m_nMipMapMode
 int CRhinoOpenGLSettings::m_nMipMapMode = 2
0 = none, 1 = Nearest, 2 = Linear
◆ m_use_core_profile
 bool CRhinoOpenGLSettings::m_use_core_profile = false