Public Types | Public Member Functions | List of all members
CRhRdkCreateNew Class Referencefinal
RDK
#include <RhRdkTask.h>
 Public Types
enum  | { cnf_ForceAdvanced = 0x0001, cnf_MultiSelect = 0x0002, cnf_SuppressLibraryDialog = 0x0004, cnf_SuppressHarvesting = 0x0008 }
 Public Member Functions
CRhRdkCreateNew ()
~CRhRdkCreateNew ()
bool  | Execute (const IRhRdkTaskOrigin &origin) const
bool  | Execute (const IRhRdkTaskOrigin &origin, UINT cnf_Flags, OUT CRhRdkContentArray &aNewContent) const
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
cnf_ForceAdvanced
cnf_MultiSelect
cnf_SuppressLibraryDialog
cnf_SuppressHarvesting
Constructor & Destructor Documentation
◆ CRhRdkCreateNew()
 CRhRdkCreateNew::CRhRdkCreateNew  |  ( |   | )
◆ ~CRhRdkCreateNew()
 CRhRdkCreateNew::~CRhRdkCreateNew  |  ( |   | )
Member Function Documentation
◆ Execute() [1/2]
 bool CRhRdkCreateNew::Execute  |  ( |  const IRhRdkTaskOrigin &  |  origin | ) |   const
◆ Execute() [2/2]
 bool CRhRdkCreateNew::Execute  |  ( |  const IRhRdkTaskOrigin &  |  origin,
|  UINT  |  cnf_Flags,
|  OUT CRhRdkContentArray &  |  aNewContent
) |   |  const