Classes | Public Member Functions | List of all members
CRhinoAfterTransformObject Class Referenceabstract
Rhino
#include <rhinoSdkEventWatcher.h>
 Inheritance diagram for CRhinoAfterTransformObject:
 Classes
class  | CParameters
 Public Member Functions
CRhinoAfterTransformObject (ON_UUID plugin_id)
virtual void  | Notify (const class CRhinoAfterTransformObject::CParameters &params)=0
 Public Member Functions inherited from CRhinoEventWatcherEx
void  | Enable (bool bEnable)
bool  | IsEnabled () const
bool  | IsRegistered () const
void  | operator delete (void *)
void  | operator delete (void *, void *)
void  | operator delete[] (void *)
void *  | operator new (size_t)
new/delete More...
void *  | operator new (size_t, void *)
in place new/delete More...
void *  | operator new[] (size_t)
array new/delete More...
bool  | Register ()
bool  | Unregister ()
 Additional Inherited Members
 Public Types inherited from CRhinoEventWatcherEx
enum  | event_type {
 event_type_none = 0, event_type_transform_object = 1, event_type_change_object_select_state = 2, event_type_after_transform_object = 3,
 event_type_set_active_detail_object = 4, event_type_view_display_mode_changed = 5, event_type_before_post_read_view_update = 6, event_type_after_post_read_view_update = 7,
 event_type_rhino_is_idle = 8, event_type_modeless_ui_doc_changed = 9, event_type_target_doc_changed = 10, event_type_plug_in_settings_changed = 11,
 event_type_max, event_type_force_4byte_size = 0xFFFFFFFF
 }
 Public Attributes inherited from CRhinoEventWatcherEx
const event_type  | m_event_type
Type of event being watched. More...
const ON_UUID  | m_plugin_id
ID of plug-in that is watching. More...
const unsigned int  | m_watcher_sn
unique runtime serial number for this watcher More...
 Protected Member Functions inherited from CRhinoEventWatcherEx
CRhinoEventWatcherEx (CRhinoEventWatcherEx::event_type et, ON_UUID plugin_id)
virtual  | ~CRhinoEventWatcherEx ()
Constructor & Destructor Documentation
◆ CRhinoAfterTransformObject()
 CRhinoAfterTransformObject::CRhinoAfterTransformObject  |  ( |  ON_UUID  |  plugin_id | )
Member Function Documentation
◆ Notify()
 virtual void CRhinoAfterTransformObject::Notify  |  ( |  const class CRhinoAfterTransformObject::CParameters &  |  params | )
pure virtual
Rhino will call Notify after transforming the objects. WARNING: Never modify the Rhino document in a CRhinoAfterTransformObject::Notify override. If you need to change the Rhino document or post update messages to controls, then your CRhinoAfterTransformObject::Notify should record what happened in an efficient way and then make any changes that are required in a CRhinoIsIdle.Notify() override.