Public Member Functions | List of all members
ON_XMeshEventList Class Reference
OpenNURBS
#include <opennurbs_plus_mesh_intersection.h>
 Inheritance diagram for ON_XMeshEventList:
 Public Member Functions
bool  | HasComponentEvent (const ON_XMeshComponent *pC, int side) const
bool  | HasEvent (const ON_XMeshEvent *pX) const
ON_XMeshEvent *  | Match (ON_XMeshComponent *component, int side)
const ON_XMeshEvent *  | Match (const ON_XMeshComponent *component, int side) const
ON_XMeshEvent *  | Match (ON_XMeshComponent *comp0, ON_XMeshComponent *comp1)
const ON_XMeshEvent *  | Match (const ON_XMeshComponent *comp0, const ON_XMeshComponent *comp1) const
void  | RemoveEvent (const ON_XMeshEvent *pX)
 Public Member Functions inherited from ON_SimpleArray< ON_XMeshEvent *>
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_XMeshEvent * > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_XMeshEvent * &)
void  | Append (int, const ON_XMeshEvent * *)
Append copy of an array T[count]. More...
ON_XMeshEvent * &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_XMeshEvent * *  | Array ()
The Array() function return the. More...
const ON_XMeshEvent * *  | Array () const
m_a pointer value. More...
ON_XMeshEvent * *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_XMeshEvent * *  | At (unsigned int)
ON_XMeshEvent * *  | At (ON__INT64)
ON_XMeshEvent * *  | At (ON__UINT64)
const ON_XMeshEvent * *  | At (int) const
const ON_XMeshEvent * *  | At (unsigned int) const
const ON_XMeshEvent * *  | At (ON__INT64) const
const ON_XMeshEvent * *  | At (ON__UINT64) const
int  | BinarySearch (const ON_XMeshEvent * *, int(*)(const ON_XMeshEvent * *, const ON_XMeshEvent * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
int  | BinarySearch (const ON_XMeshEvent * *, int(*)(const ON_XMeshEvent * *, const ON_XMeshEvent * *), int) const
int  | Capacity () const
capacity of array More...
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_XMeshEvent * *  | First ()
const ON_XMeshEvent * *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*)(const ON_XMeshEvent * *, const ON_XMeshEvent * *))
void  | Insert (int, const ON_XMeshEvent * &)
ON_XMeshEvent * *  | KeepArray ()
ON_XMeshEvent * *  | Last ()
const ON_XMeshEvent * *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_XMeshEvent * * () const
operator ON_XMeshEvent ** ()
The cast operators return a pointer. More...
ON_SimpleArray< ON_XMeshEvent * > &  | operator= (const ON_SimpleArray< ON_XMeshEvent * > &)
ON_XMeshEvent * &  | operator[] (int)
ON_XMeshEvent * &  | operator[] (unsigned int)
ON_XMeshEvent * &  | operator[] (ON__INT64)
ON_XMeshEvent * &  | operator[] (ON__UINT64)
const ON_XMeshEvent * &  | operator[] (int) const
const ON_XMeshEvent * &  | operator[] (unsigned int) const
const ON_XMeshEvent * &  | operator[] (ON__INT64) const
const ON_XMeshEvent * &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const ON_XMeshEvent * *, const ON_XMeshEvent * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
virtual ON_XMeshEvent * *  | Realloc (ON_XMeshEvent * *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
ON_XMeshEvent * *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_XMeshEvent * &) const
int  | Search (const ON_XMeshEvent * *, int(*)(const ON_XMeshEvent * *, const ON_XMeshEvent * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
void  | SetArray (ON_XMeshEvent * *)
void  | SetArray (ON_XMeshEvent * *, int, int)
ON_XMeshEvent * *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_XMeshEvent * *, const ON_XMeshEvent * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_XMeshEvent * *, const ON_XMeshEvent * *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_XMeshEvent *>
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_XMeshEvent *>
ON_XMeshEvent * *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Member Function Documentation
◆ HasComponentEvent()
 bool ON_XMeshEventList::HasComponentEvent  |  ( |  const ON_XMeshComponent *  |  pC,
|  int  |  side
) |   |  const
◆ HasEvent()
 bool ON_XMeshEventList::HasEvent  |  ( |  const ON_XMeshEvent *  |  pX | ) |   const
◆ Match() [1/4]
 ON_XMeshEvent* ON_XMeshEventList::Match  |  ( |  ON_XMeshComponent *  |  component,
|  int  |  side
)
◆ Match() [2/4]
 const ON_XMeshEvent* ON_XMeshEventList::Match  |  ( |  const ON_XMeshComponent *  |  component,
|  int  |  side
) |   |  const
◆ Match() [3/4]
 ON_XMeshEvent* ON_XMeshEventList::Match  |  ( |  ON_XMeshComponent *  |  comp0,
|  ON_XMeshComponent *  |  comp1
)
◆ Match() [4/4]
 const ON_XMeshEvent* ON_XMeshEventList::Match  |  ( |  const ON_XMeshComponent *  |  comp0,
|  const ON_XMeshComponent *  |  comp1
) |   |  const
◆ RemoveEvent()
 void ON_XMeshEventList::RemoveEvent  |  ( |  const ON_XMeshEvent *  |  pX | )