Public Member Functions | Protected Member Functions | List of all members
CRhRdkRhinoObjectList Class Referenceabstract
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkRhinoObjectList:
 Public Member Functions
CRhRdkRhinoObjectList ()
virtual  | ~CRhRdkRhinoObjectList ()
void  | Add (const CRhinoObject *pObject)
void  | AddObjects (const class CLBPRhObjectSelection &sel)
ON_BoundingBox  | BoundingBox (void) const
void  | Clear (void)
bool  | Contains (const CRhinoObject &obj) const
int  | Count (void) const
virtual const CRhinoDoc *  | GetDocument (void) const =0
const CRhinoObject *  | Object (int iIndex) const
void  | Remove (const CRhinoObject *pObject)
bool  | Replace (int iIndex, const UUID &uuid)
CRhinoGet::result  | SelectAddObjects (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
virtual bool  | Filter (const CRhinoObject *pObject) const
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Constructor & Destructor Documentation
◆ CRhRdkRhinoObjectList()
 CRhRdkRhinoObjectList::CRhRdkRhinoObjectList  |  ( |   | )
◆ ~CRhRdkRhinoObjectList()
 virtual CRhRdkRhinoObjectList::~CRhRdkRhinoObjectList  |  ( |   | )
virtual
Member Function Documentation
◆ Add()
 void CRhRdkRhinoObjectList::Add  |  ( |  const CRhinoObject *  |  pObject | )
◆ AddObjects()
 void CRhRdkRhinoObjectList::AddObjects  |  ( |  const class CLBPRhObjectSelection &  |  sel | )
◆ BoundingBox()
 ON_BoundingBox CRhRdkRhinoObjectList::BoundingBox  |  ( |  void  |   | ) |   const
◆ Clear()
 void CRhRdkRhinoObjectList::Clear  |  ( |  void  |   | )
◆ Contains()
 bool CRhRdkRhinoObjectList::Contains  |  ( |  const CRhinoObject &  |  obj | ) |   const
◆ Count()
 int CRhRdkRhinoObjectList::Count  |  ( |  void  |   | ) |   const
◆ Filter()
 virtual bool CRhRdkRhinoObjectList::Filter  |  ( |  const CRhinoObject *  |  pObject | ) |   const
protectedvirtual
◆ GetDocument()
 virtual const CRhinoDoc* CRhRdkRhinoObjectList::GetDocument  |  ( |  void  |   | ) |   const
pure virtual
◆ Object()
 const CRhinoObject* CRhRdkRhinoObjectList::Object  |  ( |  int  |  iIndex | ) |   const
◆ Remove()
 void CRhRdkRhinoObjectList::Remove  |  ( |  const CRhinoObject *  |  pObject | )
◆ Replace()
 bool CRhRdkRhinoObjectList::Replace  |  ( |  int  |  iIndex,
|  const UUID &  |  uuid
)
◆ SelectAddObjects()
 CRhinoGet::result CRhRdkRhinoObjectList::SelectAddObjects  |  ( |  void  |   | )