Classes | Public Member Functions | List of all members
CRhRdkPreviewMetaData Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkPreviewMetaData:
 Classes
class  | CItem
 Public Member Functions
CRhRdkPreviewMetaData ()
virtual  | ~CRhRdkPreviewMetaData ()
virtual void  | Add (const CItem &desc)
virtual void  | Clear (void)
virtual bool  | Next (CItem &itemOut) const
virtual void  | ResetIterator (void) const
virtual void  | SetName (const wchar_t *wszName)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Detailed Description
This class represents content preview 'meta data' which is saved in a document. This meta data generally contains the properties for all previews in a particular content editor.
Constructor & Destructor Documentation
◆ CRhRdkPreviewMetaData()
 CRhRdkPreviewMetaData::CRhRdkPreviewMetaData  |  ( |   | )
◆ ~CRhRdkPreviewMetaData()
 virtual CRhRdkPreviewMetaData::~CRhRdkPreviewMetaData  |  ( |   | )
virtual
Member Function Documentation
◆ Add()
 virtual void CRhRdkPreviewMetaData::Add  |  ( |  const CItem &  |  desc | )
virtual
Add an item to the collection.
◆ Clear()
 virtual void CRhRdkPreviewMetaData::Clear  |  ( |  void  |   | )
virtual
Clear the collection.
◆ Next()
 virtual bool CRhRdkPreviewMetaData::Next  |  ( |  CItem &  |  itemOut | ) |   const
virtual
Get the next item using the built-in item iterator.
◆ ResetIterator()
 virtual void CRhRdkPreviewMetaData::ResetIterator  |  ( |  void  |   | ) |   const
virtual
Reset the built-in item iterator.
◆ SetName()
 virtual void CRhRdkPreviewMetaData::SetName  |  ( |  const wchar_t *  |  wszName | )
virtual
Set a name for the collection. The name must be unique within the document so it is good practise to include a UUID and/or the name of your plug-in. Internally the RDK uses a special prefix followed by the editor id.