Public Member Functions | Public Attributes | List of all members
ON_MeshCurvatureStats Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshCurvatureStats ()
ON_MeshCurvatureStats (const ON_MeshCurvatureStats &)
~ON_MeshCurvatureStats ()
void  | Destroy ()
void  | EmergencyDestroy ()
ON_MeshCurvatureStats &  | operator= (const ON_MeshCurvatureStats &)
bool  | Read (ON_BinaryArchive &)
bool  | Set (ON::curvature_style, int, const ON_SurfaceCurvature *, const ON_3fVector *, double=0.0)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
double  | m_adev
average deviation of "finite" values More...
double  | m_average
average of "finite" values More...
int  | m_count
count of "finite" values More...
int  | m_count_infinite
number of "infinte" values More...
double  | m_infinity
double  | m_mode
mode of "finite" values More...
ON_Interval  | m_range
ON::curvature_style  | m_style
Constructor & Destructor Documentation
◆ ON_MeshCurvatureStats() [1/2]
 ON_MeshCurvatureStats::ON_MeshCurvatureStats  |  ( |   | )
◆ ~ON_MeshCurvatureStats()
 ON_MeshCurvatureStats::~ON_MeshCurvatureStats  |  ( |   | )
◆ ON_MeshCurvatureStats() [2/2]
 ON_MeshCurvatureStats::ON_MeshCurvatureStats  |  ( |  const ON_MeshCurvatureStats &  |   | )
Member Function Documentation
◆ Destroy()
 void ON_MeshCurvatureStats::Destroy  |  ( |   | )
◆ EmergencyDestroy()
 void ON_MeshCurvatureStats::EmergencyDestroy  |  ( |   | )
◆ operator=()
 ON_MeshCurvatureStats& ON_MeshCurvatureStats::operator=  |  ( |  const ON_MeshCurvatureStats &  |   | )
◆ Read()
 bool ON_MeshCurvatureStats::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Set()
 bool ON_MeshCurvatureStats::Set  |  ( |  ON::curvature_style  |  ,
|  int  |  ,
|  const ON_SurfaceCurvature *  |  ,
|  const ON_3fVector *  |  ,
|  double  |   = 0.0
)
◆ Write()
 bool ON_MeshCurvatureStats::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_adev
 double ON_MeshCurvatureStats::m_adev
average deviation of "finite" values
◆ m_average
 double ON_MeshCurvatureStats::m_average
average of "finite" values
◆ m_count
 int ON_MeshCurvatureStats::m_count
count of "finite" values
◆ m_count_infinite
 int ON_MeshCurvatureStats::m_count_infinite
number of "infinte" values
◆ m_infinity
 double ON_MeshCurvatureStats::m_infinity
curvature values >= this are considered infinite and not used to compute the m_average or m_adev
◆ m_mode
 double ON_MeshCurvatureStats::m_mode
mode of "finite" values
◆ m_range
 ON_Interval ON_MeshCurvatureStats::m_range
◆ m_style
 ON::curvature_style ON_MeshCurvatureStats::m_style