Public Member Functions | Protected Member Functions | List of all members
CRhRdkToneMapper_BlackWhitePoint Class Reference
RDK
#include <RhRdkToneMappers.h>
 Inheritance diagram for CRhRdkToneMapper_BlackWhitePoint:
 Public Member Functions
CRhRdkToneMapper_BlackWhitePoint (float fBlackPoint=0.0f, float fWhitePoint=1.0f)
virtual  | ~CRhRdkToneMapper_BlackWhitePoint ()
float  | BlackPoint (void) const
virtual ON_wString  | GetFriendlyParamName (const wchar_t *wszParamName, bool bEnglish) const
virtual void  | GetParametersFromSection (const IRhRdk_XMLSection &section)
virtual void  | ProcessPixel (float &r, float &g, float &b)
void  | SetBlackPoint (float)
virtual void  | SetParametersToSection (IRhRdk_XMLSection &section) const
void  | SetWhitePoint (float)
float  | WhitePoint (void) const
 Public Member Functions inherited from CRhRdkToneMapper
virtual  | ~CRhRdkToneMapper ()
 Protected Member Functions
void  | UpdateReciprocal (void)
Constructor & Destructor Documentation
◆ CRhRdkToneMapper_BlackWhitePoint()
 CRhRdkToneMapper_BlackWhitePoint::CRhRdkToneMapper_BlackWhitePoint  |  ( |  float  |  fBlackPoint = 0.0f,
|  float  |  fWhitePoint = 1.0f
)
◆ ~CRhRdkToneMapper_BlackWhitePoint()
 virtual CRhRdkToneMapper_BlackWhitePoint::~CRhRdkToneMapper_BlackWhitePoint  |  ( |   | )
virtual
Member Function Documentation
◆ BlackPoint()
 float CRhRdkToneMapper_BlackWhitePoint::BlackPoint  |  ( |  void  |   | ) |   const
◆ GetFriendlyParamName()
 virtual ON_wString CRhRdkToneMapper_BlackWhitePoint::GetFriendlyParamName  |  ( |  const wchar_t *  |  wszParamName,
|  bool  |  bEnglish
) |   |  const
virtual
Implements CRhRdkToneMapper.
◆ GetParametersFromSection()
 virtual void CRhRdkToneMapper_BlackWhitePoint::GetParametersFromSection  |  ( |  const IRhRdk_XMLSection &  |  section | )
virtual
Implements CRhRdkToneMapper.
◆ ProcessPixel()
 virtual void CRhRdkToneMapper_BlackWhitePoint::ProcessPixel  |  ( |  float &  |  r,
|  float &  |  g,
|  float &  |  b
)
virtual
Implements CRhRdkToneMapper_PixelBased.
◆ SetBlackPoint()
 void CRhRdkToneMapper_BlackWhitePoint::SetBlackPoint  |  ( |  float  |   | )
◆ SetParametersToSection()
 virtual void CRhRdkToneMapper_BlackWhitePoint::SetParametersToSection  |  ( |  IRhRdk_XMLSection &  |  section | ) |   const
virtual
Implements CRhRdkToneMapper.
◆ SetWhitePoint()
 void CRhRdkToneMapper_BlackWhitePoint::SetWhitePoint  |  ( |  float  |   | )
◆ UpdateReciprocal()
 void CRhRdkToneMapper_BlackWhitePoint::UpdateReciprocal  |  ( |  void  |   | )
protected
◆ WhitePoint()
 float CRhRdkToneMapper_BlackWhitePoint::WhitePoint  |  ( |  void  |   | ) |   const