Public Member Functions | Static Public Member Functions | List of all members
CRhRdkTimeZone Class Referencefinal
RDK
#include <RhRdkTimeZone.h>
 Public Member Functions
CRhRdkTimeZone ()
CRhRdkTimeZone (double lon, double lat, double dHours, const wchar_t *wszName)
~CRhRdkTimeZone ()
double  | Hours (void) const
double  | Latitude (void) const
double  | Longitude (void) const
ON_wString  | Name (void) const
 Static Public Member Functions
static int  | Count (void)
static const CRhRdkTimeZone *  | GetAt (int i)
static void  | GetList (ON_ClassArray< CRhRdkTimeZone > &aOut)
Constructor & Destructor Documentation
◆ CRhRdkTimeZone() [1/2]
 CRhRdkTimeZone::CRhRdkTimeZone  |  ( |   | )
◆ CRhRdkTimeZone() [2/2]
 CRhRdkTimeZone::CRhRdkTimeZone  |  ( |  double  |  lon,
|  double  |  lat,
|  double  |  dHours,
|  const wchar_t *  |  wszName
)
◆ ~CRhRdkTimeZone()
 CRhRdkTimeZone::~CRhRdkTimeZone  |  ( |   | )
Member Function Documentation
◆ Count()
 static int CRhRdkTimeZone::Count  |  ( |  void  |   | )
static
◆ GetAt()
 static const CRhRdkTimeZone* CRhRdkTimeZone::GetAt  |  ( |  int  |  i | )
static
◆ GetList()
 static void CRhRdkTimeZone::GetList  |  ( |  ON_ClassArray< CRhRdkTimeZone > &  |  aOut | )
static
◆ Hours()
 double CRhRdkTimeZone::Hours  |  ( |  void  |   | ) |   const
Returns
the time zone hours offset from UTC.
◆ Latitude()
 double CRhRdkTimeZone::Latitude  |  ( |  void  |   | ) |   const
Returns
the latitude of a major city in the time zone.
◆ Longitude()
 double CRhRdkTimeZone::Longitude  |  ( |  void  |   | ) |   const
Returns
the longitude of a major city in the time zone.
◆ Name()
 ON_wString CRhRdkTimeZone::Name  |  ( |  void  |   | ) |   const
Returns
the name of the time zone.