Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoDraftAngleAnalysisSettings Class Reference
Rhino
 More...
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoDraftAngleAnalysisSettings ()
ON__UINT32  | ColorMappingCRC () const
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoDraftAngleAnalysisSettings &other) const
bool  | operator== (const CRhinoDraftAngleAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
clamp settings to valid values More...
 Public Attributes
ON_Interval  | m_angle_range
bool  | m_show_isoparms
ON_3dVector  | m_up
 Static Public Attributes
static const CRhinoDraftAngleAnalysisSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoDraftAngleAnalysisSettings()
 CRhinoDraftAngleAnalysisSettings::CRhinoDraftAngleAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ ColorMappingCRC()
 ON__UINT32 CRhinoDraftAngleAnalysisSettings::ColorMappingCRC  |  ( |   | ) |   const
◆ Defaults()
 void CRhinoDraftAngleAnalysisSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoDraftAngleAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoDraftAngleAnalysisSettings::operator!=  |  ( |  const CRhinoDraftAngleAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoDraftAngleAnalysisSettings::operator==  |  ( |  const CRhinoDraftAngleAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoDraftAngleAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoDraftAngleAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoDraftAngleAnalysisSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoDraftAngleAnalysisSettings CRhinoDraftAngleAnalysisSettings::Default
static
◆ m_angle_range
 ON_Interval CRhinoDraftAngleAnalysisSettings::m_angle_range
◆ m_show_isoparms
 bool CRhinoDraftAngleAnalysisSettings::m_show_isoparms
◆ m_up
 ON_3dVector CRhinoDraftAngleAnalysisSettings::m_up