Public Member Functions | Static Public Attributes | Friends | List of all members
ON_Outline Class Reference
OpenNURBS
#include <opennurbs_font.h>
 Public Member Functions
ON_Outline ()=default
ON_Outline (const ON_Outline &)=default
~ON_Outline ()=default
ON__UINT16  | AppendFigure (const ON_SimpleArray< ON_OutlineFigurePoint > &points)
ON__UINT16  | AppendFigure (size_t point_count, const ON_OutlineFigurePoint *points)
double  | AreaEstimate () const
const ON_OutlineFigure &  | Figure (int i) const
unsigned int  | FigureCount () const
const ON_ClassArray< ON_OutlineFigure > &  | Figures () const
unsigned int  | GetOutlineCurves (double scale, bool b3d, ON_ClassArray< ON_SimpleArray< ON_Curve * > > &outline_curves) const
const ON_TextBox  | GlyphMetrics () const
bool  | IsValidOutline (bool bLogErrors) const
ON_Outline &  | operator= (const ON_Outline &)=default
const ON_BoundingBox  | OutlineBoundingBox () const
unsigned int  | OutlinePointCount () const
void  | Reverse ()
void  | SetGlyphMetrics (ON_TextBox glyph_metrics)
void  | SetUnitsPerEM (ON__UINT32 units_per_em)
bool  | SingleStroke () const
ON__UINT32  | UnitsPerEM () const
 Static Public Attributes
static const ON_Outline  | Unset
 Friends
class  | ON_OutlineAccumulator
Constructor & Destructor Documentation
◆ ON_Outline() [1/2]
 ON_Outline::ON_Outline  |  ( |   | )
default
◆ ~ON_Outline()
 ON_Outline::~ON_Outline  |  ( |   | )
default
◆ ON_Outline() [2/2]
 ON_Outline::ON_Outline  |  ( |  const ON_Outline &  |   | )
default
Member Function Documentation
◆ AppendFigure() [1/2]
 ON__UINT16 ON_Outline::AppendFigure  |  ( |  const ON_SimpleArray< ON_OutlineFigurePoint > &  |  points | )
◆ AppendFigure() [2/2]
 ON__UINT16 ON_Outline::AppendFigure  |  ( |  size_t  |  point_count,
|  const ON_OutlineFigurePoint *  |  points
)
◆ AreaEstimate()
 double ON_Outline::AreaEstimate  |  ( |   | ) |   const
Description: The signed area estimate calculated as the sum of each figure's area estimate.
◆ Figure()
 const ON_OutlineFigure& ON_Outline::Figure  |  ( |  int  |  i | ) |   const
Parameters: i - [in] 0 <= i < count
◆ FigureCount()
 unsigned int ON_Outline::FigureCount  |  ( |   | ) |   const
Returns: Number of figures in the outline.
◆ Figures()
 const ON_ClassArray< ON_OutlineFigure >& ON_Outline::Figures  |  ( |   | ) |   const
◆ GetOutlineCurves()
 unsigned int ON_Outline::GetOutlineCurves  |  ( |  double  |  scale,
|  bool  |  b3d,
|  ON_ClassArray< ON_SimpleArray< ON_Curve * > > &  |  outline_curves
) |   |  const
Description: The outline consists of one or more figures. There can be zero or more closed outer figures (single stroke fonts have zero, Arial I has one, Arial i has two). There can be zero or more inner figures (Arial I has zero, O has one, 8 has two). Parameters: scale - [in] If scale > 0.0, then all curves are scaled this factor with (0,0) as the fixed point. Otherwise all curves are returned in font design units. ON_Font::ScaleFromTextHeight() is a good tool to get this value. b3d - [in] If true, then 3d curves in the world xy plane are returned. Otherwise 2d curves are returned. figure_curves - [in] Results are appended to this array. Returns: Number of figures appended to outline_curves[]
◆ GlyphMetrics()
 const ON_TextBox ON_Outline::GlyphMetrics  |  ( |   | ) |   const
Returns: Glyph metrics. Remarks: The glyph metrics bounding box of the metrics can be different from the figure outline bounding box. For example, the glyph metrics box for 1 (numeral one) often contains space beyond the glyph outline because 1 visually occupies the same space as a 2. The choice is up to the font designer and takes into account the desired font asthetics of columns of numbers.
◆ IsValidOutline()
 bool ON_Outline::IsValidOutline  |  ( |  bool  |  bLogErrors | ) |   const
Parameters: bLogErrors - [in]
Returns: True if the outline and all figures are valid.
◆ operator=()
 ON_Outline& ON_Outline::operator=  |  ( |  const ON_Outline &  |   | )
default
◆ OutlineBoundingBox()
 const ON_BoundingBox ON_Outline::OutlineBoundingBox  |  ( |   | ) |   const
Returns: The bounding box of the outline curves.
Remarks: The glyph metrics bounding box of the metrics can be different from the figure outline bounding box. For example, the glyph metrics box for 1 (numeral one) often contains space beyond the glyph outline because 1 visually occupies the same space as a 2. The choice is up to the font designer and takes into account the desired font asthetics of columns of numbers.
◆ OutlinePointCount()
 unsigned int ON_Outline::OutlinePointCount  |  ( |   | ) |   const
Returns: Number of points in all figures in the outline.
◆ Reverse()
 void ON_Outline::Reverse  |  ( |   | )
Description: Reverse every figure.
◆ SetGlyphMetrics()
 void ON_Outline::SetGlyphMetrics  |  ( |  ON_TextBox  |  glyph_metrics | )
◆ SetUnitsPerEM()
 void ON_Outline::SetUnitsPerEM  |  ( |  ON__UINT32  |  units_per_em | )
◆ SingleStroke()
 bool ON_Outline::SingleStroke  |  ( |   | ) |   const
Returns: True if all figures are single stroke. False otherwise. Remarks: This occures with glyphs in single stroke fonts.
◆ UnitsPerEM()
 ON__UINT32 ON_Outline::UnitsPerEM  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ ON_OutlineAccumulator
 friend class ON_OutlineAccumulator
friend
Member Data Documentation
◆ Unset
 const ON_Outline ON_Outline::Unset
static