Public Member Functions | List of all members
CRhinoTextOutTextLog Class Reference
Rhino
#include <RhinoSdkTextOut.h>
 Inheritance diagram for CRhinoTextOutTextLog:
 Public Member Functions
virtual void  | DumpText (const wchar_t *lps)
 Public Member Functions inherited from ON_TextLog
ON_TextLog ()
ON_TextLog (FILE *fp)
dump to open ASCII text file More...
ON_TextLog (ON_wString &s)
virtual  | ~ON_TextLog ()
void  | GetDoubleFormat (ON_String &) const
void  | GetFloatFormat (ON_String &) const
int  | IndentCount ()
int  | IndentSize () const
bool  | IsTextHash () const
ON_TextLog &  | operator<< (const char *)
ON_TextLog &  | operator<< (char)
ON_TextLog &  | operator<< (short)
ON_TextLog &  | operator<< (int)
ON_TextLog &  | operator<< (float)
ON_TextLog &  | operator<< (double)
ON_TextLog &  | operator<< (const ON_2dPoint &)
ON_TextLog &  | operator<< (const ON_3dPoint &)
ON_TextLog &  | operator<< (const ON_4dPoint &)
ON_TextLog &  | operator<< (const ON_2dVector &)
ON_TextLog &  | operator<< (const ON_3dVector &)
ON_TextLog &  | operator<< (const ON_Xform &)
void  | PopIndent ()
void ON_VARGS_FUNC_CDECL  | Print (const char *format,...)
void ON_VARGS_FUNC_CDECL  | Print (const wchar_t *format,...)
void  | Print (float)
void  | Print (double)
void  | Print (const ON_2dPoint &)
void  | Print (const ON_3dPoint &)
void  | Print (const ON_4dPoint &)
void  | Print (const ON_2dVector &)
void  | Print (const ON_3dVector &)
void  | Print (const ON_Xform &)
void  | Print (const ON_UUID &)
void  | Print (const ON_COMPONENT_INDEX &)
void  | Print (const ON_wString &string)
void  | Print (const ON_String &string)
void  | Print (const ON_3dPointArray &, const char *=nullptr)
void  | Print (const ON_Matrix &, const char *=nullptr, int=0)
void  | PrintCurrentTime ()
void  | PrintKnotVector (int, int, const double *)
void  | PrintNewLine ()
printing utilities More...
void  | PrintPointGrid (int, bool, int, int, int, int, const double *, const char *=nullptr)
void  | PrintPointList (int, bool, int, int, const double *, const char *=nullptr)
void  | PrintRGB (const ON_Color &)
void  | PrintString (const char *s)
void  | PrintString (const wchar_t *s)
void  | PrintTime (const struct tm &t)
void  | PrintWrappedText (const char *, int=60)
last arg is maximum line length More...
void  | PrintWrappedText (const wchar_t *, int=60)
last arg is maximum line length More...
void  | PushIndent ()
void  | SetDoubleFormat (const char *)
default is g More...
void  | SetFloatFormat (const char *)
default is g More...
void  | SetIndentCount (int indent_count)
void  | SetIndentSize (int)
 Additional Inherited Members
 Static Public Attributes inherited from ON_TextLog
static ON_TextLog  | Null
 Protected Member Functions inherited from ON_TextLog
virtual void  | AppendText (const char *s)
virtual void  | AppendText (const wchar_t *s)
 Protected Attributes inherited from ON_TextLog
FILE *  | m_pFile
ON_wString *  | m_pString
Detailed Description
Copyright (c) 1993-2016 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Function Documentation
◆ DumpText()
 virtual void CRhinoTextOutTextLog::DumpText  |  ( |  const wchar_t *  |  lps | )
virtual