Public Member Functions | Protected Member Functions | List of all members
CRhRdkTextureFactory Class Referenceabstract
RDK
#include <RhRdkTextureFactory.h>
 Inheritance diagram for CRhRdkTextureFactory:
 Public Member Functions
CRhRdkTextureFactory ()
virtual  | ~CRhRdkTextureFactory ()
virtual CRhRdkContent::Kinds  | Kind (void) const
virtual CRhRdkContent *  | NewContent (void) const
 Public Member Functions inherited from CRhRdkContentFactory
CRhRdkContentFactory ()
virtual  | ~CRhRdkContentFactory ()
virtual ON_wString  | ContentInternalName (void) const
virtual UUID  | ContentTypeId (void) const
virtual IRhRdkContentUIAgent *  | ContentUIAgent (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual bool  | Initialize (void)
virtual UUID  | InterfaceId (void) const final override
virtual bool  | IsBuiltIn (void) const
virtual bool  | IsElevated (void) const
virtual bool  | IsKind (CRhRdkContent::Kinds kind) const
virtual UUID  | PlugInId (void) const
virtual void  | RebuildCache (void)
virtual UUID  | RenderEngineId (void) const
virtual void  | SetContentUIAgent (IRhRdkContentUIAgent *pAgent)
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
virtual class CRhRdkTexture *  | NewTexture (void) const =0
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Constructor & Destructor Documentation
◆ CRhRdkTextureFactory()
 CRhRdkTextureFactory::CRhRdkTextureFactory  |  ( |   | )
◆ ~CRhRdkTextureFactory()
 virtual CRhRdkTextureFactory::~CRhRdkTextureFactory  |  ( |   | )
virtual
Member Function Documentation
◆ Kind()
 virtual CRhRdkContent::Kinds CRhRdkTextureFactory::Kind  |  ( |  void  |   | ) |   const
virtual
Returns
The kind of content that this factory produces.
Implements CRhRdkContentFactory.
◆ NewContent()
 virtual CRhRdkContent* CRhRdkTextureFactory::NewContent  |  ( |  void  |   | ) |   const
virtual
Create a new content.
Note
This should be implemented simply as
new CMyContent(...);
 No further initialization or operations should be performed on the new content.
Returns
A pointer to a new instance of the content that this factory produces.
Implements CRhRdkContentFactory.
◆ NewTexture()
 virtual class CRhRdkTexture* CRhRdkTextureFactory::NewTexture  |  ( |  void  |   | ) |   const
protectedpure virtual