Public Member Functions | List of all members
CRhRdkTexturedContentField Class Reference
RDK
#include <RhRdkContentField.h>
 Inheritance diagram for CRhRdkTexturedContentField:
 Public Member Functions
CRhRdkTexturedContentField (CRhRdkContent &c, const wchar_t *wszInternalName, const wchar_t *wszLocalName, const wchar_t *wszEnglishName, Filter setFilter=All, Filter getFilter=All, int sectionId=0, bool bDynamic=false, const CRhRdkVariant &vTextureOn=false, const CRhRdkVariant &vTextureAmount=100, const CRhRdkVariant &vTextureAmountMin=0, const CRhRdkVariant &vTextureAmountMax=100, INT_PTR reserved=0)
CRhRdkTexturedContentField (const CRhRdkTexturedContentField &f)
virtual  | ~CRhRdkTexturedContentField ()
virtual CRhRdkContentField *  | MakeCopy (CRhRdkContent &) const override
void  | SetTextureAmount (int iAmount)
void  | SetTextureAmountMax (int iAmountMax)
void  | SetTextureAmountMin (int iAmountMin)
void  | SetTextureOn (bool bOn)
int  | TextureAmount (void) const
int  | TextureAmountMax (void) const
int  | TextureAmountMin (void) const
bool  | TextureOn (void) const
bool  | UseTextureAmount (void) const
bool  | UseTextureAmountMax (void) const
bool  | UseTextureAmountMin (void) const
bool  | UseTextureOn (void) const
 Public Member Functions inherited from CRhRdkContentField
CRhRdkContentField (CRhRdkContent &c, const wchar_t *wszInternalName, const wchar_t *wszFriendlyName, eFilter setFilter=All, eFilter getFilter=All, INT_PTR reserved=0)
CRhRdkContentField (CRhRdkContent &c, const wchar_t *wszInternalName, const wchar_t *wszLocalName, const wchar_t *wszEnglishName, Filter setFilter=All, Filter getFilter=All, int sectionId=0, bool bDynamic=false, INT_PTR reserved=0)
virtual  | ~CRhRdkContentField ()
const void *  | AsBuffer (size_t &sizeOut) const
void *  | AsPointer (void) const
virtual CRhRdkContent &  | Content (void) const
virtual UINT  | Conversion (void) const
virtual CRhRdkVariant  | ConvertFromDisplay (const CRhRdkVariant &v) const
virtual CRhRdkVariant  | ConvertToDisplay (const CRhRdkVariant &v) const
virtual ON_wString  | EnglishName (void) const
virtual void *  | EVF (const wchar_t *, void *)
virtual RDK_DEPRECATED ON_wString  | FriendlyName (void) const
virtual Filter  | GetFilter (void) const
virtual bool  | GetLimits (CRhRdkVariant &vMin, CRhRdkVariant &vMax) const
virtual void  | GetValueFromSection (const IRhRdk_XMLSection &section)
void  | Initialize (const CRhRdkVariant &v)
virtual ON_wString  | InternalName (void) const
bool  | IsDynamic (void) const
virtual ON_wString  | LocalName (void) const
operator bool (void) const
operator const wchar_t * (void) const
operator CRhRdkColor (void) const
operator CRhRdkVariant (void) const
operator double (void) const
operator float (void) const
operator int (void) const
operator ON_2dVector (void) const
operator ON_3dVector (void) const
operator ON_4dPoint (void) const
operator ON_Color (void) const
operator ON_Xform (void) const
operator time_t (void) const
operator UUID (void) const
bool  | operator!= (const CRhRdkContentField &v) const
bool  | operator< (const CRhRdkContentField &v) const
const CRhRdkContentField &  | operator= (const CRhRdkContentField &f)
const CRhRdkContentField &  | operator= (int i)
const CRhRdkContentField &  | operator= (bool b)
const CRhRdkContentField &  | operator= (float f)
const CRhRdkContentField &  | operator= (double d)
const CRhRdkContentField &  | operator= (const char *sz)
const CRhRdkContentField &  | operator= (const wchar_t *wsz)
const CRhRdkContentField &  | operator= (const ON_Color &c)
const CRhRdkContentField &  | operator= (const ON_2dVector &v)
const CRhRdkContentField &  | operator= (const ON_3dVector &v)
const CRhRdkContentField &  | operator= (const ON_4dPoint &p)
const CRhRdkContentField &  | operator= (void *p)
const CRhRdkContentField &  | operator= (const UUID &uuid)
const CRhRdkContentField &  | operator= (const ON_Xform &xform)
const CRhRdkContentField &  | operator= (const time_t &time)
const CRhRdkContentField &  | operator= (const CRhRdkVariant &v)
bool  | operator== (const CRhRdkContentField &v) const
bool  | operator> (const CRhRdkContentField &v) const
virtual int  | SectionId (void) const
virtual void  | SetConversion (UINT uFlags)
virtual Filter  | SetFilter (void) const
virtual bool  | SetLimits (const CRhRdkVariant &vMin, const CRhRdkVariant &vMax)
virtual RDK_DEPRECATED bool  | SetValue (const CRhRdkVariant &vNewValue, CRhRdkContent::eChangeContext cc)
virtual bool  | SetValue (const CRhRdkVariant &vNewValue)
virtual void  | SetValueToSection (IRhRdk_XMLSection &section) const
virtual ON_wString  | UndoString (void) const
virtual const CRhRdkVariant &  | Value (void) const
 Additional Inherited Members
 Public Types inherited from CRhRdkContentField
enum  | : unsigned int { conv_none = 0x0000, conv_percentile = 0x0001, conv_one_minus = 0x0002, conv_radians = 0x0004 }
typedef Filter  | eFilter
enum  | Filter : unsigned int {
 None = 0x00, Serialization = 0x01, Harvesting = 0x02, Rendering = 0x04,
 All = 0xFF
 }
Constructor & Destructor Documentation
◆ CRhRdkTexturedContentField() [1/2]
 CRhRdkTexturedContentField::CRhRdkTexturedContentField  |  ( |  CRhRdkContent &  |  c,
|  const wchar_t *  |  wszInternalName,
|  const wchar_t *  |  wszLocalName,
|  const wchar_t *  |  wszEnglishName,
|  Filter  |  setFilter = All,
|  Filter  |  getFilter = All,
|  int  |  sectionId = 0,
|  bool  |  bDynamic = false,
|  const CRhRdkVariant &  |  vTextureOn = false,
|  const CRhRdkVariant &  |  vTextureAmount = 100,
|  const CRhRdkVariant &  |  vTextureAmountMin = 0,
|  const CRhRdkVariant &  |  vTextureAmountMax = 100,
|  INT_PTR  |  reserved = 0
)
Textured fields are always constructed the same way. After construction they are null and must be initialized to a type/value before use by calling the Initialize() method.
Parameters
c | is the content that the field belongs to.
wszInternalName | is the internal name of the field. Not localized.
wszLocalName | is the localized user-friendly name of the field.
wszEnglishName | is the English user-friendly name of the field.
setFilter | is a filter for use during CRhRdkContentFields::SetValuesToSection(). The field is skipped if setFilter does not match at least one item in the call's filter.
getFilter | is a filter for use during CRhRdkContentFields::GetValuesFromSection(). The field is skipped if getFilter does not match at least one item in the call's filter.
sectionId | is the id of an automatic section. This is optional and should be zero if not required. It allows field UI controls to automatically be distributed among automatic UI sections.
bDynamic | indicates that this field is dynamic.
See also
IsDynamic()
Parameters
vTextureOn | is the initial 'on' state. Use vtNull if not required.
vTextureAmount | is the initial amount. Use vtNull if not required.
vTextureAmountMin | is the amount lower limit. Use vtNull if not required.
vTextureAmountMax | is the amount upper limit. Use vtNull if not required.
reserved | is reserved for future use. Must be zero.
◆ CRhRdkTexturedContentField() [2/2]
 CRhRdkTexturedContentField::CRhRdkTexturedContentField  |  ( |  const CRhRdkTexturedContentField &  |  f | )
◆ ~CRhRdkTexturedContentField()
 virtual CRhRdkTexturedContentField::~CRhRdkTexturedContentField  |  ( |   | )
virtual
Member Function Documentation
◆ MakeCopy()
 virtual CRhRdkContentField* CRhRdkTexturedContentField::MakeCopy  |  ( |  CRhRdkContent &  |   | ) |   const
overridevirtual
Return an exact copy of this field, with the same value and type.
Reimplemented from CRhRdkContentField.
◆ SetTextureAmount()
 void CRhRdkTexturedContentField::SetTextureAmount  |  ( |  int  |  iAmount | )
Set the texture amount.
◆ SetTextureAmountMax()
 void CRhRdkTexturedContentField::SetTextureAmountMax  |  ( |  int  |  iAmountMax | )
Set the maximum texture amount.
◆ SetTextureAmountMin()
 void CRhRdkTexturedContentField::SetTextureAmountMin  |  ( |  int  |  iAmountMin | )
Set the minimum texture amount.
◆ SetTextureOn()
 void CRhRdkTexturedContentField::SetTextureOn  |  ( |  bool  |  bOn | )
Turns the texture on or off.
◆ TextureAmount()
 int CRhRdkTexturedContentField::TextureAmount  |  ( |  void  |   | ) |   const
Returns
The texture amount. The default range is 0 to 100.
◆ TextureAmountMax()
 int CRhRdkTexturedContentField::TextureAmountMax  |  ( |  void  |   | ) |   const
Returns
The maximum texture amount. The default is 100.
◆ TextureAmountMin()
 int CRhRdkTexturedContentField::TextureAmountMin  |  ( |  void  |   | ) |   const
Returns
The minimum texture amount. The default is 0.
◆ TextureOn()
 bool CRhRdkTexturedContentField::TextureOn  |  ( |  void  |   | ) |   const
Returns
true if the texture is turned on, else false.
◆ UseTextureAmount()
 bool CRhRdkTexturedContentField::UseTextureAmount  |  ( |  void  |   | ) |   const
Returns
true if 'texture amount' is in use, else false.
◆ UseTextureAmountMax()
 bool CRhRdkTexturedContentField::UseTextureAmountMax  |  ( |  void  |   | ) |   const
Returns
true if 'texture amount max' is in use, else false.
◆ UseTextureAmountMin()
 bool CRhRdkTexturedContentField::UseTextureAmountMin  |  ( |  void  |   | ) |   const
Returns
true if 'texture amount min' is in use, else false.
◆ UseTextureOn()
 bool CRhRdkTexturedContentField::UseTextureOn  |  ( |  void  |   | ) |   const
Returns
true if 'texture on' is in use, else false.