Public Member Functions | List of all members
CRhRdkDecalWrapper Class Referencefinal
RDK
#include <RhRdkUiSdk.h>
 Public Member Functions
CRhRdkDecalWrapper (const CRhinoObject &obj)
CRhRdkDecalWrapper (const CRhinoObject &obj, RDK_DECAL_CRC decalCRC)
CRhRdkDecalWrapper (unsigned int doc_sn, const UUID &uuidObject, const UUID &uuidDecal)
~CRhRdkDecalWrapper ()
void  | ApplyTransformation (const ON_Xform &xform)
RDK_DECAL_CRC  | CRC (void) const
bool  | CullIdenticalDecals (void)
const IRhRdk_XMLSection *  | CustomData (void) const
UUID  | DecalInstanceId (void) const
void  | Delete (void) const
RDK_DECAL_CRC  | FindDecalCRC (const UUID &uuidInstance) const
const IRhRdkDecal *  | GetDecal (void) const
void  | GetDecalCRCList (CRhRdkDecalCRCList &listOut) const
const IRhRdkDecal *  | GetDecalForCRC (RDK_DECAL_CRC decalCRC) const
void  | GetHorzSweep (double &sta, double &end) const
void  | GetVertSweep (double &sta, double &end) const
bool  | HasValidDecal (void) const
bool  | HasValidObject (void) const
double  | Height (void) const
bool  | IsValid (void) const
IRhRdkDecal::eMapping  | Mapping (void) const
bool  | MapToInside (void) const
void  | Move (RDK_DECAL_CRC crcTo) const
ON_3dPoint  | Origin (void) const
IRhRdkDecal::eProjection  | Projection (void) const
double  | Radius (void) const
bool  | RemoveValue (const wchar_t *wsz) const
void  | SendModifiedEvent (RDK_DECAL_CRC old_decal_crc) const
void  | SetCustomData (const IRhRdk_XMLSection &section)
void  | SetHeight (double dHeight)
void  | SetHorzSweep (double sta, double end)
void  | SetMapping (IRhRdkDecal::eMapping m)
void  | SetMapToInside (bool b)
void  | SetOrigin (const ON_3dPoint &pt)
void  | SetProjection (IRhRdkDecal::eProjection p)
void  | SetRadius (double dRadius)
void  | SetTextureInstanceId (const UUID &uuidInstance)
void  | SetTransparency (double d)
void  | SetTriggerModifiedEvents (bool bTriggerModifiedEvents)
void  | SetUVBounds (double dMinU, double dMinV, double dMaxU, double dMaxV)
void  | SetVectorAcross (const ON_3dVector &vec)
void  | SetVectorUp (const ON_3dVector &vec)
void  | SetVertSweep (double sta, double end)
UUID  | TextureInstanceId (void) const
const ON_TextureMapping *  | TextureMapping (void) const
CRhRdkTexture::ProjectionModes  | TextureProjectionMode (void) const
double  | Transparency (void) const
void  | UVBounds (double &dMinUOut, double &dMinVOut, double &dMaxUOut, double &dMaxVOut) const
ON_3dVector  | VectorAcross (void) const
ON_3dVector  | VectorUp (void) const
Constructor & Destructor Documentation
◆ CRhRdkDecalWrapper() [1/3]
 CRhRdkDecalWrapper::CRhRdkDecalWrapper  |  ( |  const CRhinoObject &  |  obj | )
◆ CRhRdkDecalWrapper() [2/3]
 CRhRdkDecalWrapper::CRhRdkDecalWrapper  |  ( |  const CRhinoObject &  |  obj,
|  RDK_DECAL_CRC  |  decalCRC
)
◆ CRhRdkDecalWrapper() [3/3]
 CRhRdkDecalWrapper::CRhRdkDecalWrapper  |  ( |  unsigned int  |  doc_sn,
|  const UUID &  |  uuidObject,
|  const UUID &  |  uuidDecal
)
◆ ~CRhRdkDecalWrapper()
 CRhRdkDecalWrapper::~CRhRdkDecalWrapper  |  ( |   | )
Member Function Documentation
◆ ApplyTransformation()
 void CRhRdkDecalWrapper::ApplyTransformation  |  ( |  const ON_Xform &  |  xform | )
◆ CRC()
 RDK_DECAL_CRC CRhRdkDecalWrapper::CRC  |  ( |  void  |   | ) |   const
◆ CullIdenticalDecals()
 bool CRhRdkDecalWrapper::CullIdenticalDecals  |  ( |  void  |   | )
◆ CustomData()
 const IRhRdk_XMLSection* CRhRdkDecalWrapper::CustomData  |  ( |  void  |   | ) |   const
◆ DecalInstanceId()
 UUID CRhRdkDecalWrapper::DecalInstanceId  |  ( |  void  |   | ) |   const
◆ Delete()
 void CRhRdkDecalWrapper::Delete  |  ( |  void  |   | ) |   const
◆ FindDecalCRC()
 RDK_DECAL_CRC CRhRdkDecalWrapper::FindDecalCRC  |  ( |  const UUID &  |  uuidInstance | ) |   const
◆ GetDecal()
 const IRhRdkDecal* CRhRdkDecalWrapper::GetDecal  |  ( |  void  |   | ) |   const
◆ GetDecalCRCList()
 void CRhRdkDecalWrapper::GetDecalCRCList  |  ( |  CRhRdkDecalCRCList &  |  listOut | ) |   const
◆ GetDecalForCRC()
 const IRhRdkDecal* CRhRdkDecalWrapper::GetDecalForCRC  |  ( |  RDK_DECAL_CRC  |  decalCRC | ) |   const
Replaces any wrapped decal with a new one for the decalCRC.
◆ GetHorzSweep()
 void CRhRdkDecalWrapper::GetHorzSweep  |  ( |  double &  |  sta,
|  double &  |  end
) |   |  const
◆ GetVertSweep()
 void CRhRdkDecalWrapper::GetVertSweep  |  ( |  double &  |  sta,
|  double &  |  end
) |   |  const
◆ HasValidDecal()
 bool CRhRdkDecalWrapper::HasValidDecal  |  ( |  void  |   | ) |   const
◆ HasValidObject()
 bool CRhRdkDecalWrapper::HasValidObject  |  ( |  void  |   | ) |   const
◆ Height()
 double CRhRdkDecalWrapper::Height  |  ( |  void  |   | ) |   const
◆ IsValid()
 bool CRhRdkDecalWrapper::IsValid  |  ( |  void  |   | ) |   const
◆ Mapping()
 IRhRdkDecal::eMapping CRhRdkDecalWrapper::Mapping  |  ( |  void  |   | ) |   const
◆ MapToInside()
 bool CRhRdkDecalWrapper::MapToInside  |  ( |  void  |   | ) |   const
◆ Move()
 void CRhRdkDecalWrapper::Move  |  ( |  RDK_DECAL_CRC  |  crcTo | ) |   const
◆ Origin()
 ON_3dPoint CRhRdkDecalWrapper::Origin  |  ( |  void  |   | ) |   const
◆ Projection()
 IRhRdkDecal::eProjection CRhRdkDecalWrapper::Projection  |  ( |  void  |   | ) |   const
◆ Radius()
 double CRhRdkDecalWrapper::Radius  |  ( |  void  |   | ) |   const
◆ RemoveValue()
 bool CRhRdkDecalWrapper::RemoveValue  |  ( |  const wchar_t *  |  wsz | ) |   const
◆ SendModifiedEvent()
 void CRhRdkDecalWrapper::SendModifiedEvent  |  ( |  RDK_DECAL_CRC  |  old_decal_crc | ) |   const
◆ SetCustomData()
 void CRhRdkDecalWrapper::SetCustomData  |  ( |  const IRhRdk_XMLSection &  |  section | )
◆ SetHeight()
 void CRhRdkDecalWrapper::SetHeight  |  ( |  double  |  dHeight | )
◆ SetHorzSweep()
 void CRhRdkDecalWrapper::SetHorzSweep  |  ( |  double  |  sta,
|  double  |  end
)
◆ SetMapping()
 void CRhRdkDecalWrapper::SetMapping  |  ( |  IRhRdkDecal::eMapping  |  m | )
◆ SetMapToInside()
 void CRhRdkDecalWrapper::SetMapToInside  |  ( |  bool  |  b | )
◆ SetOrigin()
 void CRhRdkDecalWrapper::SetOrigin  |  ( |  const ON_3dPoint &  |  pt | )
◆ SetProjection()
 void CRhRdkDecalWrapper::SetProjection  |  ( |  IRhRdkDecal::eProjection  |  p | )
◆ SetRadius()
 void CRhRdkDecalWrapper::SetRadius  |  ( |  double  |  dRadius | )
◆ SetTextureInstanceId()
 void CRhRdkDecalWrapper::SetTextureInstanceId  |  ( |  const UUID &  |  uuidInstance | )
◆ SetTransparency()
 void CRhRdkDecalWrapper::SetTransparency  |  ( |  double  |  d | )
◆ SetTriggerModifiedEvents()
 void CRhRdkDecalWrapper::SetTriggerModifiedEvents  |  ( |  bool  |  bTriggerModifiedEvents | )
◆ SetUVBounds()
 void CRhRdkDecalWrapper::SetUVBounds  |  ( |  double  |  dMinU,
|  double  |  dMinV,
|  double  |  dMaxU,
|  double  |  dMaxV
)
◆ SetVectorAcross()
 void CRhRdkDecalWrapper::SetVectorAcross  |  ( |  const ON_3dVector &  |  vec | )
◆ SetVectorUp()
 void CRhRdkDecalWrapper::SetVectorUp  |  ( |  const ON_3dVector &  |  vec | )
◆ SetVertSweep()
 void CRhRdkDecalWrapper::SetVertSweep  |  ( |  double  |  sta,
|  double  |  end
)
◆ TextureInstanceId()
 UUID CRhRdkDecalWrapper::TextureInstanceId  |  ( |  void  |   | ) |   const
◆ TextureMapping()
 const ON_TextureMapping* CRhRdkDecalWrapper::TextureMapping  |  ( |  void  |   | ) |   const
◆ TextureProjectionMode()
 CRhRdkTexture::ProjectionModes CRhRdkDecalWrapper::TextureProjectionMode  |  ( |  void  |   | ) |   const
◆ Transparency()
 double CRhRdkDecalWrapper::Transparency  |  ( |  void  |   | ) |   const
◆ UVBounds()
 void CRhRdkDecalWrapper::UVBounds  |  ( |  double &  |  dMinUOut,
|  double &  |  dMinVOut,
|  double &  |  dMaxUOut,
|  double &  |  dMaxVOut
) |   |  const
◆ VectorAcross()
 ON_3dVector CRhRdkDecalWrapper::VectorAcross  |  ( |  void  |   | ) |   const
◆ VectorUp()
 ON_3dVector CRhRdkDecalWrapper::VectorUp  |  ( |  void  |   | ) |   const