Public Member Functions | Friends | List of all members
CRhinoDocProperties Class Reference
Rhino
#include <rhinoSdkDocProperties.h>
 Public Member Functions
CRhinoDocProperties ()
virtual  | ~CRhinoDocProperties ()
int  | AddNamedConstructionPlane (const ON_3dmConstructionPlane &named_cplane)
int  | AddNamedView (const ON_3dmView &named_view)
ON_Color  | AmbientLightColor (bool from_doc=false) const
const ON_MeshParameters &  | AnalysisMeshSettings () const
settings used for automatically created analysis meshes More...
bool  | AnimatedSunAtFrame (const ON_3dmAnimationProperties &ap, int iFrame, ON_Light &sun)
bool  | AnimatedViewAtFrame (const ON_3dmAnimationProperties &ap, int iFrame, ON_Viewport &vp)
const ON_3dmAnimationProperties &  | AnimationProperties ()
ON_Color  | BackgroundColor (bool from_doc=false) const
ON_Color  | CurrentColor () const
ON::object_color_source  | CurrentColorSource () const
const ON::object_material_source  | CurrentMaterialSource () const
TODO: ?Are these handled in CRhinoDoc? More...
int  | CurrentWireDensity () const
const ON_MeshParameters &  | CustomRenderMeshSettings () const
void  | Default ()
bool  | DeleteSnapshot (const wchar_t *wszName)
bool  | DisplayCurvesAndIsocurvesInRenderedViews (bool from_doc=false) const
bool  | DisplayTextAndDimensionsInRenderedViews (bool from_doc=false) const
CRhinoDoc *  | Doc ()
ON_EarthAnchorPoint  | EarthAnchorPoint () const
void  | EnableHatchScaling (bool b=true)
void  | EnableLayoutSpaceAnnotationScaling (bool b=true)
void  | EnableModelSpaceAnnotationScaling (bool b=true)
CRhinoAnnotationSettingsEx  | GetAnnotationSettings () const
void  | GetCurrentSettings (ON_3dmSettings &settings) const
void  | GetCustomRenderSizes (ON_SimpleArray< ON_2iSize > &sizes)
BOOL  | GetON_3dmAnnotationSettings (ON_3dmAnnotationSettings &settings) const
const ON_3dmConstructionPlaneGridDefaults &  | GridDefaults () const
default settings for construction plane grids More...
ON_3dmIOSettings  | IOSettings () const
bool  | IsHatchScalingEnabled () const
bool  | IsLayoutSpaceAnnotationScalingEnabled () const
bool  | IsModelSpaceAnnotationScalingEnabled () const
[Lowell - 3-28-2017] These are 2 new fields to replace the one previously used More...
const ON_MeshParameters &  | MeshParameters (ON_MeshParameters::MESH_STYLE mesh_style) const
ON_3dPoint  | ModelBasepoint () const
const wchar_t *  | ModelName () const
const ON_UnitSystem &  | ModelUnits () const
model space tolerances and unit system More...
const ON_3dmUnitsAndTolerances &  | ModelUnitsAndTolerances () const
const wchar_t *  | ModelURL ()
const ON_3dmConstructionPlane *  | NamedConstructionPlane (int) const
const ON_3dmConstructionPlane *  | NamedConstructionPlane (const wchar_t *name) const
const ON_3dmView* View( int) const; More...
int  | NamedConstructionPlaneIndex (const ON_3dmConstructionPlane *cplane) const
const ON_3dmView *  | NamedView (int) const
const ON_3dmView *  | NamedView (const wchar_t *name) const
int  | NamedViewIndex (const ON_3dmView *view) const
const ON_3dmNotes &  | Notes () const
const ON_UnitSystem &  | PageUnits () const
page space tolerances and unit system More...
const ON_3dmUnitsAndTolerances &  | PageUnitsAndTolerances () const
BOOL  | RemoveNamedConstructionPlane (int cplane_index)
BOOL  | RemoveNamedView (int view_index)
bool  | RenameSnapshot (const wchar_t *wszNameOld, const wchar_t *wszNameNew)
const ON_MeshParameters &  | RenderMeshParameters () const
const ON_MeshParameters &  | RenderMeshSettings () const
ON_MeshParameters::MESH_STYLE  | RenderMeshStyle () const
const ON_3dmRenderSettings &  | RenderSettings () const
bool  | RestoreSnapshot (const wchar_t *wszName, const ON_SimpleArray< UUID > &aClients, bool bSkipAnimation, bool bSkipUnsavedModelWarning)
bool  | RestoreSnapshot (const wchar_t *wszName, bool bSkipAnimation, bool bSkipUnsavedModelWarning)
const ON_3dmRevisionHistory &  | RevisionHistory () const
class CRhRuntimeSettings *  | RuntimeSettings ()
bool  | SaveSnapshot (const wchar_t *wszName)
bool  | SaveSnapshot (const wchar_t *wszName, const ON_SimpleArray< UUID > &aClients)
void  | SetAnalysisMeshSettings (const ON_MeshParameters &)
void  | SetAnimationProperties (const ON_3dmAnimationProperties &ap)
void  | SetAnnotationSettings (const CRhinoAnnotationSettingsEx &as)
ON_Color  | SetCurrentColor (ON_Color)
ON::object_color_source  | SetCurrentColorSource (ON::object_color_source)
ON::object_material_source  | SetCurrentMaterialSource (ON::object_material_source)
int  | SetCurrentWireDensity (int)
void  | SetCustomRenderMeshParameters (const ON_MeshParameters &customer_render_mesh_parameters)
void  | SetCustomRenderMeshSettings (const ON_MeshParameters &)
void  | SetEarthAnchorPoint (ON_EarthAnchorPoint earth_anchor_point)
void  | SetFromSettings (const ON_3dmSettings &settings)
void  | SetGridDefaults (const ON_3dmConstructionPlaneGridDefaults &)
void  | SetIOSettings (ON_3dmIOSettings io_settings)
void  | SetModelBasepoint (ON_3dPoint model_basepoint)
void  | SetModelUnitsAndTolerances (const ON_3dmUnitsAndTolerances &u_and_t, bool bScaleModelObjects=false)
void  | SetModelURL (const wchar_t *)
void  | SetNotes (const ON_3dmNotes &)
void  | SetPageUnitsAndTolerances (const ON_3dmUnitsAndTolerances &u_and_t, bool bScalePaperObject=false)
void  | SetRenderMeshSettings (const ON_MeshParameters &)
void  | SetRenderMeshStyle (ON_MeshParameters::MESH_STYLE render_mesh_style)
void  | SetRenderSettings (const ON_3dmRenderSettings &)
void  | SetRevisionHistory (const ON_3dmRevisionHistory &)
void  | SetUnitsAndTolerances (const ON_3dmUnitsAndTolerances &u_and_t, bool bScaleModelObjects=false)
OBSOLETE - use SetModelUnitsAndTolerances. More...
bool  | SnapshotAt (int iIndex, ON_wString &sName) const
unsigned int  | SnapshotCount (void) const
bool  | SnapshotLookUp (const wchar_t *wszName) const
void  | SnapshotNames (ON_ClassArray< ON_wString > &aNames) const
bool  | SnapshotsClientAt (int iIndex, ON_UUID &id, ON_wString &sName) const
bool  | SnapshotsClientCategory (const ON_UUID &id, ON_wString &sCategory) const
unsigned int  | SnapshotsClientCount (void) const
bool  | SnapshotsClientName (const ON_UUID &id, ON_wString &sName) const
bool  | SnapshotsClients (const wchar_t *wszName, ON_SimpleArray< UUID > &aClients) const
bool  | SnapshotsDeleteTemporarySave (const ON_UUID &id)
bool  | SnapshotsEnableClient (const wchar_t *wszName, const UUID &idClient, bool bEnable)
bool  | SnapshotsEnableClientForPartialRestore (const wchar_t *wszName, const UUID &idClient, bool bEnable)
bool  | SnapshotsGetView (const wchar_t *wszName, ON_3dmView &view) const
bool  | SnapshotsIsClientEnabled (const wchar_t *wszName, const UUID &idClient, bool &bEnabled) const
bool  | SnapshotsIsClientEnabledForPartialRestore (const wchar_t *wszName, const UUID &idClient, bool &bEnabled) const
bool  | SnapshotsTemporaryRestore (const ON_UUID &id)
bool  | SnapshotsTemporarySave (ON_UUID &id)
const ON_3dmUnitsAndTolerances &  | UnitsAndTolerances () const
OBSOLETE - use ModelUnitsAndTolerances. More...
bool  | UseHiddenLightsInRenderedViews (bool from_doc=false) const
 Friends
class  | CRhinoDoc
class  | CRhNamedViewCameraIcon
Constructor & Destructor Documentation
◆ CRhinoDocProperties()
 CRhinoDocProperties::CRhinoDocProperties  |  ( |   | )
◆ ~CRhinoDocProperties()
 virtual CRhinoDocProperties::~CRhinoDocProperties  |  ( |   | )
virtual
Member Function Documentation
◆ AddNamedConstructionPlane()
 int CRhinoDocProperties::AddNamedConstructionPlane  |  ( |  const ON_3dmConstructionPlane &  |  named_cplane | )
Description: Add named construction plane to document. Paramters: name_cplane - [in] Remarks: If named_cplane has an empty name, a unique name is automatically created. If there is already a named onstruction plane with the same name, that construction plane is replaced. Returns: >= 0 : success 0 based index of named construction plane. -1 : failure invalid plane See Also: CRhinoDocProperties::NamedConstructionPlane
◆ AddNamedView()
 int CRhinoDocProperties::AddNamedView  |  ( |  const ON_3dmView &  |  named_view | )
Description: Add named construction plane to document. Paramters: named_view - [in] Remarks: If named_view has an empty name, a unique name is automatically created. If there is already a named view with the same name, that view is replaced. See Also: CRhinoDocProperties::NamedView Returns: >= 0 : success 0 based index of named view. -1 : failure invalid plane
◆ AmbientLightColor()
 ON_Color CRhinoDocProperties::AmbientLightColor  |  ( |  bool  |  from_doc = false | ) |   const
◆ AnalysisMeshSettings()
 const ON_MeshParameters& CRhinoDocProperties::AnalysisMeshSettings  |  ( |   | ) |   const
settings used for automatically created analysis meshes
◆ AnimatedSunAtFrame()
 bool CRhinoDocProperties::AnimatedSunAtFrame  |  ( |  const ON_3dmAnimationProperties &  |  ap,
|  int  |  iFrame,
|  ON_Light &  |  sun
)
◆ AnimatedViewAtFrame()
 bool CRhinoDocProperties::AnimatedViewAtFrame  |  ( |  const ON_3dmAnimationProperties &  |  ap,
|  int  |  iFrame,
|  ON_Viewport &  |  vp
)
◆ AnimationProperties()
 const ON_3dmAnimationProperties& CRhinoDocProperties::AnimationProperties  |  ( |   | )
◆ BackgroundColor()
 ON_Color CRhinoDocProperties::BackgroundColor  |  ( |  bool  |  from_doc = false | ) |   const
◆ CurrentColor()
 ON_Color CRhinoDocProperties::CurrentColor  |  ( |   | ) |   const
◆ CurrentColorSource()
 ON::object_color_source CRhinoDocProperties::CurrentColorSource  |  ( |   | ) |   const
◆ CurrentMaterialSource()
 const ON::object_material_source CRhinoDocProperties::CurrentMaterialSource  |  ( |   | ) |   const
TODO: ?Are these handled in CRhinoDoc?
The following functions set/get values. The set functions return the previous value on success otherwise -1 int CurrentLayerIndex() const; int SetCurrentLayerIndex( int);
int CurrentMaterialIndex() const; int SetCurrentMaterialIndex( int);
◆ CurrentWireDensity()
 int CRhinoDocProperties::CurrentWireDensity  |  ( |   | ) |   const
line style if ON::line_style_from_object == LineStyleSource() OBSOLETE 17 March 2005 Dale Lear - const ON_LineStyle& CurrentLineStyle() const; OBSOLETE 17 March 2005 Dale Lear - ON_LineStyle SetCurrentLineStyle( const ON_LineStyle&); OBSOLETE 17 March 2005 Dale Lear - const ON::object_line_style_source CurrentLineStyleSource() const; OBSOLETE 17 March 2005 Dale Lear - ON::object_line_style_source SetCurrentLineStyleSource( ON::object_line_style_source);
◆ CustomRenderMeshSettings()
 const ON_MeshParameters& CRhinoDocProperties::CustomRenderMeshSettings  |  ( |   | ) |   const
◆ Default()
 void CRhinoDocProperties::Default  |  ( |   | )
◆ DeleteSnapshot()
 bool CRhinoDocProperties::DeleteSnapshot  |  ( |  const wchar_t *  |  wszName | )
Description: Deletes the specified snapshot. Parameters: wszName - [In] Name of the snapshot. Returns: True or false depending if the deleting succeeded.
◆ DisplayCurvesAndIsocurvesInRenderedViews()
 bool CRhinoDocProperties::DisplayCurvesAndIsocurvesInRenderedViews  |  ( |  bool  |  from_doc = false | ) |   const
Rendered view display mode settings If from_doc == true then values are always returned from CRhinoDocProperties otherwise CRhinoAppSettings::GetRenderedViewSettingsFromDoc() determines where the values are returned from.
◆ DisplayTextAndDimensionsInRenderedViews()
 bool CRhinoDocProperties::DisplayTextAndDimensionsInRenderedViews  |  ( |  bool  |  from_doc = false | ) |   const
◆ Doc()
 CRhinoDoc* CRhinoDocProperties::Doc  |  ( |   | )
inline
◆ EarthAnchorPoint()
 ON_EarthAnchorPoint CRhinoDocProperties::EarthAnchorPoint  |  ( |   | ) |   const
◆ EnableHatchScaling()
 void CRhinoDocProperties::EnableHatchScaling  |  ( |  bool  |  b = true | )
◆ EnableLayoutSpaceAnnotationScaling()
 void CRhinoDocProperties::EnableLayoutSpaceAnnotationScaling  |  ( |  bool  |  b = true | )
◆ EnableModelSpaceAnnotationScaling()
 void CRhinoDocProperties::EnableModelSpaceAnnotationScaling  |  ( |  bool  |  b = true | )
◆ GetAnnotationSettings()
 CRhinoAnnotationSettingsEx CRhinoDocProperties::GetAnnotationSettings  |  ( |   | ) |   const
settings used when annotation objects are created Deprecated 27 Aug 2010 - Lowell ON_DEPRECATED const CRhinoAnnotationSettings& AnnotationSettings() const; ON_DEPRECATED void SetAnnotationSettings( const CRhinoAnnotationSettings& as, BOOL bUpdateDims = TRUE); Settings having to do with model space / layout space scaling of dimensions and text Added 27 Aug, 2010
◆ GetCurrentSettings()
 void CRhinoDocProperties::GetCurrentSettings  |  ( |  ON_3dmSettings &  |  settings | ) |   const
Description: Fill in an ON_3dmSettings class with the values of the current document settings. Parameters: settings - [out] Remarks: To get and set individual settings, use the member functions below.
◆ GetCustomRenderSizes()
 void CRhinoDocProperties::GetCustomRenderSizes  |  ( |  ON_SimpleArray< ON_2iSize > &  |  sizes | )
◆ GetON_3dmAnnotationSettings()
 BOOL CRhinoDocProperties::GetON_3dmAnnotationSettings  |  ( |  ON_3dmAnnotationSettings &  |  settings | ) |   const
◆ GridDefaults()
 const ON_3dmConstructionPlaneGridDefaults& CRhinoDocProperties::GridDefaults  |  ( |   | ) |   const
default settings for construction plane grids
◆ IOSettings()
 ON_3dmIOSettings CRhinoDocProperties::IOSettings  |  ( |   | ) |   const
◆ IsHatchScalingEnabled()
 bool CRhinoDocProperties::IsHatchScalingEnabled  |  ( |   | ) |   const
◆ IsLayoutSpaceAnnotationScalingEnabled()
 bool CRhinoDocProperties::IsLayoutSpaceAnnotationScalingEnabled  |  ( |   | ) |   const
◆ IsModelSpaceAnnotationScalingEnabled()
 bool CRhinoDocProperties::IsModelSpaceAnnotationScalingEnabled  |  ( |   | ) |   const
[Lowell - 3-28-2017] These are 2 new fields to replace the one previously used
Interface for AnnotationScaling added 4 Nov, 2010 - Lowell Get current value of AnnotationScaling (CRhinoAnnotationSettingsEx) bool IsAnnotationScalingEnabled() const; void EnableAnnotationScaling(bool b = true);
◆ MeshParameters()
 const ON_MeshParameters& CRhinoDocProperties::MeshParameters  |  ( |  ON_MeshParameters::MESH_STYLE  |  mesh_style | ) |   const
Parameters: mesh_style - [in] ON_MeshParameters::MESH_STYLE enum value Returns: Meshing parameters to use to create the specified style of mesh.
◆ ModelBasepoint()
 ON_3dPoint CRhinoDocProperties::ModelBasepoint  |  ( |   | ) |   const
◆ ModelName()
 const wchar_t* CRhinoDocProperties::ModelName  |  ( |   | ) |   const
◆ ModelUnits()
 const ON_UnitSystem& CRhinoDocProperties::ModelUnits  |  ( |   | ) |   const
model space tolerances and unit system
◆ ModelUnitsAndTolerances()
 const ON_3dmUnitsAndTolerances& CRhinoDocProperties::ModelUnitsAndTolerances  |  ( |   | ) |   const
◆ ModelURL()
 const wchar_t* CRhinoDocProperties::ModelURL  |  ( |   | )
◆ NamedConstructionPlane() [1/2]
 const ON_3dmConstructionPlane* CRhinoDocProperties::NamedConstructionPlane  |  ( |  int  |   | ) |   const
The following functions take a zero based index into an array and return NULL if index is out of range.
◆ NamedConstructionPlane() [2/2]
 const ON_3dmConstructionPlane* CRhinoDocProperties::NamedConstructionPlane  |  ( |  const wchar_t *  |  name | ) |   const
const ON_3dmView* View( int) const;
Description: Find a named construction plane Paramters: name - [in] Returns: pointer to named construction plane See Also: CRhinoDocProperties::NamedConstructionPlane CRhinoDocProperties::NamedConstructionPlaneIndex CRhinoDocProperties::AddNamedConstructionPlane CRhinoDocProperties::RemoveNamedConstructionPlaneIndex
◆ NamedConstructionPlaneIndex()
 int CRhinoDocProperties::NamedConstructionPlaneIndex  |  ( |  const ON_3dmConstructionPlane *  |  cplane | ) |   const
Description: Get zero based index of named construction plane Paramters: cplane - [in] Returns: 0 based index of named construction plane or -1 if cplane is not one of documents named construction planes. See Also: CRhinoDocProperties::NamedConstructionPlane CRhinoDocProperties::NamedConstructionPlaneIndex CRhinoDocProperties::AddNamedConstructionPlane CRhinoDocProperties::RemoveNamedConstructionPlaneIndex
◆ NamedView() [1/2]
 const ON_3dmView* CRhinoDocProperties::NamedView  |  ( |  int  |   | ) |   const
◆ NamedView() [2/2]
 const ON_3dmView* CRhinoDocProperties::NamedView  |  ( |  const wchar_t *  |  name | ) |   const
Description: Find a named view Paramters: name - [in] Returns: pointer to named construction plane See Also: CRhinoDocProperties::NamedView CRhinoDocProperties::AddNamedView
◆ NamedViewIndex()
 int CRhinoDocProperties::NamedViewIndex  |  ( |  const ON_3dmView *  |  view | ) |   const
Description: Get zero based index of named view Paramters: view - [in] Returns: 0 based index of named view or -1 if view is not one of documents named views. See Also: CRhinoDocProperties::NamedView CRhinoDocProperties::NamedViewIndex CRhinoDocProperties::AddNamedView CRhinoDocProperties::RemoveNamedViewIndex
◆ Notes()
 const ON_3dmNotes& CRhinoDocProperties::Notes  |  ( |   | ) |   const
◆ PageUnits()
 const ON_UnitSystem& CRhinoDocProperties::PageUnits  |  ( |   | ) |   const
page space tolerances and unit system
◆ PageUnitsAndTolerances()
 const ON_3dmUnitsAndTolerances& CRhinoDocProperties::PageUnitsAndTolerances  |  ( |   | ) |   const
◆ RemoveNamedConstructionPlane()
 BOOL CRhinoDocProperties::RemoveNamedConstructionPlane  |  ( |  int  |  cplane_index | )
Description: Get zero based index of named construction plane Paramters: cplane_index - [in] Returns: TRUE if plane was removed. See Also: CRhinoDocProperties::NamedConstructionPlane CRhinoDocProperties::NamedConstructionPlaneIndex CRhinoDocProperties::AddNamedConstructionPlane CRhinoDocProperties::RemoveNamedConstructionPlaneIndex
◆ RemoveNamedView()
 BOOL CRhinoDocProperties::RemoveNamedView  |  ( |  int  |  view_index | )
Description: Get zero based index of named view Paramters: view_index - [in] Returns: TRUE if view was removed. See Also: CRhinoDocProperties::NamedView CRhinoDocProperties::NamedViewIndex CRhinoDocProperties::AddNamedView CRhinoDocProperties::RemoveNamedViewIndex
◆ RenameSnapshot()
 bool CRhinoDocProperties::RenameSnapshot  |  ( |  const wchar_t *  |  wszNameOld,
|  const wchar_t *  |  wszNameNew
)
Description: Renames the specified snapshot. Parameters: wszNameOld - [In] Current name of the snapshot. wszNameNew - [In] New name for the snapshot. Returns: True or false depending if the renaming succeeded.
◆ RenderMeshParameters()
 const ON_MeshParameters& CRhinoDocProperties::RenderMeshParameters  |  ( |   | ) |   const
Returns: Meshing parameters to use when creating a render mesh. = MeshParameters( RenderMeshStyle() );
◆ RenderMeshSettings()
 const ON_MeshParameters& CRhinoDocProperties::RenderMeshSettings  |  ( |   | ) |   const
◆ RenderMeshStyle()
 ON_MeshParameters::MESH_STYLE CRhinoDocProperties::RenderMeshStyle  |  ( |   | ) |   const
Returns: Style of render mesh that is created when objects like surface, breps, and extrusions need to be meshed for shaded display. ON_MeshParameters::render_mesh_fast = ON_MeshParameters::FastRenderMesh() ON_MeshParameters::render_mesh_quality = ON_MeshParameters::QualityRenderMesh() ON_MeshParameters::render_mesh_custom = CustomRenderMeshSettings().
◆ RenderSettings()
 const ON_3dmRenderSettings& CRhinoDocProperties::RenderSettings  |  ( |   | ) |   const
◆ RestoreSnapshot() [1/2]
 bool CRhinoDocProperties::RestoreSnapshot  |  ( |  const wchar_t *  |  wszName,
|  const ON_SimpleArray< UUID > &  |  aClients,
|  bool  |  bSkipAnimation,
|  bool  |  bSkipUnsavedModelWarning
)
Description: Restores the specified snapshot. Parameters: wszName - [In] Name of the snapshot. aClients - [In] Array of clients. bSkipAnimation - [In] Flag to enable/disable animation. bSkipUnsavedModelWarning - [In] Flag to enable/disable a message box that warns the user about unsaved data in the document. Returns: True or false depending if the restore succeeded.
◆ RestoreSnapshot() [2/2]
 bool CRhinoDocProperties::RestoreSnapshot  |  ( |  const wchar_t *  |  wszName,
|  bool  |  bSkipAnimation,
|  bool  |  bSkipUnsavedModelWarning
)
Description: Restores the specified snapshot. Parameters: wszName - [In] Name of the snapshot. bSkipAnimation - [In] Flag to enable/disable animation. bSkipUnsavedModelWarning - [In] Flag to enable/disable a message box that warns the user about unsaved data in the document. Returns: True or false depending if the restore succeeded.
◆ RevisionHistory()
 const ON_3dmRevisionHistory& CRhinoDocProperties::RevisionHistory  |  ( |   | ) |   const
Interface for accessing ON_3dmProperties
◆ RuntimeSettings()
 class CRhRuntimeSettings* CRhinoDocProperties::RuntimeSettings  |  ( |   | )
◆ SaveSnapshot() [1/2]
 bool CRhinoDocProperties::SaveSnapshot  |  ( |  const wchar_t *  |  wszName | )
Description: Saves a snapshot with all available clients. Parameters: wszName - [In] Name of the snapshot. Returns: True or false depending if the save succeeded.
◆ SaveSnapshot() [2/2]
 bool CRhinoDocProperties::SaveSnapshot  |  ( |  const wchar_t *  |  wszName,
|  const ON_SimpleArray< UUID > &  |  aClients
)
Description: Saves a snapshot with a selection of clients. Parameters: wszName - [In] Name of the snapshot. aClients - [In] IDs of enabled clients. Returns: True or false depending if the save succeeded.
◆ SetAnalysisMeshSettings()
 void CRhinoDocProperties::SetAnalysisMeshSettings  |  ( |  const ON_MeshParameters &  |   | )
◆ SetAnimationProperties()
 void CRhinoDocProperties::SetAnimationProperties  |  ( |  const ON_3dmAnimationProperties &  |  ap | )
◆ SetAnnotationSettings()
 void CRhinoDocProperties::SetAnnotationSettings  |  ( |  const CRhinoAnnotationSettingsEx &  |  as | )
◆ SetCurrentColor()
 ON_Color CRhinoDocProperties::SetCurrentColor  |  ( |  ON_Color  |   | )
◆ SetCurrentColorSource()
 ON::object_color_source CRhinoDocProperties::SetCurrentColorSource  |  ( |  ON::object_color_source  |   | )
◆ SetCurrentMaterialSource()
 ON::object_material_source CRhinoDocProperties::SetCurrentMaterialSource  |  ( |  ON::object_material_source  |   | )
◆ SetCurrentWireDensity()
 int CRhinoDocProperties::SetCurrentWireDensity  |  ( |  int  |   | )
◆ SetCustomRenderMeshParameters()
 void CRhinoDocProperties::SetCustomRenderMeshParameters  |  ( |  const ON_MeshParameters &  |  customer_render_mesh_parameters | )
Description: Set meshing parameters to use when the render mesh style is ON_MeshParameters::render_mesh_custom.
◆ SetCustomRenderMeshSettings()
 void CRhinoDocProperties::SetCustomRenderMeshSettings  |  ( |  const ON_MeshParameters &  |   | )
◆ SetEarthAnchorPoint()
 void CRhinoDocProperties::SetEarthAnchorPoint  |  ( |  ON_EarthAnchorPoint  |  earth_anchor_point | )
◆ SetFromSettings()
 void CRhinoDocProperties::SetFromSettings  |  ( |  const ON_3dmSettings &  |  settings | )
Remarks: These settings fields are ignored because they are specified elsewhere. settings.m_views CRhinoDoc::GetViewList settings.m_current_layer_index CRhinoDoc::m_layer_table settings.m_current_material_index CRhinoDoc::m_material_table settings.m_current_material_source CRhinoDoc::m_material_table
◆ SetGridDefaults()
 void CRhinoDocProperties::SetGridDefaults  |  ( |  const ON_3dmConstructionPlaneGridDefaults &  |   | )
◆ SetIOSettings()
 void CRhinoDocProperties::SetIOSettings  |  ( |  ON_3dmIOSettings  |  io_settings | )
◆ SetModelBasepoint()
 void CRhinoDocProperties::SetModelBasepoint  |  ( |  ON_3dPoint  |  model_basepoint | )
◆ SetModelUnitsAndTolerances()
 void CRhinoDocProperties::SetModelUnitsAndTolerances  |  ( |  const ON_3dmUnitsAndTolerances &  |  u_and_t,
|  bool  |  bScaleModelObjects = false
)
◆ SetModelURL()
 void CRhinoDocProperties::SetModelURL  |  ( |  const wchar_t *  |   | )
◆ SetNotes()
 void CRhinoDocProperties::SetNotes  |  ( |  const ON_3dmNotes &  |   | )
◆ SetPageUnitsAndTolerances()
 void CRhinoDocProperties::SetPageUnitsAndTolerances  |  ( |  const ON_3dmUnitsAndTolerances &  |  u_and_t,
|  bool  |  bScalePaperObject = false
)
◆ SetRenderMeshSettings()
 void CRhinoDocProperties::SetRenderMeshSettings  |  ( |  const ON_MeshParameters &  |   | )
◆ SetRenderMeshStyle()
 void CRhinoDocProperties::SetRenderMeshStyle  |  ( |  ON_MeshParameters::MESH_STYLE  |  render_mesh_style | )
Description: Set the style of render mesh to create when surfaces, breps and extrusions need to be meshed for shaded rendering. Parameters: render_mesh_style - [in] ON_MeshParameters::render_mesh_fast = ON_MeshParameters::FastRenderMesh() ON_MeshParameters::render_mesh_quality = ON_MeshParameters::QualityRenderMesh() ON_MeshParameters::render_mesh_custom = CustomRenderMeshSettings(). all other values are ignored
◆ SetRenderSettings()
 void CRhinoDocProperties::SetRenderSettings  |  ( |  const ON_3dmRenderSettings &  |   | )
◆ SetRevisionHistory()
 void CRhinoDocProperties::SetRevisionHistory  |  ( |  const ON_3dmRevisionHistory &  |   | )
◆ SetUnitsAndTolerances()
 void CRhinoDocProperties::SetUnitsAndTolerances  |  ( |  const ON_3dmUnitsAndTolerances &  |  u_and_t,
|  bool  |  bScaleModelObjects = false
)
OBSOLETE - use SetModelUnitsAndTolerances.
◆ SnapshotAt()
 bool CRhinoDocProperties::SnapshotAt  |  ( |  int  |  iIndex,
|  ON_wString &  |  sName
) |   |  const
Description: Gets the name of a snapshot at a specified index. Parameters: iIndex - [In] Zero based index of snapshot. sName - [Out] Name of the snapshot at given index. Returns: True or false depending if index available.
◆ SnapshotCount()
 unsigned int CRhinoDocProperties::SnapshotCount  |  ( |  void  |   | ) |   const
Description: Number of saved snapshots. Returns: Number of saved snapshots in the document.
◆ SnapshotLookUp()
 bool CRhinoDocProperties::SnapshotLookUp  |  ( |  const wchar_t *  |  wszName | ) |   const
Description: Snapshot lookup. Parameters: wszName - [In] Name of the snapshot. Returns: True or false depending if the snapshot exists in the document.
◆ SnapshotNames()
 void CRhinoDocProperties::SnapshotNames  |  ( |  ON_ClassArray< ON_wString > &  |  aNames | ) |   const
Description: Array of snapshot names in the document. Parameters: aNames - [Out] Array of snapshot names
◆ SnapshotsClientAt()
 bool CRhinoDocProperties::SnapshotsClientAt  |  ( |  int  |  iIndex,
|  ON_UUID &  |  id,
|  ON_wString &  |  sName
) |   |  const
Description: Gets the name and ID of a client at a specified index. Parameters: iIndex - [In] Zero based index of snapshot. sId - [Out] ID of the client at given index. sName - [Out] Name of the client at given index. Returns: True or false depending if function call is successful.
◆ SnapshotsClientCategory()
 bool CRhinoDocProperties::SnapshotsClientCategory  |  ( |  const ON_UUID &  |  id,
|  ON_wString &  |  sCategory
) |   |  const
Description: Gets the category of a client. Parameters: sId - [In] ID of the client. sCategory - [Out] Category of the client. Returns: True or false depending if function call is successful.
◆ SnapshotsClientCount()
 unsigned int CRhinoDocProperties::SnapshotsClientCount  |  ( |  void  |   | ) |   const
Description: Number of registered clients. Parameters: doc - [In] The active document. Returns: Number of registered clients.
◆ SnapshotsClientName()
 bool CRhinoDocProperties::SnapshotsClientName  |  ( |  const ON_UUID &  |  id,
|  ON_wString &  |  sName
) |   |  const
Description: Gets the name of a client. Parameters: sId - [In] ID of the client. sName - [Out] Name of the client. Returns: True or false depending if function call is successful.
◆ SnapshotsClients()
 bool CRhinoDocProperties::SnapshotsClients  |  ( |  const wchar_t *  |  wszName,
|  ON_SimpleArray< UUID > &  |  aClients
) |   |  const
Description: Gets the clients of a named snapshot. Parameters: wszName - [In] Name of the snapshot. aClients - [Out] Array of client. Returns: True or false depending if function call is successful.
◆ SnapshotsDeleteTemporarySave()
 bool CRhinoDocProperties::SnapshotsDeleteTemporarySave  |  ( |  const ON_UUID &  |  id | )
Description: Deletes a temporary stored snapshot. Parameters: id - [In] id of the snapshot. Returns: True or false depending if function call is successful.
◆ SnapshotsEnableClient()
 bool CRhinoDocProperties::SnapshotsEnableClient  |  ( |  const wchar_t *  |  wszName,
|  const UUID &  |  idClient,
|  bool  |  bEnable
)
Description: Sets the state of a client of a named snapshot. Parameters: wszName - [In] Name of the snapshot. idClient - [In] ID of the client. bEnabled - [In] Enable/Disable state. Returns: True or false depending if function call is successful.
◆ SnapshotsEnableClientForPartialRestore()
 bool CRhinoDocProperties::SnapshotsEnableClientForPartialRestore  |  ( |  const wchar_t *  |  wszName,
|  const UUID &  |  idClient,
|  bool  |  bEnable
)
Description: Sets the state of a client of a named snapshot. Parameters: wszName - [In] Name of the snapshot. idClient - [In] ID of the client. bEnabled - [In] Enable/Disable state. Returns: True or false depending if function call is successful.
◆ SnapshotsGetView()
 bool CRhinoDocProperties::SnapshotsGetView  |  ( |  const wchar_t *  |  wszName,
|  ON_3dmView &  |  view
) |   |  const
Description: Gets the view of a named snapshot. Parameters: wszName - [In] Name of the snapshot. view - [In] View of a snapshot. Returns: True or false depending if function call is successful.
◆ SnapshotsIsClientEnabled()
 bool CRhinoDocProperties::SnapshotsIsClientEnabled  |  ( |  const wchar_t *  |  wszName,
|  const UUID &  |  idClient,
|  bool &  |  bEnabled
) |   |  const
Description: Gets the state of a client of a named snapshot. Parameters: wszName - [In] Name of the snapshot. idClient - [In] ID of the client. bEnabled - [Out] Enable/Disable state. Returns: True or false depending if function call is successful.
◆ SnapshotsIsClientEnabledForPartialRestore()
 bool CRhinoDocProperties::SnapshotsIsClientEnabledForPartialRestore  |  ( |  const wchar_t *  |  wszName,
|  const UUID &  |  idClient,
|  bool &  |  bEnabled
) |   |  const
Description: Gets the state of a client of a named snapshot. Parameters: wszName - [In] Name of the snapshot. idClient - [In] ID of the client. bEnabled - [Out] Enable/Disable state. Returns: True or false depending if function call is successful.
◆ SnapshotsTemporaryRestore()
 bool CRhinoDocProperties::SnapshotsTemporaryRestore  |  ( |  const ON_UUID &  |  id | )
Description: Restores a temporary snapshot. Parameters: id - [In] id of the snapshot. Returns: True or false depending if function call is successful.
◆ SnapshotsTemporarySave()
 bool CRhinoDocProperties::SnapshotsTemporarySave  |  ( |  ON_UUID &  |  id | )
Description: Saves a temporary snapshot of the current document state. Parameters: id - [OUT] id of the snapshot. Returns: True or false depending if function call is successful.
◆ UnitsAndTolerances()
 const ON_3dmUnitsAndTolerances& CRhinoDocProperties::UnitsAndTolerances  |  ( |   | ) |   const
OBSOLETE - use ModelUnitsAndTolerances.
◆ UseHiddenLightsInRenderedViews()
 bool CRhinoDocProperties::UseHiddenLightsInRenderedViews  |  ( |  bool  |  from_doc = false | ) |   const
Friends And Related Function Documentation
◆ CRhinoDoc
 friend class CRhinoDoc
friend
◆ CRhNamedViewCameraIcon
 friend class CRhNamedViewCameraIcon
friend