Public Types | Public Member Functions | List of all members
CRhRdkContent::CRenderCRCFlags Class Referencefinal
#include <RhRdkContent.h>
 Public Types
enum  | : ON__UINT64 {
 rcrc_Normal = 0, rcrc_ExcludeLinearWorkflow = 1, rcrc_ExcludeLocalMapping = 2, rcrc_Reserved1 = 4,
 rcrc_Reserved2 = 8, rcrc_ExcludeDocumentEffects = rcrc_ExcludeLinearWorkflow | rcrc_Reserved1 | rcrc_Reserved2
 }
 Public Member Functions
CRenderCRCFlags (const ON__UINT64 &f=rcrc_Normal)
void  | AddFlag (const ON__UINT64 &f)
const ON__UINT64 &  | Flags (void) const
const wchar_t *  | GetExcludedParamNames (void) const
bool  | HasFlag (const ON__UINT64 &f) const
operator const ON__UINT64 & (void) const
void  | SetExcludedParamNames (const wchar_t *wsz)
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : ON__UINT64
Enumerator
rcrc_Normal
rcrc_ExcludeLinearWorkflow
rcrc_ExcludeLocalMapping
rcrc_Reserved1
rcrc_Reserved2
rcrc_ExcludeDocumentEffects
Constructor & Destructor Documentation
◆ CRenderCRCFlags()
 CRhRdkContent::CRenderCRCFlags::CRenderCRCFlags  |  ( |  const ON__UINT64 &  |  f = rcrc_Normal | )
Member Function Documentation
◆ AddFlag()
 void CRhRdkContent::CRenderCRCFlags::AddFlag  |  ( |  const ON__UINT64 &  |  f | )
◆ Flags()
 const ON__UINT64& CRhRdkContent::CRenderCRCFlags::Flags  |  ( |  void  |   | ) |   const
◆ GetExcludedParamNames()
 const wchar_t* CRhRdkContent::CRenderCRCFlags::GetExcludedParamNames  |  ( |  void  |   | ) |   const
Get a semicolon-delimited string of param names to exclude from the render CRC.
◆ HasFlag()
 bool CRhRdkContent::CRenderCRCFlags::HasFlag  |  ( |  const ON__UINT64 &  |  f | ) |   const
◆ operator const ON__UINT64 &()
 CRhRdkContent::CRenderCRCFlags::operator const ON__UINT64 &  |  ( |  void  |   | ) |   const
◆ SetExcludedParamNames()
 void CRhRdkContent::CRenderCRCFlags::SetExcludedParamNames  |  ( |  const wchar_t *  |  wsz | )
Set a semicolon-delimited string of param names to exclude from the render CRC.