Public Member Functions | List of all members
CRhRdkDocSun Class Reference
RDK
#include <RhRdkSun.h>
 Inheritance diagram for CRhRdkDocSun:
 Public Member Functions
CRhRdkDocSun (CRhinoDoc &doc)
CRhRdkDocSun (CRhRdkDocument &rdkDoc)
CRhRdkDocSun (const CRhinoDoc &doc)
CRhRdkDocSun (const CRhRdkDocument &rdkDoc)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Detailed Description
This class is obsolete and should not be used. Please use CRhRdkDocument::Sun() or CRhRdkDocument::Skylight() instead. For example:
CRhinoDoc& doc = ...
CRhRdkDocSun sun(doc);
if (sun.Sun().EnableOn())
    ...
if (sun.SkylightOn())
    ...
The above is obsolete; change to:
    auto& rdkDoc = CRhRdkDocument::Get(doc);
    if (rdkDoc.Sun().EnableOn())
        ...
    if (rdkDoc.Skylight().On())
        ...
Constructor & Destructor Documentation
◆ CRhRdkDocSun() [1/4]
 CRhRdkDocSun::CRhRdkDocSun  |  ( |  CRhinoDoc &  |  doc | )
◆ CRhRdkDocSun() [2/4]
 CRhRdkDocSun::CRhRdkDocSun  |  ( |  CRhRdkDocument &  |  rdkDoc | )
◆ CRhRdkDocSun() [3/4]
 CRhRdkDocSun::CRhRdkDocSun  |  ( |  const CRhinoDoc &  |  doc | )
◆ CRhRdkDocSun() [4/4]
 CRhRdkDocSun::CRhRdkDocSun  |  ( |  const CRhRdkDocument &  |  rdkDoc | )