Public Member Functions | List of all members
CRhRdkNewUndoableEvent Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkNewUndoableEvent:
 Public Member Functions
CRhRdkNewUndoableEvent (const IRhinoUiDataSource &h, const wchar_t *wsz)
CRhRdkNewUndoableEvent (const IRhinoUiDataSourceHost &h, const wchar_t *wsz)
CRhRdkNewUndoableEvent (const IRhinoUiDataSourceHost *pHost, const wchar_t *wsz)
virtual  | ~CRhRdkNewUndoableEvent ()
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Constructor & Destructor Documentation
◆ CRhRdkNewUndoableEvent() [1/3]
 CRhRdkNewUndoableEvent::CRhRdkNewUndoableEvent  |  ( |  const IRhinoUiDataSource &  |  h,
|  const wchar_t *  |  wsz
)
◆ CRhRdkNewUndoableEvent() [2/3]
 CRhRdkNewUndoableEvent::CRhRdkNewUndoableEvent  |  ( |  const IRhinoUiDataSourceHost &  |  h,
|  const wchar_t *  |  wsz
)
◆ CRhRdkNewUndoableEvent() [3/3]
 CRhRdkNewUndoableEvent::CRhRdkNewUndoableEvent  |  ( |  const IRhinoUiDataSourceHost *  |  pHost,
|  const wchar_t *  |  wsz
)
◆ ~CRhRdkNewUndoableEvent()
 virtual CRhRdkNewUndoableEvent::~CRhRdkNewUndoableEvent  |  ( |   | )
virtual