Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
CRhRdkColorButton Class Reference
RDK
#include <RhRdkColorButton.h>
 Inheritance diagram for CRhRdkColorButton:
 Public Member Functions
CRhRdkColorButton ()
virtual  | ~CRhRdkColorButton ()
virtual CRhRdkColor  | BackgroundColor (void) const
virtual bool  | CreateWnd (LPCTSTR lpszWindowName, DWORD dwStyle, const RECT &rect, CWnd *pParent, UINT nID)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual CRhRdkColor  | GetColor (void) const
virtual void  | OnBeginDropper (void)
virtual void  | OnBeginPicker (void)
virtual void  | OnEndDropper (void)
virtual void  | OnEndPicker (void)
virtual void  | OnFinalEndPicker (void)
virtual void  | SetBackgroundColor (const CRhRdkColor &color)
virtual void  | SetChildSlotName (const wchar_t *wszCSN)
virtual void  | SetClickAction (IRhRdkColorButton::eClickAction action)
virtual void  | SetColor (const CRhRdkColor &color, bool bNotify=true)
virtual void  | SetColorEx (const CRhRdkColor &color, UINT uDelayMS=1)
virtual void  | SetController (CRhRdkControllerPtr con)
virtual void  | SetNewPicker (IRhRdkColorPicker *pPicker)
virtual void  | SetShowColorWhenDisabled (bool bShow)
virtual void  | SetUndoString (const wchar_t *wszUndo)
virtual void  | SetUseAlpha (bool bUseAlpha)
virtual void  | SetVaries (bool bVaries)
virtual bool  | ShowColorWhenDisabled (void) const
virtual bool  | UseAlpha (void) const
virtual bool  | Varies (void) const
 Static Public Member Functions
static UINT  | ChangedMessageNumber (void)
 Protected Member Functions
virtual RDK_DEPRECATED void  | BeginDrag (void)
virtual RDK_DEPRECATED void  | DrawItem (LPDRAWITEMSTRUCT)
virtual const wchar_t *  | GetVariesText (void) const
void  | Initialize (void)
afx_msg LRESULT  | OnChanged (WPARAM, LPARAM)
afx_msg int  | OnCreate (LPCREATESTRUCT)
afx_msg void  | OnDestroy ()
afx_msg void  | OnEnable (BOOL bEnable)
afx_msg BOOL  | OnEraseBkgnd (CDC *)
afx_msg LRESULT  | OnQueryFocus (WPARAM, LPARAM)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | PreSubclassWindow () override
Detailed Description
Provides a button which can be set to a color and supports color drag and drop. When clicked, the button displays a color picker. The default is the Rhino color picker but this can be changed by calling SetNewPicker(). The button sends a standard button notify message just before it displays the picker. You should not display your own color picker in the message handler. If you really need to display one then you should initially call SetNewPicker(NULL) to prevent the button from displaying the default color picker.
Note
This control is merely a window that hosts a color button in its client area. The color button is itself an implementation of IRhRdkColorButton.
Constructor & Destructor Documentation
◆ CRhRdkColorButton()
 CRhRdkColorButton::CRhRdkColorButton  |  ( |   | )
◆ ~CRhRdkColorButton()
 virtual CRhRdkColorButton::~CRhRdkColorButton  |  ( |   | )
virtual
Member Function Documentation
◆ BackgroundColor()
 virtual CRhRdkColor CRhRdkColorButton::BackgroundColor  |  ( |  void  |   | ) |   const
virtual
Returns
The button's background color.
◆ BeginDrag()
 virtual RDK_DEPRECATED void CRhRdkColorButton::BeginDrag  |  ( |  void  |   | )
protectedvirtual
This override is no longer supported.
◆ ChangedMessageNumber()
 static UINT CRhRdkColorButton::ChangedMessageNumber  |  ( |  void  |   | )
static
Get the registered message number that will be sent when the button color is changed either by a call to SetColor() with bNotify=true, or when a color is dropped on the button.
Returns
The message number to use in your ON_REGISTERED_MESSAGE handler. Example usage:
const UINT uColorButtonChangedMsg = CRhRdkColorButton::ChangedMessageNumber();
...
BEGIN_MESSAGE_MAP(CMyDialog, CDialog)
 ON_REGISTERED_MESSAGE(uColorButtonChangedMsg, OnColorChanged)
END_MESSAGE_MAP()
...
LRESULT CMyDialog::OnColorChanged(WPARAM wParam, LPARAM lParam)
{
 // wParam is the control id.
 CWnd* pWnd = GetDlgItem(int(wParam));
 ...
 // lParam is a pointer to the control.
 CRhRdkColorButton* pButton = reinterpret_cast<CRhRdkColorButton*>(lParam);
 ...
 return 1;
}
...
◆ CreateWnd()
 virtual bool CRhRdkColorButton::CreateWnd  |  ( |  LPCTSTR  |  lpszWindowName,
|  DWORD  |  dwStyle,
|  const RECT &  |  rect,
|  CWnd *  |  pParent,
|  UINT  |  nID
)
virtual
Create the window.
◆ DrawItem()
 virtual RDK_DEPRECATED void CRhRdkColorButton::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |   | )
protectedvirtual
This override is no longer supported.
◆ EVF()
 virtual void* CRhRdkColorButton::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
◆ GetColor()
 virtual CRhRdkColor CRhRdkColorButton::GetColor  |  ( |  void  |   | ) |   const
virtual
Get the color that the button is currently displaying.
◆ GetVariesText()
 virtual const wchar_t* CRhRdkColorButton::GetVariesText  |  ( |  void  |   | ) |   const
protectedvirtual
Override this to customize the text that the button displays when it is set to 'varies'. The default implementation returns L"(varies)".
◆ Initialize()
 void CRhRdkColorButton::Initialize  |  ( |  void  |   | )
protected
◆ OnBeginDropper()
 virtual void CRhRdkColorButton::OnBeginDropper  |  ( |  void  |   | )
virtual
Called when the control enters dropper mode.
◆ OnBeginPicker()
 virtual void CRhRdkColorButton::OnBeginPicker  |  ( |  void  |   | )
virtual
Called just before the color picker appears.
◆ OnChanged()
 afx_msg LRESULT CRhRdkColorButton::OnChanged  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnCreate()
 afx_msg int CRhRdkColorButton::OnCreate  |  ( |  LPCREATESTRUCT  |   | )
protected
◆ OnDestroy()
 afx_msg void CRhRdkColorButton::OnDestroy  |  ( |   | )
protected
◆ OnEnable()
 afx_msg void CRhRdkColorButton::OnEnable  |  ( |  BOOL  |  bEnable | )
protected
◆ OnEndDropper()
 virtual void CRhRdkColorButton::OnEndDropper  |  ( |  void  |   | )
virtual
Called when the control exits dropper mode.
◆ OnEndPicker()
 virtual void CRhRdkColorButton::OnEndPicker  |  ( |  void  |   | )
virtual
Called just after the color picker has been dismissed but before the picked color has been set into the button (with optional undo).
◆ OnEraseBkgnd()
 afx_msg BOOL CRhRdkColorButton::OnEraseBkgnd  |  ( |  CDC *  |   | )
protected
◆ OnFinalEndPicker()
 virtual void CRhRdkColorButton::OnFinalEndPicker  |  ( |  void  |   | )
virtual
Called after the color picker has been dismissed and the picked color has been set into the button (with optional undo).
◆ OnQueryFocus()
 afx_msg LRESULT CRhRdkColorButton::OnQueryFocus  |  ( |  WPARAM  |  ,
|  LPARAM
)
inlineprotected
◆ OnSize()
 afx_msg void CRhRdkColorButton::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
protected
◆ PreSubclassWindow()
 virtual void CRhRdkColorButton::PreSubclassWindow  |  ( |   | )
overrideprotectedvirtual
Called just before the control is subclassed.
◆ SetBackgroundColor()
 virtual void CRhRdkColorButton::SetBackgroundColor  |  ( |  const CRhRdkColor &  |  color | )
virtual
Set the button's background color.
◆ SetChildSlotName()
 virtual void CRhRdkColorButton::SetChildSlotName  |  ( |  const wchar_t *  |  wszCSN | )
virtual
Set the child slot name which associates the button with a child slot in one or more parent contents.
◆ SetClickAction()
 virtual void CRhRdkColorButton::SetClickAction  |  ( |  IRhRdkColorButton::eClickAction  |  action | )
virtual
Set the action that occurs when the button is clicked. The default is to display the color picker. This also changes which context menu item is displayed in bold.
◆ SetColor()
 virtual void CRhRdkColorButton::SetColor  |  ( |  const CRhRdkColor &  |  color,
|  bool  |  bNotify = true
)
virtual
Set the color that the button should display.
Parameters
color | is the color to set.
bNotify | specifies whether or not a notification message should be sent to the parent.
◆ SetColorEx()
 virtual void CRhRdkColorButton::SetColorEx  |  ( |  const CRhRdkColor &  |  color,
|  UINT  |  uDelayMS = 1
)
virtual
Set the color that the button should display.
Parameters
color | is the color to set.
iDelayMS | specifies if and when a notification message should be sent to the parent. If the value is 0, no notification message is sent. If the value is 1, the notification message is sent before the method returns. If the value is greater than 1, it specifies the number of milliseconds to delay after the method returns before sending the notification message to the parent.
◆ SetController()
 virtual void CRhRdkColorButton::SetController  |  ( |  CRhRdkControllerPtr  |  con | )
virtual
Set the controller. If a controller is not set, the color button will work as a basic color button, but it will not be able to do any child-slot (texture) functionality.
◆ SetNewPicker()
 virtual void CRhRdkColorButton::SetNewPicker  |  ( |  IRhRdkColorPicker *  |  pPicker | )
virtual
Set a new color picker. The button will subsequently display the new picker's user interface instead of the default one.
Parameters
pPicker | is the new picker; the button will take ownership of this object.
◆ SetShowColorWhenDisabled()
 virtual void CRhRdkColorButton::SetShowColorWhenDisabled  |  ( |  bool  |  bShow | )
virtual
Set whether or not the button should always shows its color, even when disabled.
◆ SetUndoString()
 virtual void CRhRdkColorButton::SetUndoString  |  ( |  const wchar_t *  |  wszUndo | )
virtual
Set the undo string to be used for automatically handling undo. If you want to handle undo yourself, do not call this method.
Parameters
wszUndo | is the string that will appear in Rhino's undo UI.
◆ SetUseAlpha()
 virtual void CRhRdkColorButton::SetUseAlpha  |  ( |  bool  |  bUseAlpha | )
virtual
Set whether or not the button allows alpha in the color.
◆ SetVaries()
 virtual void CRhRdkColorButton::SetVaries  |  ( |  bool  |  bVaries | )
virtual
Set the button's 'varies' state.
◆ ShowColorWhenDisabled()
 virtual bool CRhRdkColorButton::ShowColorWhenDisabled  |  ( |  void  |   | ) |   const
virtual
Returns
true if the button always shows its color, even when disabled.
◆ UseAlpha()
 virtual bool CRhRdkColorButton::UseAlpha  |  ( |  void  |   | ) |   const
virtual
Returns
true if the button allows alpha in the color, else false.
◆ Varies()
 virtual bool CRhRdkColorButton::Varies  |  ( |  void  |   | ) |   const
virtual
Returns
true if the button is set to 'varies', else false.