Public Member Functions | List of all members
CRhRdkMaterialCriticalDataPreserver Class Referencefinal
RDK
#include <RhRdkUiSdk.h>
 Public Member Functions
CRhRdkMaterialCriticalDataPreserver (ON_Material &mat)
~CRhRdkMaterialCriticalDataPreserver ()
Constructor & Destructor Documentation
◆ CRhRdkMaterialCriticalDataPreserver()
 CRhRdkMaterialCriticalDataPreserver::CRhRdkMaterialCriticalDataPreserver  |  ( |  ON_Material &  |  mat | )
◆ ~CRhRdkMaterialCriticalDataPreserver()
 CRhRdkMaterialCriticalDataPreserver::~CRhRdkMaterialCriticalDataPreserver  |  ( |   | )