Public Member Functions | Public Attributes | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoSdkRenderFrame Class Reference
Rhino
CRhinoSdkRenderFrame frame. More...
#include <RhinoSdkRenderFrame.h>
 Inheritance diagram for CRhinoSdkRenderFrame:
 Public Member Functions
CRhinoSdkRenderFrame (CRhinoDoc *doc)
virtual BOOL  | CopyRenderWindowToClipboard ()
CRhinoDoc &  | Document ()
ON_2iSize  | ImageSize () const
virtual BOOL  | IsRendering ()
virtual CRhinoSdkRenderViewWnd *  | NewRenderViewWnd (CRhinoSdkRenderFrame *frame)
}}AFX_VIRTUAL More...
virtual BOOL  | OnCmdMsg (UINT nID, int nCode, void *pExtra, AFX_CMDHANDLERINFO *pHandlerInfo)
void  | OnViewWndDestruction ()
for internal use only More...
virtual BOOL  | PreTranslateMessage (MSG *pMsg)
HWND  | RhinoMainFrame ()
CRhinoSdkRender *  | RhinoRender () const
CRhinoRenderPlugIn *  | RhinoRenderPlugIn () const
void  | RhinoSetMessageText (const wchar_t *lpszText)
Operations. More...
virtual BOOL  | SaveRenderImageAs (const wchar_t *lpsFileName)
void  | SetView (const ON_3dmView &view)
virtual BOOL  | StartRendering ()
virtual void  | StopRendering ()
const ON_3dmView &  | View () const
Attributes. More...
 Public Attributes
class CRhSdkRenderFrameSdkExtension *  | m__render_frame_sdk_extension
 Protected Member Functions
void  | Construct ()
virtual bool  | IsRDKRenderFrame (void) const
Internal function for RDK. Please do not override this. More...
afx_msg void  | OnClose ()
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnDestroy ()
afx_msg void  | OnSetFocus (CWnd *pOldWnd)
afx_msg void  | OnShowWindow (BOOL bShow, UINT nStatus)
afx_msg void  | OnSysCommand (UINT nID, LPARAM lParam)
}}AFX_MSG More...
virtual BOOL  | PreCreateWindow (CREATESTRUCT &cs)
afx_msg void  | RhinoSdkRenderFrameOnWmUser (WPARAM wParam, LPARAM lParam)
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Attributes
BOOL  | m_do_not_prompt_for_save
HWND  | m_hWndRhinoMainFrame
HWND  | m_hWndView
BOOL  | m_minimize_enable
CRhinoDoc *  | m_pDoc
CRhinoSdkRender *  | m_render_command
CRhinoRenderPlugIn *  | m_render_plug_in
HICON  | m_sdk_window_icon
ON_2iSize  | m_sizeImage
ON_3dmView  | m_view
CStatusBar  | m_wndStatusBar
CRhinoSdkRenderViewWnd *  | m_wndView
 Friends
class  | CRhinoSdkRender
Implementation. More...
class  | CRhinoSdkRenderEx
class  | CRhRenderWindowManager
Detailed Description
CRhinoSdkRenderFrame frame.
Constructor & Destructor Documentation
◆ CRhinoSdkRenderFrame()
 CRhinoSdkRenderFrame::CRhinoSdkRenderFrame  |  ( |  CRhinoDoc *  |  doc | )
Member Function Documentation
◆ Construct()
 void CRhinoSdkRenderFrame::Construct  |  ( |   | )
protected
◆ CopyRenderWindowToClipboard()
 virtual BOOL CRhinoSdkRenderFrame::CopyRenderWindowToClipboard  |  ( |   | )
virtual
◆ Document()
 CRhinoDoc& CRhinoSdkRenderFrame::Document  |  ( |   | )
◆ ImageSize()
 ON_2iSize CRhinoSdkRenderFrame::ImageSize  |  ( |   | ) |   const
inline
◆ IsRDKRenderFrame()
 virtual bool CRhinoSdkRenderFrame::IsRDKRenderFrame  |  ( |  void  |   | ) |   const
protectedvirtual
Internal function for RDK. Please do not override this.
◆ IsRendering()
 virtual BOOL CRhinoSdkRenderFrame::IsRendering  |  ( |   | )
virtual
◆ NewRenderViewWnd()
 virtual CRhinoSdkRenderViewWnd* CRhinoSdkRenderFrame::NewRenderViewWnd  |  ( |  CRhinoSdkRenderFrame *  |  frame | )
virtual
}}AFX_VIRTUAL
Must override
◆ OnClose()
 afx_msg void CRhinoSdkRenderFrame::OnClose  |  ( |   | )
protected
◆ OnCmdMsg()
 virtual BOOL CRhinoSdkRenderFrame::OnCmdMsg  |  ( |  UINT  |  nID,
|  int  |  nCode,
|  void *  |  pExtra,
|  AFX_CMDHANDLERINFO *  |  pHandlerInfo
)
virtual
Overrides ClassWizard generated virtual function overrides {{AFX_VIRTUAL(CRhinoSdkRenderFrame)
◆ OnCreate()
 afx_msg int CRhinoSdkRenderFrame::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
protected
Generated message map functions {{AFX_MSG(CRhinoSdkRenderFrame)
◆ OnDestroy()
 afx_msg void CRhinoSdkRenderFrame::OnDestroy  |  ( |   | )
protected
◆ OnSetFocus()
 afx_msg void CRhinoSdkRenderFrame::OnSetFocus  |  ( |  CWnd *  |  pOldWnd | )
protected
◆ OnShowWindow()
 afx_msg void CRhinoSdkRenderFrame::OnShowWindow  |  ( |  BOOL  |  bShow,
|  UINT  |  nStatus
)
protected
◆ OnSysCommand()
 afx_msg void CRhinoSdkRenderFrame::OnSysCommand  |  ( |  UINT  |  nID,
|  LPARAM  |  lParam
)
protected
}}AFX_MSG
◆ OnViewWndDestruction()
 void CRhinoSdkRenderFrame::OnViewWndDestruction  |  ( |   | )
for internal use only
◆ PreCreateWindow()
 virtual BOOL CRhinoSdkRenderFrame::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
protectedvirtual
◆ PreTranslateMessage()
 virtual BOOL CRhinoSdkRenderFrame::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
◆ RhinoMainFrame()
 HWND CRhinoSdkRenderFrame::RhinoMainFrame  |  ( |   | )
inline
◆ RhinoRender()
 CRhinoSdkRender* CRhinoSdkRenderFrame::RhinoRender  |  ( |   | ) |   const
inline
◆ RhinoRenderPlugIn()
 CRhinoRenderPlugIn* CRhinoSdkRenderFrame::RhinoRenderPlugIn  |  ( |   | ) |   const
inline
◆ RhinoSdkRenderFrameOnWmUser()
 afx_msg void CRhinoSdkRenderFrame::RhinoSdkRenderFrameOnWmUser  |  ( |  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
protected
◆ RhinoSetMessageText()
 void CRhinoSdkRenderFrame::RhinoSetMessageText  |  ( |  const wchar_t *  |  lpszText | )
Operations.
Description: Set status bar message text. Parameters: lpszText [in] - Text to display in status bar. If NULL then status bar will be blanked out.
◆ SaveRenderImageAs()
 virtual BOOL CRhinoSdkRenderFrame::SaveRenderImageAs  |  ( |  const wchar_t *  |  lpsFileName | )
virtual
◆ SetView()
 void CRhinoSdkRenderFrame::SetView  |  ( |  const ON_3dmView &  |  view | )
inline
◆ StartRendering()
 virtual BOOL CRhinoSdkRenderFrame::StartRendering  |  ( |   | )
virtual
◆ StopRendering()
 virtual void CRhinoSdkRenderFrame::StopRendering  |  ( |   | )
virtual
◆ View()
 const ON_3dmView& CRhinoSdkRenderFrame::View  |  ( |   | ) |   const
inline
Attributes.
◆ WindowProc()
 virtual LRESULT CRhinoSdkRenderFrame::WindowProc  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
protectedvirtual
Friends And Related Function Documentation
◆ CRhinoSdkRender
 friend class CRhinoSdkRender
friend
Implementation.
◆ CRhinoSdkRenderEx
 friend class CRhinoSdkRenderEx
friend
◆ CRhRenderWindowManager
 friend class CRhRenderWindowManager
friend
Member Data Documentation
◆ m__render_frame_sdk_extension
 class CRhSdkRenderFrameSdkExtension* CRhinoSdkRenderFrame::m__render_frame_sdk_extension
◆ m_do_not_prompt_for_save
 BOOL CRhinoSdkRenderFrame::m_do_not_prompt_for_save
protected
◆ m_hWndRhinoMainFrame
 HWND CRhinoSdkRenderFrame::m_hWndRhinoMainFrame
protected
◆ m_hWndView
 HWND CRhinoSdkRenderFrame::m_hWndView
protected
◆ m_minimize_enable
 BOOL CRhinoSdkRenderFrame::m_minimize_enable
protected
◆ m_pDoc
 CRhinoDoc* CRhinoSdkRenderFrame::m_pDoc
protected
◆ m_render_command
 CRhinoSdkRender* CRhinoSdkRenderFrame::m_render_command
protected
◆ m_render_plug_in
 CRhinoRenderPlugIn* CRhinoSdkRenderFrame::m_render_plug_in
protected
◆ m_sdk_window_icon
 HICON CRhinoSdkRenderFrame::m_sdk_window_icon
protected
◆ m_sizeImage
 ON_2iSize CRhinoSdkRenderFrame::m_sizeImage
protected
◆ m_view
 ON_3dmView CRhinoSdkRenderFrame::m_view
protected
◆ m_wndStatusBar
 CStatusBar CRhinoSdkRenderFrame::m_wndStatusBar
protected
◆ m_wndView
 CRhinoSdkRenderViewWnd* CRhinoSdkRenderFrame::m_wndView
protected