Public Member Functions | Static Public Attributes | List of all members
ON_SleepLock Class Reference
OpenNURBS
#include <opennurbs_plus_sleeplock.h>
 Public Member Functions
ON_SleepLock ()=default
~ON_SleepLock ()=default
bool  | GetLock ()
bool  | GetLock (unsigned int interval_wait_msecs, unsigned int max_wait_msecs)
bool  | GetLock (unsigned int interval_wait_msecs, unsigned int max_wait_msecs, bool bStealLockAfterWaiting)
bool  | IsLocked () const
bool  | ReturnLock ()
 Static Public Attributes
static const unsigned int  | FiveSeconds
= 5000 milliseconds More...
static const unsigned int  | OneMinute
= 60000 milliseconds More...
static const unsigned int  | OneSecond
= 1000 milliseconds More...
static const unsigned int  | TenSeconds
= 10000 milliseconds More...
static const unsigned int  | ThirtySeconds
= 1000 milliseconds More...
Constructor & Destructor Documentation
◆ ON_SleepLock()
 ON_SleepLock::ON_SleepLock  |  ( |   | )
default
◆ ~ON_SleepLock()
 ON_SleepLock::~ON_SleepLock  |  ( |   | )
default
Member Function Documentation
◆ GetLock() [1/3]
 bool ON_SleepLock::GetLock  |  ( |   | )
Description: Gets the lock using a 50 millisecond wait interval with no maximum waiting time. Returns: This version of GetLock() always returns true.
◆ GetLock() [2/3]
 bool ON_SleepLock::GetLock  |  ( |  unsigned int  |  interval_wait_msecs,
|  unsigned int  |  max_wait_msecs
)
Description: Gets the lock using a the specified waiting interval and maximum waiting time. Parameters: interval_wait_msecs - [in] number of milliseconds to wait between checking for the lock. If interval_wait_msecs is 0, then 50 is used. If interval_wait_msecs > max_wait_msecs > 0, then one attempt is made to get the lock. max_wait_msecs - [in] maximum number of milliseconds to wait for lock. If max_wait_msecs is 0, then no maximum wating time is used. Returns: True if the lock is obtained. False if the maximum waiting time expired without getting the lock.
If GetLock() returns true, then you must call ReleaseLock(). If GetLock() returns false, then you must not call ReleaseLock(). Remarks: It is easy and clear to people reading your code if you use values like ON_SleepLock::OneSecond, ON_SleepLock::ThirtySeconds, ON_SleepLock::OneMinute, 47*ON_SleepLock::OneSecond or ON_SleepLock::OneMinute/3 to specify the values for interval_wait_msecs and max_wait_msecs.
◆ GetLock() [3/3]
 bool ON_SleepLock::GetLock  |  ( |  unsigned int  |  interval_wait_msecs,
|  unsigned int  |  max_wait_msecs,
|  bool  |  bStealLockAfterWaiting
)
◆ IsLocked()
 bool ON_SleepLock::IsLocked  |  ( |   | ) |   const
Returns: true if m_locked != 0 at the time of the check. Remarks: By the time you look at the return code, another thread could change the state of the lock.
◆ ReturnLock()
 bool ON_SleepLock::ReturnLock  |  ( |   | )
Description: Unconditionally returns the lock. Returns: True if m_locked was changed from 1 to 0.
Member Data Documentation
◆ FiveSeconds
 const unsigned int ON_SleepLock::FiveSeconds
static
= 5000 milliseconds
◆ OneMinute
 const unsigned int ON_SleepLock::OneMinute
static
= 60000 milliseconds
◆ OneSecond
 const unsigned int ON_SleepLock::OneSecond
static
= 1000 milliseconds
◆ TenSeconds
 const unsigned int ON_SleepLock::TenSeconds
static
= 10000 milliseconds
◆ ThirtySeconds
 const unsigned int ON_SleepLock::ThirtySeconds
static
= 1000 milliseconds