Public Types | Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
ON_OutlineFigure Class Reference
OpenNURBS
#include <opennurbs_font.h>
 Public Types
enum  | Orientation : ON__UINT8 {
 Orientation::Unset = 0, Orientation::CounterClockwise = 1, Orientation::Clockwise = 2, Orientation::NotOriented = 3,
 Orientation::Error = 15
 }
 Public Member Functions
ON_OutlineFigure ()=default
ON_OutlineFigure (const ON_OutlineFigure &)=default
~ON_OutlineFigure ()=default
double  | AreaEstimate () const
const ON_BoundingBox  | BoundingBox () const
ON__UINT16  | FigureIndex () const
ON_OutlineFigure::Orientation  | FigureOrientation () const
unsigned int  | GetFigureCurves (double scale, bool b3d, ON_SimpleArray< ON_Curve * > &figure_curves) const
unsigned int  | GetFigureCurves (double scale, bool b3d, ON_SimpleArray< ON_NurbsCurve * > &figure_curves) const
bool  | IsValidFigure (bool bLogErrors) const
bool  | NegateY ()
ON_OutlineFigure &  | operator= (const ON_OutlineFigure &)=default
bool  | ReverseFigure ()
bool  | SingleStroke () const
 Public Attributes
ON__UINT16  | m_figure_index = 0
ON_SimpleArray< ON_OutlineFigurePoint >  | m_points
 Static Public Attributes
static const ON_OutlineFigure  | Unset
 Friends
class  | ON_Outline
Member Enumeration Documentation
◆ Orientation
 enum ON_OutlineFigure::Orientation : ON__UINT8
strong
Enumerator
Unset
CounterClockwise
Clockwise
NotOriented
Error
An error occured in orientation calculations.
Constructor & Destructor Documentation
◆ ON_OutlineFigure() [1/2]
 ON_OutlineFigure::ON_OutlineFigure  |  ( |   | )
default
◆ ~ON_OutlineFigure()
 ON_OutlineFigure::~ON_OutlineFigure  |  ( |   | )
default
◆ ON_OutlineFigure() [2/2]
 ON_OutlineFigure::ON_OutlineFigure  |  ( |  const ON_OutlineFigure &  |   | )
default
Member Function Documentation
◆ AreaEstimate()
 double ON_OutlineFigure::AreaEstimate  |  ( |   | ) |   const
Returns: Signed area estimate. For simple closed curves, a positive area indicates a counter-clockwise orientation.
◆ BoundingBox()
 const ON_BoundingBox ON_OutlineFigure::BoundingBox  |  ( |   | ) |   const
◆ FigureIndex()
 ON__UINT16 ON_OutlineFigure::FigureIndex  |  ( |   | ) |   const
◆ FigureOrientation()
 ON_OutlineFigure::Orientation ON_OutlineFigure::FigureOrientation  |  ( |   | ) |   const
◆ GetFigureCurves() [1/2]
 unsigned int ON_OutlineFigure::GetFigureCurves  |  ( |  double  |  scale,
|  bool  |  b3d,
|  ON_SimpleArray< ON_Curve * > &  |  figure_curves
) |   |  const
◆ GetFigureCurves() [2/2]
 unsigned int ON_OutlineFigure::GetFigureCurves  |  ( |  double  |  scale,
|  bool  |  b3d,
|  ON_SimpleArray< ON_NurbsCurve * > &  |  figure_curves
) |   |  const
◆ IsValidFigure()
 bool ON_OutlineFigure::IsValidFigure  |  ( |  bool  |  bLogErrors | ) |   const
◆ NegateY()
 bool ON_OutlineFigure::NegateY  |  ( |   | )
◆ operator=()
 ON_OutlineFigure& ON_OutlineFigure::operator=  |  ( |  const ON_OutlineFigure &  |   | )
default
◆ ReverseFigure()
 bool ON_OutlineFigure::ReverseFigure  |  ( |   | )
◆ SingleStroke()
 bool ON_OutlineFigure::SingleStroke  |  ( |   | ) |   const
Returns: True if this figure is single stroke. Remarks: A single stroke figure can be open or closed.
Friends And Related Function Documentation
◆ ON_Outline
 friend class ON_Outline
friend
Member Data Documentation
◆ m_figure_index
 ON__UINT16 ON_OutlineFigure::m_figure_index = 0
◆ m_points
 ON_SimpleArray<ON_OutlineFigurePoint> ON_OutlineFigure::m_points
◆ Unset
 const ON_OutlineFigure ON_OutlineFigure::Unset
static