Public Member Functions | Static Public Member Functions | Friends | List of all members
ON_Hash32TableItem Class Reference
OpenNURBS
#include <opennurbs_hash_table.h>
 Public Member Functions
ON_Hash32TableItem ()=default
ON_Hash32TableItem (const ON_Hash32TableItem &)=default
~ON_Hash32TableItem ()=default
ON__UINT32  | HashTableSerialNumber () const
ON_Hash32TableItem &  | operator= (const ON_Hash32TableItem &)=default
 Static Public Member Functions
static ON__UINT32  | Hash32FromId (const ON_UUID &id)
static ON__UINT32  | Hash32FromSHA1Hash (const class ON_SHA1_Hash &sha1_hash)
 Friends
class  | ON_Hash32Table
Detailed Description
/ / Copyright (c) 1993-2016 Robert McNeel & Associates. All rights reserved. / OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert / McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete openNURBS copyright information see http://www.opennurbs.org. / //////////////////////////////////////////////////////////////
defines ON_Hash32Table
Constructor & Destructor Documentation
◆ ON_Hash32TableItem() [1/2]
 ON_Hash32TableItem::ON_Hash32TableItem  |  ( |   | )
default
◆ ~ON_Hash32TableItem()
 ON_Hash32TableItem::~ON_Hash32TableItem  |  ( |   | )
default
◆ ON_Hash32TableItem() [2/2]
 ON_Hash32TableItem::ON_Hash32TableItem  |  ( |  const ON_Hash32TableItem &  |   | )
default
Member Function Documentation
◆ Hash32FromId()
 static ON__UINT32 ON_Hash32TableItem::Hash32FromId  |  ( |  const ON_UUID &  |  id | )
static
◆ Hash32FromSHA1Hash()
 static ON__UINT32 ON_Hash32TableItem::Hash32FromSHA1Hash  |  ( |  const class ON_SHA1_Hash &  |  sha1_hash | )
static
◆ HashTableSerialNumber()
 ON__UINT32 ON_Hash32TableItem::HashTableSerialNumber  |  ( |   | ) |   const
◆ operator=()
 ON_Hash32TableItem& ON_Hash32TableItem::operator=  |  ( |  const ON_Hash32TableItem &  |   | )
default
Friends And Related Function Documentation
◆ ON_Hash32Table
 friend class ON_Hash32Table
friend