Public Member Functions | List of all members
CRhRdkGenericController Class Reference
RDK
#include <RhRdkDataSource.h>
 Inheritance diagram for CRhRdkGenericController:
 Public Member Functions
virtual void  | Delete (void) override
virtual void  | RequiredDataSources (OUT ON_SimpleArray< ON_UUID > &aId) const override
 Public Member Functions inherited from CRhRdkController
CRhRdkController ()
virtual void  | Activate (void) override
virtual void  | AddDataSource (IRhinoUiDataSource &ds) override
virtual void  | Commit (const UUID &uuidData, IRhinoUiEventInfo *pInfo=nullptr) override
virtual void  | CopyDataSourcesFrom (IRhinoUiDataSourceHost &host) override
virtual void  | Discard (const UUID &uuidData) override
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual void *  | GetData (const UUID &uuidData, bool bForWrite, bool bAutoChangeBracket) const override
virtual void  | GetDataSources (ON_SimpleArray< IRhinoUiDataSource *> &aOut) const override
virtual UUID  | Id (void) const override
virtual bool  | IsActivated (void) const override
virtual void  | OnEvent (const UUID &uuidData, const IRhinoUiEventInfo *pInfo) override
virtual void  | RegisterEventWatcher (IRhinoUiControllerEventWatcher &ew) override
virtual void  | RemoveDataSource (IRhinoUiDataSource &ds) override
virtual EventPriority  | SetEventPriority (EventPriority ep) override
virtual void  | UnregisterEventWatcher (IRhinoUiControllerEventWatcher &ew) override
 Additional Inherited Members
 Public Types inherited from IRhinoUiController
enum  | EventPriority : unsigned int { EventPriority::Low, EventPriority::Normal, EventPriority::High, EventPriority::RealTime }
Event priority More...
 Static Public Member Functions inherited from IRhinoUiController
static void  | CustomDeleter (IRhinoUiController *)
static std::shared_ptr< IRhinoUiController >  | make_shared (IRhinoUiController *)
 Protected Member Functions inherited from CRhRdkController
virtual  | ~CRhRdkController ()
 Protected Member Functions inherited from IRhinoUiController
virtual  | ~IRhinoUiController ()
 Protected Member Functions inherited from IRhinoUiDataSourceEventWatcher
virtual  | ~IRhinoUiDataSourceEventWatcher ()
Member Function Documentation
◆ Delete()
 virtual void CRhRdkGenericController::Delete  |  ( |  void  |   | )
overridevirtual
Implement this method to unregister and delete the event watcher.
Reimplemented from CRhRdkController.
◆ RequiredDataSources()
 virtual void CRhRdkGenericController::RequiredDataSources  |  ( |  OUT ON_SimpleArray< ON_UUID > &  |  aId | ) |   const
overridevirtual
Retrieve an array of data source ids required by this controller.
Implements IRhinoUiController.