Public Member Functions | List of all members
ON_BrepRegionArray Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepRegionArray:
 Public Member Functions
ON_BrepRegionArray ()
~ON_BrepRegionArray ()
bool  | Read (ON_BinaryArchive &)
unsigned int  | SizeOf () const
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_ObjectArray< ON_BrepRegion >
ON_ObjectArray ()
Class ON_ObjectArray<> More...
ON_ObjectArray (size_t)
size_t parameter = initial capacity More...
ON_ObjectArray (const ON_ObjectArray< ON_BrepRegion > &)
~ON_ObjectArray ()
override for struct member deallocation, etc. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | HeapSort (int(*)(const ON_BrepRegion *, const ON_BrepRegion *))
ON_ObjectArray< ON_BrepRegion > &  | operator= (const ON_ObjectArray< ON_BrepRegion > &)
bool  | QuickSort (int(*)(const ON_BrepRegion *, const ON_BrepRegion *))
ON_BrepRegion *  | Realloc (ON_BrepRegion *, int)
 Public Member Functions inherited from ON_ClassArray< ON_BrepRegion >
ON_ClassArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_ClassArray (size_t)
size_t parameter = initial capacity More...
ON_ClassArray (const ON_ClassArray< ON_BrepRegion > &)
Copy constructor. More...
virtual  | ~ON_ClassArray ()
override for struct member deallocation, etc. More...
void  | Append (const ON_BrepRegion &)
void  | Append (int, const ON_BrepRegion *)
Append copy of an array T[count]. More...
ON_BrepRegion &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_BrepRegion *  | Array ()
The Array() function return the. More...
const ON_BrepRegion *  | Array () const
m_a pointer value. More...
ON_BrepRegion *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_BrepRegion *  | At (unsigned int)
ON_BrepRegion *  | At (ON__INT64)
ON_BrepRegion *  | At (ON__UINT64)
const ON_BrepRegion *  | At (int) const
const ON_BrepRegion *  | At (unsigned int) const
const ON_BrepRegion *  | At (ON__INT64) const
const ON_BrepRegion *  | At (ON__UINT64) const
int  | BinarySearch (const ON_BrepRegion *, int(*)(const ON_BrepRegion *, const ON_BrepRegion *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
int  | BinarySearch (const ON_BrepRegion *, int(*)(const ON_BrepRegion *, const ON_BrepRegion *), int) const
int  | Capacity () const
capacity of array More...
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_BrepRegion *  | First ()
const ON_BrepRegion *  | First () const
returns nullptr if count = 0 More...
void  | Insert (int, const ON_BrepRegion &)
Insert called with a reference uses operator =. More...
ON_BrepRegion *  | KeepArray ()
ON_BrepRegion *  | Last ()
const ON_BrepRegion *  | Last () const
returns nullptr if count = 0 More...
int  | NewCapacity () const
operator const ON_BrepRegion * () const
operator ON_BrepRegion * ()
The cast operators return a pointer. More...
ON_ClassArray< ON_BrepRegion > &  | operator= (const ON_ClassArray< ON_BrepRegion > &)
Assignment operator. More...
ON_BrepRegion &  | operator[] (int)
ON_BrepRegion &  | operator[] (unsigned int)
ON_BrepRegion &  | operator[] (ON__INT64)
ON_BrepRegion &  | operator[] (ON__UINT64)
const ON_BrepRegion &  | operator[] (int) const
const ON_BrepRegion &  | operator[] (unsigned int) const
const ON_BrepRegion &  | operator[] (ON__INT64) const
const ON_BrepRegion &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
void  | Remove ()
void  | Remove (int)
ON_BrepRegion *  | Reserve (size_t)
memory managment ///////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_BrepRegion *, int(*)(const ON_BrepRegion *, const ON_BrepRegion *)) const
void  | SetArray (ON_BrepRegion *)
void  | SetArray (ON_BrepRegion *, int, int)
ON_BrepRegion *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_BrepRegion *, const ON_BrepRegion *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_BrepRegion *, const ON_BrepRegion *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_ClassArray< ON_BrepRegion >
void  | ConstructDefaultElement (ON_BrepRegion *)
void  | DestroyElement (ON_BrepRegion &)
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_ClassArray< ON_BrepRegion >
ON_BrepRegion *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_BrepRegionArray()
 ON_BrepRegionArray::ON_BrepRegionArray  |  ( |   | )
◆ ~ON_BrepRegionArray()
 ON_BrepRegionArray::~ON_BrepRegionArray  |  ( |   | )
Member Function Documentation
◆ Read()
 bool ON_BrepRegionArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SizeOf()
 unsigned int ON_BrepRegionArray::SizeOf  |  ( |   | ) |   const
◆ Write()
 bool ON_BrepRegionArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const