Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhRdkContentCtrl Class Referenceabstract
RDK
#include <RhRdkContentCtrl.h>
 Inheritance diagram for CRhRdkContentCtrl:
 Public Member Functions
CRhRdkContentCtrl ()
virtual  | ~CRhRdkContentCtrl ()
virtual CRhRdkContentKindList  | AllowedKinds (void) const =0
virtual bool  | GetContentArray (CRhRdkContentArray &aOut) const
virtual RDK_DEPRECATED CRhRdkVariant  | InstanceId (void) const
virtual bool  | SetContentArray (const CRhRdkContentArray &a)
virtual RDK_DEPRECATED bool  | SetInstanceId (const CRhRdkVariant &vInstance, bool bNotify)
 Public Member Functions inherited from CRhRdkContentCtrlBase
CRhRdkContentCtrlBase ()
virtual  | ~CRhRdkContentCtrlBase ()
virtual bool  | AmountEnabled (void) const
virtual bool  | AmountVaries (void) const
virtual void  | Change (void)
virtual bool  | CheckEnabled (void) const
CRhRdkControllerPtr  | Controller (void) const
virtual bool  | CreateWnd (DWORD dwStyle, const RECT &rect, CWnd *pParent, UINT uID)
virtual void  | DisplayData (void)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual double  | GetAmount (void) const
virtual CRhRdkVariant  | GetChannelCustom (void) const
virtual CRhRdkVariant  | GetChannelMode (void) const
virtual UINT  | GetCheck (void) const
virtual bool  | IsEmpty (void) const
virtual void  | OnAmountChanged (void)
virtual void  | OnChange (void)
virtual void  | OnCheckChanged (void)
virtual bool  | ReadOnly (void) const
virtual void  | SetAmount (double d)
virtual void  | SetAmountBounds (double dMin, double dMax)
virtual void  | SetAmountEnabled (bool b)
virtual void  | SetAmountVaries (bool b=true)
virtual void  | SetChannelCustom (const CRhRdkVariant &vString)
virtual bool  | SetChannelMode (const CRhRdkVariant &vMode)
virtual void  | SetCheck (UINT u)
virtual void  | SetCheckEnabled (bool b)
void  | SetController (CRhRdkControllerPtr con)
virtual void  | SetReadOnly (bool b)
virtual void  | ShowAmount (bool b)
virtual void  | ShowCheck (bool b)
virtual void  | ShowIcon (bool b)
 Static Public Member Functions
static RDK_DEPRECATED UINT  | ChangedMessageNumber (void)
static RDK_DEPRECATED UINT  | ChangingMessageNumber (void)
static RDK_DEPRECATED void  | NewDataSources (OUT ON_SimpleArray< IRhinoUiDataSource *> &aDS, const CRhRdkDocument *pRdkDoc)
static void  | NewDataSources (OUT ON_SimpleArray< IRhinoUiDataSource *> &aDS, const CRhRdkDocument &rdkDoc)
 Static Public Member Functions inherited from CRhRdkContentCtrlBase
static RDK_DEPRECATED UINT  | AmountMessageNumber (void)
static RDK_DEPRECATED UINT  | CheckMessageNumber (void)
 Protected Member Functions
virtual IRhRdkContentCtrlBase *  | GetBaseInterface (void) const override
RDK_DEPRECATED afx_msg LRESULT  | OnChanged (WPARAM, LPARAM)
RDK_DEPRECATED afx_msg LRESULT  | OnChanging (WPARAM, LPARAM)
 Protected Member Functions inherited from CRhRdkContentCtrlBase
virtual void  | Initialize (void)
RDK_DEPRECATED afx_msg LRESULT  | OnAmount (WPARAM, LPARAM)
RDK_DEPRECATED afx_msg LRESULT  | OnCheck (WPARAM, LPARAM)
afx_msg int  | OnCreate (LPCREATESTRUCT)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnEnable (BOOL bEnable)
afx_msg BOOL  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | PreSubclassWindow () override
 Protected Attributes
CImpl *  | m_pImpl
Detailed Description
Provides a control that supports adding and deleting content by using a context menu and/or a button, or drag and drop.
Constructor & Destructor Documentation
◆ CRhRdkContentCtrl()
 CRhRdkContentCtrl::CRhRdkContentCtrl  |  ( |   | )
◆ ~CRhRdkContentCtrl()
 virtual CRhRdkContentCtrl::~CRhRdkContentCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ AllowedKinds()
 virtual CRhRdkContentKindList CRhRdkContentCtrl::AllowedKinds  |  ( |  void  |   | ) |   const
pure virtual
Returns
The kinds of content associated with the control. This can be a single kind or a semicolon-delimited string of multiple kinds.
Implemented in CRhRdkTextureCtrl, CRhRdkEnvironmentCtrl, and CRhRdkMaterialCtrl.
◆ ChangedMessageNumber()
 static RDK_DEPRECATED UINT CRhRdkContentCtrl::ChangedMessageNumber  |  ( |  void  |   | )
static
◆ ChangingMessageNumber()
 static RDK_DEPRECATED UINT CRhRdkContentCtrl::ChangingMessageNumber  |  ( |  void  |   | )
static
◆ GetBaseInterface()
 virtual IRhRdkContentCtrlBase* CRhRdkContentCtrl::GetBaseInterface  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Implements CRhRdkContentCtrlBase.
◆ GetContentArray()
 virtual bool CRhRdkContentCtrl::GetContentArray  |  ( |  CRhRdkContentArray &  |  aOut | ) |   const
virtual
Get the content(s) referenced by the control.
Returns
true if successful, else false.
◆ InstanceId()
 virtual RDK_DEPRECATED CRhRdkVariant CRhRdkContentCtrl::InstanceId  |  ( |  void  |   | ) |   const
virtual
This method is deprecated in favor of GetContentArray().
◆ NewDataSources() [1/2]
 static RDK_DEPRECATED void CRhRdkContentCtrl::NewDataSources  |  ( |  OUT ON_SimpleArray< IRhinoUiDataSource *> &  |  aDS,
|  const CRhRdkDocument *  |  pRdkDoc
)
static
This method is deprecated in favor of the one below.
◆ NewDataSources() [2/2]
 static void CRhRdkContentCtrl::NewDataSources  |  ( |  OUT ON_SimpleArray< IRhinoUiDataSource *> &  |  aDS,
|  const CRhRdkDocument &  |  rdkDoc
)
static
Get a collection of data sources that are needed to make a content control work.
Parameters
aDS | accepts all the new data sources that the control needs in order to function.
rdkDoc | specifies the document within which the contents reside. The caller should add these to a controller and set the controller to the control. The caller must supply an additional data source to this controller that knows how to get and set the actual data used by IRhRdkContentCtrlInfo. The caller shall delete the data sources when they are no longer needed.
◆ OnChanged()
 RDK_DEPRECATED afx_msg LRESULT CRhRdkContentCtrl::OnChanged  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnChanging()
 RDK_DEPRECATED afx_msg LRESULT CRhRdkContentCtrl::OnChanging  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ SetContentArray()
 virtual bool CRhRdkContentCtrl::SetContentArray  |  ( |  const CRhRdkContentArray &  |  a | )
virtual
Set the content(s) referenced by the control.
Returns
true if successful, else false.
◆ SetInstanceId()
 virtual RDK_DEPRECATED bool CRhRdkContentCtrl::SetInstanceId  |  ( |  const CRhRdkVariant &  |  vInstance,
|  bool  |  bNotify
)
virtual
This method is deprecated in favor of SetContentArray().
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkContentCtrl::m_pImpl
protected