Public Member Functions | List of all members
CRhRdkUndoableEvent Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkUndoableEvent:
 Public Member Functions
CRhRdkUndoableEvent (CRhinoDoc &doc, const wchar_t *wszDesc)
CRhRdkUndoableEvent (CRhinoDoc *pDoc, const wchar_t *wszDesc)
CRhRdkUndoableEvent (const CRhRdkDocument *pRdkDoc, const wchar_t *wszDesc)
virtual  | ~CRhRdkUndoableEvent ()
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Constructor & Destructor Documentation
◆ CRhRdkUndoableEvent() [1/3]
 CRhRdkUndoableEvent::CRhRdkUndoableEvent  |  ( |  CRhinoDoc &  |  doc,
|  const wchar_t *  |  wszDesc
)
◆ CRhRdkUndoableEvent() [2/3]
 CRhRdkUndoableEvent::CRhRdkUndoableEvent  |  ( |  CRhinoDoc *  |  pDoc,
|  const wchar_t *  |  wszDesc
)
◆ CRhRdkUndoableEvent() [3/3]
 CRhRdkUndoableEvent::CRhRdkUndoableEvent  |  ( |  const CRhRdkDocument *  |  pRdkDoc,
|  const wchar_t *  |  wszDesc
)
◆ ~CRhRdkUndoableEvent()
 virtual CRhRdkUndoableEvent::~CRhRdkUndoableEvent  |  ( |   | )
virtual