Public Member Functions | List of all members
CRhRdkSdkRender::CRenderingSourcesView Class Referencefinal
#include <RhRdkSdkRender.h>
 Public Member Functions
CRenderingSourcesView (CRhinoDoc &doc)
~CRenderingSourcesView ()
const ON_3dmView &  | View (void) const
Detailed Description
Returns the right view depending on ON_3dmRenderSettings::RenderingSource().
Constructor & Destructor Documentation
◆ CRenderingSourcesView()
 CRhRdkSdkRender::CRenderingSourcesView::CRenderingSourcesView  |  ( |  CRhinoDoc &  |  doc | )
◆ ~CRenderingSourcesView()
 CRhRdkSdkRender::CRenderingSourcesView::~CRenderingSourcesView  |  ( |   | )
Member Function Documentation
◆ View()
 const ON_3dmView& CRhRdkSdkRender::CRenderingSourcesView::View  |  ( |  void  |   | ) |   const