Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoSdkRenderViewWnd Class Reference
Rhino
CRhinoSdkRenderViewWnd window. More...
#include <RhinoSdkRenderViewWnd.h>
 Inheritance diagram for CRhinoSdkRenderViewWnd:
 Public Member Functions
CRhinoSdkRenderViewWnd (CRhinoSdkRenderFrame *frame)
Construction. More...
virtual  | ~CRhinoSdkRenderViewWnd ()
}}AFX_VIRTUAL More...
virtual bool  | DeleteOnPostNcDestroy () const
bool  | DrawWiresInDIB (CRhinoDib &alpha_dib, CRhinoDib &dib2, CRhinoDib &final_dib)
bool  | DrawWiresInDIB (CRhinoDib &final_dib, bool bGetRenderSettingsFromDoc=true)
bool  | GetWireframeCompositeDIBs (CRhinoDib &dib1, CRhinoDib &dib2, bool bGetRenderSettingsFromDoc=true)
Operations. More...
void  | OnFrameDestruction ()
for internal use only! More...
virtual void  | OnInitialUpdate ()
virtual BOOL  | PreTranslateMessage (MSG *pMsg)
const ON_3dmView &  | View () const
Attributes. More...
 Protected Member Functions
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnPaint ()
{{AFX_MSG(CRhinoSdkRenderViewWnd) More...
virtual void  | PostNcDestroy ()
virtual BOOL  | PreCreateWindow (CREATESTRUCT &cs)
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Attributes
HWND  | m_hWndFrame
CRhinoSdkRenderFrame *  | m_wndFrame
Generated message map functions. More...
Detailed Description
CRhinoSdkRenderViewWnd window.
Copyright (c) 1993-2017 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoSdkRenderViewWnd()
 CRhinoSdkRenderViewWnd::CRhinoSdkRenderViewWnd  |  ( |  CRhinoSdkRenderFrame *  |  frame | )
Construction.
◆ ~CRhinoSdkRenderViewWnd()
 virtual CRhinoSdkRenderViewWnd::~CRhinoSdkRenderViewWnd  |  ( |   | )
virtual
}}AFX_VIRTUAL
Implementation
Member Function Documentation
◆ DeleteOnPostNcDestroy()
 virtual bool CRhinoSdkRenderViewWnd::DeleteOnPostNcDestroy  |  ( |   | ) |   const
virtual
Description: Called by PostNcDestroy. Returns: If true is returned PostNcDestroy will call "delete this"
◆ DrawWiresInDIB() [1/2]
 bool CRhinoSdkRenderViewWnd::DrawWiresInDIB  |  ( |  CRhinoDib &  |  alpha_dib,
|  CRhinoDib &  |  dib2,
|  CRhinoDib &  |  final_dib
)
Description: Composite bitmaps created in CRhinoSdkRenderViewWnd::GetWireframeCompositeDIBs with final_dib. Parameters: alpha_dib [in] - Alpha map for all wireframe and curves. wires_dib [in] - Rendered wireframes and curves in their display colors. final_dib [out] - alpha_dib and wires_dib will be transparently blit to this DIB. Returns: Success == true, failure == false. Comments: See: CRhinoSdkRenderViewWnd::GetWireframeCompositeDIBs
◆ DrawWiresInDIB() [2/2]
 bool CRhinoSdkRenderViewWnd::DrawWiresInDIB  |  ( |  CRhinoDib &  |  final_dib,
|  bool  |  bGetRenderSettingsFromDoc = true
)
Description: Same as calling CRhinoSdkRenderViewWnd::GetWireframeCompositeDIBs( alpha, wires) then CRhinoSdkRenderViewWnd::DrawWiresInDIB( alpha, wires, my_dib); Parameters: final_dib [out] - alpha_dib and wires_dib will be created, transparently blit to this DIB. and destroyed. bGetRenderSettingsFromDoc [in] - Tells compositor to setup render engine using the settings from the Document (true) or Display (false) settings. Returns: Success == true, failure == false. Comments: See: CRhinoSdkRenderViewWnd::GetWireframeCompositeDIBs( CRhinoDib& dib1, CRhinoDib& dib2); CRhinoSdkRenderViewWnd::DrawWiresInDIB( CRhinoDib& alpha_dib, CRhinoDib& dib2, CRhinoDib& final_dib);
◆ GetWireframeCompositeDIBs()
 bool CRhinoSdkRenderViewWnd::GetWireframeCompositeDIBs  |  ( |  CRhinoDib &  |  dib1,
|  CRhinoDib &  |  dib2,
|  bool  |  bGetRenderSettingsFromDoc = true
)
Operations.
Description: Create DIBs used to transparently blit wires to output render DIB. The DIB references passed to this function will contain bitmaps need when calling CRhinoSdkRenderViewWnd::DrawWiresInDIB( alpha_dib, wires_dib, final_dib). If alpha_dib or wires_dib contian an existing bitmap the existing bitmap will be destroyed and a new one created. This all dibs will be created using the specified render output size. Parameters: alpha_dib [out] - Alpha map for all wireframe and curves. wires_dib [out] - Rendered wireframes and curves in their display colors. bGetRenderSettingsFromDoc [in] - Tells compositor to setup render engine using the settings from the Document (true) or Display (false) settings. Returns: true If DIBs are created successfully otherwise returns false. Comments: See: CRhinoSdkRenderViewWnd::DrawWiresInDIB( CRhinoDib& alpha_dib, CRhinoDib& dib2, CRhinoDib& final_dib)
◆ OnFrameDestruction()
 void CRhinoSdkRenderViewWnd::OnFrameDestruction  |  ( |   | )
for internal use only!
◆ OnInitialUpdate()
 virtual void CRhinoSdkRenderViewWnd::OnInitialUpdate  |  ( |   | )
virtual
Description: Called after window is created and just prior to showing window.
◆ OnKeyDown()
 afx_msg void CRhinoSdkRenderViewWnd::OnKeyDown  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
protected
◆ OnPaint()
 afx_msg void CRhinoSdkRenderViewWnd::OnPaint  |  ( |   | )
protected
{{AFX_MSG(CRhinoSdkRenderViewWnd)
◆ PostNcDestroy()
 virtual void CRhinoSdkRenderViewWnd::PostNcDestroy  |  ( |   | )
protectedvirtual
◆ PreCreateWindow()
 virtual BOOL CRhinoSdkRenderViewWnd::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
protectedvirtual
◆ PreTranslateMessage()
 virtual BOOL CRhinoSdkRenderViewWnd::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
Overrides ClassWizard generated virtual function overrides {{AFX_VIRTUAL(CRhinoSdkRenderViewWnd)
◆ View()
 const ON_3dmView& CRhinoSdkRenderViewWnd::View  |  ( |   | ) |   const
Attributes.
◆ WindowProc()
 virtual LRESULT CRhinoSdkRenderViewWnd::WindowProc  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
protectedvirtual
Member Data Documentation
◆ m_hWndFrame
 HWND CRhinoSdkRenderViewWnd::m_hWndFrame
protected
◆ m_wndFrame
 CRhinoSdkRenderFrame* CRhinoSdkRenderViewWnd::m_wndFrame
protected
Generated message map functions.