Public Member Functions | List of all members
CRhinoAnnotationSettingsEx Class Reference
Rhino
#include <rhinoSdkDocProperties.h>
 Public Member Functions
CRhinoAnnotationSettingsEx ()
~CRhinoAnnotationSettingsEx ()
void  | EnableHatchScaling (bool bEnable)
void  | EnableLayoutSpaceAnnotationScaling (bool bEnable)
void  | EnableModelSpaceAnnotationScaling (bool bEnable)
bool  | IsHatchScalingEnabled () const
bool  | IsLayoutSpaceAnnotationScalingEnabled () const
bool  | IsModelSpaceAnnotationScalingEnabled () const
double  | ModelSpaceHatchScale () const
double  | ModelSpaceTextScale () const
void  | SetModelSpaceHatchScale (double scale)
void  | SetModelSpaceTextScale (double scale)
Constructor & Destructor Documentation
◆ CRhinoAnnotationSettingsEx()
 CRhinoAnnotationSettingsEx::CRhinoAnnotationSettingsEx  |  ( |   | )
◆ ~CRhinoAnnotationSettingsEx()
 CRhinoAnnotationSettingsEx::~CRhinoAnnotationSettingsEx  |  ( |   | )
Member Function Documentation
◆ EnableHatchScaling()
 void CRhinoAnnotationSettingsEx::EnableHatchScaling  |  ( |  bool  |  bEnable | )
Parameters: bEnable - [in] Enables or disables Hatch Scaling
◆ EnableLayoutSpaceAnnotationScaling()
 void CRhinoAnnotationSettingsEx::EnableLayoutSpaceAnnotationScaling  |  ( |  bool  |  bEnable | )
Parameters: bEnable - [in] Enables or disables Annotation Scaling
◆ EnableModelSpaceAnnotationScaling()
 void CRhinoAnnotationSettingsEx::EnableModelSpaceAnnotationScaling  |  ( |  bool  |  bEnable | )
Parameters: bEnable - [in] Enables or disables Annotation Scaling
◆ IsHatchScalingEnabled()
 bool CRhinoAnnotationSettingsEx::IsHatchScalingEnabled  |  ( |   | ) |   const
Returns: true if Hatch Scaling is enabled false if not. See comments in ON_3dmAnnotationSettings for more details
◆ IsLayoutSpaceAnnotationScalingEnabled()
 bool CRhinoAnnotationSettingsEx::IsLayoutSpaceAnnotationScalingEnabled  |  ( |   | ) |   const
Returns: true if LayoutSpace Annotation Scaling is enabled false if not. If LayoutSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by dimstyle.m_dimscale when the annotation is displayed in a detail viewport not in a detail
See comments in ON_3dmAnnotationSettings for more details
◆ IsModelSpaceAnnotationScalingEnabled()
 bool CRhinoAnnotationSettingsEx::IsModelSpaceAnnotationScalingEnabled  |  ( |   | ) |   const
Returns: true if ModelSpace Annotation Scaling is enabled false if not. If ModelSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by dimstyle.m_dimscale when the annotation is displayed in a model space viewport not in a detail
See comments in ON_3dmAnnotationSettings for more details
◆ ModelSpaceHatchScale()
 double CRhinoAnnotationSettingsEx::ModelSpaceHatchScale  |  ( |   | ) |   const
14 Jan 2011 - Added hatch scaling functions Returns: The scale factor for hatches in model space when Hatch Scaling is enabled See comments in ON_3dmAnnotationSettings for more details
◆ ModelSpaceTextScale()
 double CRhinoAnnotationSettingsEx::ModelSpaceTextScale  |  ( |   | ) |   const
Returns: The scale factor for text in model space when Annotation Scaling is enabled See comments in ON_3dmAnnotationSettings for more details
◆ SetModelSpaceHatchScale()
 void CRhinoAnnotationSettingsEx::SetModelSpaceHatchScale  |  ( |  double  |  scale | )
Parameters: scale - [in] Sets the scale factor for hatches in model space when Hatch Scaling is enabled
◆ SetModelSpaceTextScale()
 void CRhinoAnnotationSettingsEx::SetModelSpaceTextScale  |  ( |  double  |  scale | )
Parameters: scale - [in] Sets the scale factor for text in model space when Annotation Scaling is enabled