Public Member Functions | Public Attributes | List of all members
CRhRdkBasicMaterial::CTextureSlot Class Reference
#include <RhRdkBasicMaterial.h>
 Inheritance diagram for CRhRdkBasicMaterial::CTextureSlot:
 Public Member Functions
CTextureSlot ()
bool  | operator!= (const CTextureSlot &slot)
bool  | operator== (const CTextureSlot &slot)
void  | ReadParametersFromSection (const IRhRdk_XMLSection &section, CRhRdkContent::ReadParamsContext context)
void  | SetSimulation (IRhRdk_XMLSection &section) const
void  | WriteParametersToSection (IRhRdk_XMLSection &section, CRhRdkContent::WriteParamsContext context) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Attributes
bool  | m_bFilterOn
bool  | m_bOn
double  | m_dAmount
ON_wString  | m_sName
UINT_PTR  | m_uReserved
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Constructor & Destructor Documentation
◆ CTextureSlot()
 CRhRdkBasicMaterial::CTextureSlot::CTextureSlot  |  ( |   | )
Member Function Documentation
◆ operator!=()
 bool CRhRdkBasicMaterial::CTextureSlot::operator!=  |  ( |  const CTextureSlot &  |  slot | )
◆ operator==()
 bool CRhRdkBasicMaterial::CTextureSlot::operator==  |  ( |  const CTextureSlot &  |  slot | )
◆ ReadParametersFromSection()
 void CRhRdkBasicMaterial::CTextureSlot::ReadParametersFromSection  |  ( |  const IRhRdk_XMLSection &  |  section,
|  CRhRdkContent::ReadParamsContext  |  context
)
◆ SetSimulation()
 void CRhRdkBasicMaterial::CTextureSlot::SetSimulation  |  ( |  IRhRdk_XMLSection &  |  section | ) |   const
◆ WriteParametersToSection()
 void CRhRdkBasicMaterial::CTextureSlot::WriteParametersToSection  |  ( |  IRhRdk_XMLSection &  |  section,
|  CRhRdkContent::WriteParamsContext  |  context
) |   |  const
Member Data Documentation
◆ m_bFilterOn
 bool CRhRdkBasicMaterial::CTextureSlot::m_bFilterOn
◆ m_bOn
 bool CRhRdkBasicMaterial::CTextureSlot::m_bOn
◆ m_dAmount
 double CRhRdkBasicMaterial::CTextureSlot::m_dAmount
◆ m_sName
 ON_wString CRhRdkBasicMaterial::CTextureSlot::m_sName
◆ m_uReserved
 UINT_PTR CRhRdkBasicMaterial::CTextureSlot::m_uReserved