Public Member Functions | Static Public Member Functions | List of all members
CRhRdkCity Class Referencefinal
RDK
#include <RhRdkCity.h>
 Public Member Functions
CRhRdkCity ()
CRhRdkCity (const CRhRdkCity &c)
CRhRdkCity (double lon, double lat, double timeZoneHours, const wchar_t *wszName)
~CRhRdkCity ()
double  | Latitude (void) const
double  | Longitude (void) const
bool  | Matches (const CRhRdkCity &c) const
ON_wString  | Name (void) const
const CRhRdkCity &  | operator= (const CRhRdkCity &c)
double  | TimeZone (void) const
 Static Public Member Functions
static int  | Count (void)
static const CRhRdkCity &  | FindNearest (double dLatitude, double dLongitude)
static const CRhRdkCity *  | GetAt (int i)
static void  | GetList (OUT ON_SimpleArray< const CRhRdkCity *> &a)
Constructor & Destructor Documentation
◆ CRhRdkCity() [1/3]
 CRhRdkCity::CRhRdkCity  |  ( |   | )
◆ CRhRdkCity() [2/3]
 CRhRdkCity::CRhRdkCity  |  ( |  const CRhRdkCity &  |  c | )
◆ CRhRdkCity() [3/3]
 CRhRdkCity::CRhRdkCity  |  ( |  double  |  lon,
|  double  |  lat,
|  double  |  timeZoneHours,
|  const wchar_t *  |  wszName
)
◆ ~CRhRdkCity()
 CRhRdkCity::~CRhRdkCity  |  ( |   | )
Member Function Documentation
◆ Count()
 static int CRhRdkCity::Count  |  ( |  void  |   | )
static
Returns
The number of cities in the city list.
◆ FindNearest()
 static const CRhRdkCity& CRhRdkCity::FindNearest  |  ( |  double  |  dLatitude,
|  double  |  dLongitude
)
static
Returns
The nearest city to a position on Earth.
◆ GetAt()
 static const CRhRdkCity* CRhRdkCity::GetAt  |  ( |  int  |  i | )
static
Returns
A city in the city list by index.
◆ GetList()
 static void CRhRdkCity::GetList  |  ( |  OUT ON_SimpleArray< const CRhRdkCity *> &  |  a | )
static
Returns
All the cities in the city list.
◆ Latitude()
 double CRhRdkCity::Latitude  |  ( |  void  |   | ) |   const
Returns
The latitude of the city.
◆ Longitude()
 double CRhRdkCity::Longitude  |  ( |  void  |   | ) |   const
Returns
The longitude of the city.
◆ Matches()
 bool CRhRdkCity::Matches  |  ( |  const CRhRdkCity &  |  c | ) |   const
Returns
true if the city has the same position as another city.
◆ Name()
 ON_wString CRhRdkCity::Name  |  ( |  void  |   | ) |   const
Returns
The localized name of the city.
◆ operator=()
 const CRhRdkCity& CRhRdkCity::operator=  |  ( |  const CRhRdkCity &  |  c | )
◆ TimeZone()
 double CRhRdkCity::TimeZone  |  ( |  void  |   | ) |   const
Returns
The time zone of the city in decimal hours.