Public Member Functions | Protected Member Functions | List of all members
CRhRdkContentUISection_MFC Class Reference
RDK
#include <RhRdkSections_MFC.h>
 Inheritance diagram for CRhRdkContentUISection_MFC:
 Public Member Functions
CRhRdkContentUISection_MFC (unsigned long idi, CWnd *pParent=nullptr)
 Public Member Functions inherited from CRhRdkSectionBase_MFC
CRhRdkSectionBase_MFC (unsigned int idd, CWnd *pParent=nullptr)
void *  | GetData (const UUID &uuidData, bool bForWrite) const
bool  | IsBlocking (void) const
 Public Member Functions inherited from CRhRdkResizingDialog
CRhRdkResizingDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
CRhRdkResizingDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhRdkResizingDialog ()
virtual BOOL  | AddControlString (HWND hwnd, const TCHAR *szText)
virtual void  | EnableDisableControls (void)
virtual BOOL  | IsControlClipped (CWnd *pWnd)
virtual void  | OnPreInitResizing (void)
virtual void  | SetAutoSubclassGroupBoxes (BOOL bSubclass)
virtual void  | SetFillBackground (BOOL bFill)
virtual void  | SetReleaseClipping (BOOL bRelease)
virtual void  | SetResizingConstraints (BOOL bAllowResizeWidth, BOOL bAllowResizeHeight)
 Public Member Functions inherited from CRhinoDialog
CRhinoDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr)
Modal construct. More...
CRhinoDialog (UINT nIDTemplate, CWnd *pParentWnd=nullptr)
virtual  | ~CRhinoDialog ()
CSize  | CalcDialogSize (INT nResourceId)
BOOL  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr) override
Modeless construct. More...
BOOL  | Create (UINT nIDTemplate, CWnd *pParentWnd=nullptr) override
UINT  | DialogID ()
LPCTSTR  | DialogStringID ()
unsigned int  | DocumentSerialNumber () const
virtual INT_PTR  | DoModal ()
bool  | EnableDisplayCommands () const
void  | EnableSaveDialogPositionAndSize (bool bEnable=true, const wchar_t *wRegistryTitle=nullptr)
bool  | IsSaveDialogPositionAndSizeEnabled () const
void  | Localize ()
virtual void  | OnColorButtonClicked (UINT nBtnID)
Called by CRhColorButton if button clicked and color changed;. More...
void  | OnRhinoHelpButton ()
Dialog Utilities. More...
BOOL  | PreTranslateMessage (MSG *pMsg) override
Overrides. More...
bool  | PushPickButton (bool hide_this_dialog)
void  | SetEnableDisplayCommands (bool b, unsigned int documentRuntimeSerialNumber)
void  | SetEnableDisplayCommands (bool b)
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
virtual BOOL  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Public Member Functions inherited from IRhinoUiSection
virtual UUID  | Uuid (void) const =0
 Public Member Functions inherited from IRhinoUiWindow
virtual ON_wString  | Caption (bool bAlwaysEnglish=false) const =0
 Protected Member Functions
virtual  | ~CRhRdkContentUISection_MFC ()
virtual CRhinoCommandOptionName  | CommandOptionName (void) const override
virtual std::shared_ptr< IRhinoUiController >  | Controller (void) const override
virtual ON_UUID  | ControllerId (void) const override
void  | DeferredUpdateUI (void)
virtual void  | Delete (void) override
virtual void  | DisplayData (void) override
virtual void  | Enable (bool bEnable) override
virtual bool  | EnableHeaderButton (int index, bool bEnable) override
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual ON_Color  | GetBackgroundColor (void) const override
virtual int  | GetHeight (void) const override
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const override
virtual HWND  | GetWindow (void) override
virtual IRhinoUiSection &  | Interface (void) override
virtual const IRhinoUiSection &  | Interface (void) const override
virtual void  | InternalOnTimer (UINT_PTR nTimerId) override
virtual bool  | IsCollapsible (void) const override
virtual bool  | IsCreated (void) const override
virtual bool  | IsEnabled (void) const override
virtual bool  | IsHidden (void) const override
virtual bool  | IsInitiallyExpanded (void) const override
virtual bool  | IsShown (void) const override
virtual void  | Move (const ON_4iRect &rect, bool bRepaint=false, bool bRepaintBorder=false) override
virtual IRhRdkHeaderButtonHandler *  | NewHeaderButtonHandler (void) override
virtual void  | OnAttachedToHolder (IRhinoUiHolder &h) override
virtual void  | OnAttachingToHolder (IRhinoUiHolder &h) override
virtual void  | OnControllerActivatedEvent (IRhinoUiController &con) override
virtual void  | OnDetachedFromHolder (IRhinoUiHolder &h) override
virtual void  | OnDetachingFromHolder (IRhinoUiHolder &h) override
virtual void  | OnEvent (IRhinoUiController &con, const UUID &, IRhinoUiController::EventPriority, const IRhinoUiEventInfo *) override
virtual void  | OnExpandSection (bool bExpanding) override
virtual HWND  | Parent (void) const override
virtual UUID  | PlugInId (void) const override
virtual void  | Refresh (bool bImmediate=false) override
virtual CRhinoCommand::result  | RunScript (CRhRdkControllerPtr) override
virtual void  | SetBackgroundColor (const ON_Color &col) override
virtual void  | SetController (std::shared_ptr< IRhinoUiController >) override
virtual void  | SetFocus (void)
virtual void  | SetParent (HWND pParent) override
virtual ON_wString  | SettingsTag (void) const override
virtual void  | Show (bool bShow) override
virtual bool  | ShowHeaderButton (int index, bool bShow) override
virtual bool  | SupportsVaries (const CRhRdkContentArray &aContent) const
void  | UpdateParameter (const wchar_t *wszParam, const CRhRdkVariant &vValue)
virtual void  | UpdateView (unsigned int flags) override
 Protected Member Functions inherited from CRhRdkSectionBase_MFC
virtual  | ~CRhRdkSectionBase_MFC ()
virtual COLORREF  | BackgroundColor (void) const
virtual void  | DeferWindowPositionAndSize (HDWP &hdwp, CWnd &destWnd, CWnd &srceWnd) const
virtual int  | GetDefaultHeight (void) const
virtual unsigned int  | GetIDD (void) const =0
virtual AFX_MODULE_STATE *  | GetModuleState (void) const =0
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnEnable (BOOL bEnable)
afx_msg BOOL  | OnEraseBkgnd (CDC *pDC)
virtual BOOL  | OnInitDialog () override
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnRhinoOptionsSearchShowControlParent (WPARAM, LPARAM)
afx_msg void  | OnTimer (UINT_PTR nTimerId)
virtual BOOL  | PreCreateWindow (CREATESTRUCT &cs) override
virtual void  | Refresh (void)
virtual void  | SetBackgroundColor (COLORREF cr)
virtual void  | SetControlPositionAndSize (void)
virtual void  | SetWindowPositionAndSize (CWnd &destWnd, CWnd &srceWnd) const
 Protected Member Functions inherited from CRhRdkResizingDialog
virtual void  | HideControl (UINT id, int width)
virtual void  | InitControl (UINT id, int l, int t, int r, int b, int o, int iPos)
afx_msg void  | OnDestroy (void)
afx_msg LRESULT  | OnNcHitTest (CPoint)
afx_msg void  | OnSize (UINT, int, int)
afx_msg void  | OnSysCommand (UINT, LPARAM)
afx_msg BOOL  | OnToolTipNotify (UINT, NMHDR *, LRESULT *)
virtual void  | RepositionControls (BOOL bInit)
virtual void  | SizeControl (UINT id, int l, int t, int r, int b, int o, int iPos)
virtual void  | SubclassGroupBoxes ()
virtual void  | UnsubclassGroupBoxes ()
 Protected Member Functions inherited from CRhinoDialog
virtual BOOL  | ContinueModal ()
Implementation. More...
void  | DoDataExchange (CDataExchange *pDX) override
DDX/DDV support. More...
virtual void  | OnCancel ()
virtual BOOL  | OnCommand (WPARAM wParam, LPARAM lParam)
override; ///<not an override on OSX More...
afx_msg void  | OnDestroy ()
afx_msg BOOL  | OnHelpInfo (HELPINFO *pHelpInfo)
virtual void  | OnOK ()
LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam) override
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
BOOL  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
 Protected Member Functions inherited from IRhinoUiSection
virtual  | ~IRhinoUiSection ()
 Protected Member Functions inherited from IRhinoUiWithController
virtual  | ~IRhinoUiWithController ()
 Protected Member Functions inherited from IRhinoUiWindow
virtual  | ~IRhinoUiWindow ()
 Protected Member Functions inherited from IRhinoUiControllerEventWatcher
virtual  | ~IRhinoUiControllerEventWatcher ()
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Public Types inherited from IRhinoUiSection
enum  | : unsigned int { updv_DisplayData = 0x0001, updv_EnableDisable = 0x0002, updv_UpdateLayout = 0x0004 }
 Static Public Member Functions inherited from CRhinoDialog
static int  | CheckSemiModalMessagePump ()
static bool  | InDoSemiModal ()
 Public Attributes inherited from CRhinoDialog
class CRhDialogSdkExtension *  | m__rhino_dialog_sdk_extension
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
Detailed Description
This class represents one shared XP-style section within a IRhinoUiHolder.
Expanding sections that appear in content UIs should be derived from this class instead of CRhRdkSectionBase_MFC. You can then call Content() to access the content that is currently using the UI. Typically your content UI section will be a subclass of CRhRdkMaterialUISection_MFC, CRhRdkEnvironmentUISection_MFC, or CRhRdkTextureUISection_MFC. Your UI will then be able to access the relevant material, environment or texture by calling either the Material(), Environment() or Texture() methods. Contents that do not support UI sharing can still be accessed by a stored pointer inside the section. This is the default to enable legacy code to continue working.
See also
CreateUI()
 DestroyUI()
 CRhRdkMaterialUISection_MFC
 CRhRdkEnvironmentUISection_MFC
 CRhRdkTextureUISection_MFC
Constructor & Destructor Documentation
◆ CRhRdkContentUISection_MFC()
 CRhRdkContentUISection_MFC::CRhRdkContentUISection_MFC  |  ( |  unsigned long  |  idi,
|  CWnd *  |  pParent = nullptr
)
◆ ~CRhRdkContentUISection_MFC()
 virtual CRhRdkContentUISection_MFC::~CRhRdkContentUISection_MFC  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ CommandOptionName()
 virtual CRhinoCommandOptionName CRhRdkContentUISection_MFC::CommandOptionName  |  ( |  void  |   | ) |   const
inlineoverrideprotectedvirtual
Implement this method to return the command option name for scripting. Used by Sun and RenderSettings sections. Should return L"" if no-scripting support.
Implements IRhinoUiSection.
◆ Controller()
 virtual std::shared_ptr<IRhinoUiController> CRhRdkContentUISection_MFC::Controller  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Get the controller associated with this window.
Implements IRhinoUiWithController.
◆ ControllerId()
 virtual ON_UUID CRhRdkContentUISection_MFC::ControllerId  |  ( |  void  |   | ) |   const
inlineoverrideprotectedvirtual
If your UI requires a specific registered controller, return its ID here - otherwise return ON_nil_uuid.
Implements IRhinoUiWithController.
◆ DeferredUpdateUI()
 void CRhRdkContentUISection_MFC::DeferredUpdateUI  |  ( |  void  |   | )
protected
◆ Delete()
 virtual void CRhRdkContentUISection_MFC::Delete  |  ( |  void  |   | )
overrideprotectedvirtual
Destroys the underlying window and deletes the object.
Implements IRhinoUiWindow.
◆ DisplayData()
 virtual void CRhRdkContentUISection_MFC::DisplayData  |  ( |  void  |   | )
overrideprotectedvirtual
Override this method to transfer data into the UI. Typically used to read data from storage and display it in edit boxes, check boxes, combo boxes and so on. The default implementation does nothing.
Reimplemented from CRhRdkResizingDialog.
◆ Enable()
 virtual void CRhRdkContentUISection_MFC::Enable  |  ( |  bool  |  bEnable | )
overrideprotectedvirtual
Enables or disables the window.
Parameters
bEnable | is true to enable the window or false to disable it.
Implements IRhinoUiWindow.
◆ EnableHeaderButton()
 virtual bool CRhRdkContentUISection_MFC::EnableHeaderButton  |  ( |  int  |  index,
|  bool  |  bEnable
)
overrideprotectedvirtual
Enable or disable a header button.
Parameters
index | is the index of the button.
bEnable | is the enable state.
Implements IRhinoUiSection.
◆ EVF()
 virtual void* CRhRdkContentUISection_MFC::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
overrideprotectedvirtual
Reimplemented from CRhRdkResizingDialog.
◆ GetBackgroundColor()
 virtual ON_Color CRhRdkContentUISection_MFC::GetBackgroundColor  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Returns
the background color of the section.
Implements IRhinoUiSection.
◆ GetHeight()
 virtual int CRhRdkContentUISection_MFC::GetHeight  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Returns
the height of the section in pixels. This is usually the same as the default height but can be overridden to enable variable-height sections.
Note
This method is called continuously by the holder and should be implemented to be as fast as possible.
Implements IRhinoUiSection.
◆ GetScreenCoords()
 virtual void CRhRdkContentUISection_MFC::GetScreenCoords  |  ( |  ON_4iRect &  |  rectOut | ) |   const
overrideprotectedvirtual
Get the screen coordinates of the underlying window.
Parameters
rectOut | accepts the coordinates.
Implements IRhinoUiWindow.
◆ GetWindow()
 virtual HWND CRhRdkContentUISection_MFC::GetWindow  |  ( |  void  |   | )
overrideprotectedvirtual
Do not use
Implements IRhinoUiWindow.
◆ Interface() [1/2]
 virtual IRhinoUiSection& CRhRdkContentUISection_MFC::Interface  |  ( |  void  |   | )
overrideprotectedvirtual
Implements CRhRdkSectionBase_MFC.
◆ Interface() [2/2]
 virtual const IRhinoUiSection& CRhRdkContentUISection_MFC::Interface  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Implements CRhRdkSectionBase_MFC.
◆ InternalOnTimer()
 virtual void CRhRdkContentUISection_MFC::InternalOnTimer  |  ( |  UINT_PTR  |  nTimerId | )
overrideprotectedvirtual
Reimplemented from CRhRdkSectionBase_MFC.
◆ IsCollapsible()
 virtual bool CRhRdkContentUISection_MFC::IsCollapsible  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
If this method returns false, the holder will not allow the user to collapse the section.
Returns
true if the section is collapsible, else false.
Implements IRhinoUiSection.
◆ IsCreated()
 virtual bool CRhRdkContentUISection_MFC::IsCreated  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Returns
true if the underlying window has been created, else false.
Implements IRhinoUiWindow.
◆ IsEnabled()
 virtual bool CRhRdkContentUISection_MFC::IsEnabled  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Returns
true if the window is enabled, else false.
Implements IRhinoUiWindow.
◆ IsHidden()
 virtual bool CRhRdkContentUISection_MFC::IsHidden  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Returns
true if the section should be hidden, else false.
Note
This is not to be confused with IRhinoUiWindow::IsShown(). IsHidden() tells the holder whether or not to completely hide the section and its header. IsShown() reports the current visible state of the section window which is invisible even if the section is only collapsed.
 This method is called continuously by the holder and should be implemented to be as fast as possible.
Implements IRhinoUiSection.
◆ IsInitiallyExpanded()
 virtual bool CRhRdkContentUISection_MFC::IsInitiallyExpanded  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Returns
true if the section is initially expanded. This is used to determine the section's default expanded state. Thereafter, the expanded state is remembered by the RDK in the persistent settings.
Implements IRhinoUiSection.
◆ IsShown()
 virtual bool CRhRdkContentUISection_MFC::IsShown  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Returns
true if the window is being shown, else false.
Implements IRhinoUiWindow.
◆ Move()
 virtual void CRhRdkContentUISection_MFC::Move  |  ( |  const ON_4iRect &  |  rect,
|  bool  |  bRepaint = false,
|  bool  |  bRepaintBorder = false
)
overrideprotectedvirtual
Moves the underlying window.
Parameters
rect | is the rectangle to move to within the parent.
Implements IRhinoUiWindow.
◆ NewHeaderButtonHandler()
 virtual IRhRdkHeaderButtonHandler* CRhRdkContentUISection_MFC::NewHeaderButtonHandler  |  ( |  void  |   | )
overrideprotectedvirtual
If you want to create buttons on the header, you should override this method to return a pointer to a new instance of an object that implements IRhRdkHeaderButtonHandler.
Note
RDK takes ownership of this object. If you previously multiple-inherited your section from IRhRdkHeaderButtonHandler, you must change your code so that your header button handler is an independent lightweight object.
See also
IRhRdkHeaderButtonHandler
Implements IRhinoUiSection.
◆ OnAttachedToHolder()
 virtual void CRhRdkContentUISection_MFC::OnAttachedToHolder  |  ( |  IRhinoUiHolder &  |  h | )
overrideprotectedvirtual
Optionally implement this method to handle just after the section is attached to a holder. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ OnAttachingToHolder()
 virtual void CRhRdkContentUISection_MFC::OnAttachingToHolder  |  ( |  IRhinoUiHolder &  |  h | )
overrideprotectedvirtual
Optionally implement this method to handle just before the section is attached to a holder. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ OnControllerActivatedEvent()
 virtual void CRhRdkContentUISection_MFC::OnControllerActivatedEvent  |  ( |  IRhinoUiController &  |  con | )
overrideprotectedvirtual
Implement this method to handle an event when the controller is first activated.
Implements IRhinoUiControllerEventWatcher.
◆ OnDetachedFromHolder()
 virtual void CRhRdkContentUISection_MFC::OnDetachedFromHolder  |  ( |  IRhinoUiHolder &  |  h | )
overrideprotectedvirtual
Optionally implement this method to handle just after the section is detached from a holder. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ OnDetachingFromHolder()
 virtual void CRhRdkContentUISection_MFC::OnDetachingFromHolder  |  ( |  IRhinoUiHolder &  |  h | )
overrideprotectedvirtual
Optionally implement this method to handle just before the section is detached from a holder. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ OnEvent()
 virtual void CRhRdkContentUISection_MFC::OnEvent  |  ( |  IRhinoUiController &  |  con,
|  const UUID &  |  uuidData,
|  IRhinoUiController::EventPriority  |  ep,
|  const IRhinoUiEventInfo *  |  pInfo
)
overrideprotectedvirtual
Implement this method to handle an event when the data of a certain type changes. Your handler will typically transfer data of that type to elements of your user interface.
Parameters
con | is the controller sending the event.
uuidData | is the identifier of the data.
ep | is the event priority.
pInfo | is an optional pointer to extra event-specific information. This is often null.
See also
IRhinoUiDataSource::RegisterEventWatcher().
Implements IRhinoUiControllerEventWatcher.
◆ OnExpandSection()
 virtual void CRhRdkContentUISection_MFC::OnExpandSection  |  ( |  bool  |  bExpanding | )
overrideprotectedvirtual
Optionally implement this method to handle when the section is expanded or closed-up. This happens when the user clicks the section header. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ Parent()
 virtual HWND CRhRdkContentUISection_MFC::Parent  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Get the parent (host) window. This will return null unless a parent has been set in SetParent().
Implements IRhinoUiWindow.
◆ PlugInId()
 virtual UUID CRhRdkContentUISection_MFC::PlugInId  |  ( |  void  |   | ) |   const
inlineoverrideprotectedvirtual
Implement this method to return your plug-in id. Determines visibility for Sun and RenderSettings sections based on the current renderer.
Implements IRhinoUiSection.
◆ Refresh()
 virtual void CRhRdkContentUISection_MFC::Refresh  |  ( |  bool  |  bImmediate = false | )
overrideprotectedvirtual
Refreshes the window by repainting it.
Parameters
bImmediate | is true if the window should be repainted immediately, else false.
Note
On Microsoft Windows, Refresh(true) is equivalent to RedrawWindow() and Refresh(false) is equivalent to Invalidate().
Implements IRhinoUiWindow.
◆ RunScript()
 virtual CRhinoCommand::result CRhRdkContentUISection_MFC::RunScript  |  ( |  CRhRdkControllerPtr  |  con | )
inlineoverrideprotectedvirtual
Implement this method to do scripting.
Parameters
con | is the controller to use to get and set your data items. Used by Sun and RenderSettings sections.
Implements IRhinoUiSection.
◆ SetBackgroundColor()
 virtual void CRhRdkContentUISection_MFC::SetBackgroundColor  |  ( |  const ON_Color &  |  col | )
overrideprotectedvirtual
Set the background color of the section.
Parameters
col | is the color to use.
Implements IRhinoUiSection.
◆ SetController()
 virtual void CRhRdkContentUISection_MFC::SetController  |  ( |  std::shared_ptr< IRhinoUiController >  |  con | )
overrideprotectedvirtual
Set the controller associated with this window.
Implements IRhinoUiWithController.
◆ SetFocus()
 virtual void CRhRdkContentUISection_MFC::SetFocus  |  ( |  void  |   | )
protectedvirtual
Sets the keyboard focus to the window.
Implements IRhinoUiWindow.
◆ SetParent()
 virtual void CRhRdkContentUISection_MFC::SetParent  |  ( |  HWND  |  parent | )
overrideprotectedvirtual
Set the parent (host) window.
Parameters
parent | is the parent to host the window on.
Note
When the object uses a controller, the controller must be set before calling SetParent() otherwise creation of the underlying control may fail.
Implements IRhinoUiWindow.
◆ SettingsTag()
 virtual ON_wString CRhRdkContentUISection_MFC::SettingsTag  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Implement this method to return a unique string used to identify the section when loading and saving the section's state. This can usually be implemented to return a string version of the section's Uuid() unless something special is needed.
Implements IRhinoUiSection.
◆ Show()
 virtual void CRhRdkContentUISection_MFC::Show  |  ( |  bool  |  bShow | )
overrideprotectedvirtual
Shows or hides the window.
Parameters
bShow | is true to show the window or false to hide it.
Implements IRhinoUiWindow.
◆ ShowHeaderButton()
 virtual bool CRhRdkContentUISection_MFC::ShowHeaderButton  |  ( |  int  |  index,
|  bool  |  bShow
)
overrideprotectedvirtual
Show or hide a header button.
Parameters
index | is the index of the button.
bShow | is the show state.
Implements IRhinoUiSection.
◆ SupportsVaries()
 virtual bool CRhRdkContentUISection_MFC::SupportsVaries  |  ( |  const CRhRdkContentArray &  |  aContent | ) |   const
protectedvirtual
Query if the section 'supports varies'. Some sections can only display information for a single content at a time. Such sections do not 'support varies'. Other sections can display information for multiple contents at the same time. If the data in the contents is conflicting, the display shows 'varies' instead of a single value. Sections that support this feature are said to 'support varies'. Such sections will implement this method to return true when the contents are favorable.
Parameters
aContent | is the array of content to check.
Returns
true if 'varies' is supported for the given contents, else false.
Reimplemented in CRhRdkVariesTextureUISection_MFC, CRhRdkVariesEnvironmentUISection_MFC, and CRhRdkVariesMaterialUISection_MFC.
◆ UpdateParameter()
 void CRhRdkContentUISection_MFC::UpdateParameter  |  ( |  const wchar_t *  |  wszParam,
|  const CRhRdkVariant &  |  vValue
)
protected
◆ UpdateView()
 virtual void CRhRdkContentUISection_MFC::UpdateView  |  ( |  unsigned int  |  flags | )
overrideprotectedvirtual
Updates the 'view' of the section according to the specified flags.
Parameters
flags | specifies what to update. See the enum above.
Implements IRhinoUiSection.