Public Member Functions | Public Attributes | Friends | List of all members
CRhinoCacheHandle Class Reference
Rhino
#include <rhinoSdkObject.h>
 Public Member Functions
CRhinoCacheHandle ()=default
const CRhinoObject *  | ParentObject () const
 Public Attributes
std::shared_ptr< class CRhCacheData >  | m_cache_data
std::shared_ptr< class CRhVboCurveSetData >  | m_vbo_curve_data
std::shared_ptr< class CRhVboData >  | m_vbo_data
 Friends
class  | CRhinoObject
Detailed Description
Copyright (c) 1993-2017 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoCacheHandle()
 CRhinoCacheHandle::CRhinoCacheHandle  |  ( |   | )
default
Member Function Documentation
◆ ParentObject()
 const CRhinoObject* CRhinoCacheHandle::ParentObject  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ CRhinoObject
 friend class CRhinoObject
friend
Member Data Documentation
◆ m_cache_data
 std::shared_ptr<class CRhCacheData> CRhinoCacheHandle::m_cache_data
◆ m_vbo_curve_data
 std::shared_ptr<class CRhVboCurveSetData> CRhinoCacheHandle::m_vbo_curve_data
◆ m_vbo_data
 std::shared_ptr<class CRhVboData> CRhinoCacheHandle::m_vbo_data