Public Member Functions | List of all members
CRhRdkIORManager Class Referencefinal
RDK
#include <RhRdkIORManager.h>
 Public Member Functions
CRhRdkIORManager ()
CRhRdkIORManager (const wchar_t *wszFilename)
~CRhRdkIORManager ()
void  | BuildMenu (class IRhRdkMenu &menu)
bool  | GetIORForCmd (unsigned short cmd, double &dIOROut, ON_wString *pStringOut=nullptr) const
Detailed Description
This is a stack object that you can use to implement a menu containing IORs for various materials.
Constructor & Destructor Documentation
◆ CRhRdkIORManager() [1/2]
 CRhRdkIORManager::CRhRdkIORManager  |  ( |   | )
◆ CRhRdkIORManager() [2/2]
 CRhRdkIORManager::CRhRdkIORManager  |  ( |  const wchar_t *  |  wszFilename | )
◆ ~CRhRdkIORManager()
 CRhRdkIORManager::~CRhRdkIORManager  |  ( |   | )
Member Function Documentation
◆ BuildMenu()
 void CRhRdkIORManager::BuildMenu  |  ( |  class IRhRdkMenu &  |  menu | )
◆ GetIORForCmd()
 bool CRhRdkIORManager::GetIORForCmd  |  ( |  unsigned short  |  cmd,
|  double &  |  dIOROut,
|  ON_wString *  |  pStringOut = nullptr
) |   |  const