Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
CRhRdkSubNodeCtrl Class Reference
RDK
#include <RhRdkSubNodeCtrl.h>
 Inheritance diagram for CRhRdkSubNodeCtrl:
 Public Member Functions
CRhRdkSubNodeCtrl ()
virtual  | ~CRhRdkSubNodeCtrl ()
virtual ON_wString  | ChildSlotName (void) const
virtual RDK_DEPRECATED UUID  | ParentInstanceId (void) const
virtual bool  | ParentInstanceIdList (CRhRdkUuidCollection &ucOut) const
virtual void  | SetChildSlotName (const ON_wString &sChildSlotName)
virtual RDK_DEPRECATED bool  | SetParentInstanceId (const UUID &)
virtual RDK_DEPRECATED bool  | SetParentInstanceIdList (const CRhRdkUuidCollection &uc)
virtual bool  | Varies (void) const
 Public Member Functions inherited from CRhRdkContentCtrlBase
CRhRdkContentCtrlBase ()
virtual  | ~CRhRdkContentCtrlBase ()
virtual bool  | AmountEnabled (void) const
virtual bool  | AmountVaries (void) const
virtual void  | Change (void)
virtual bool  | CheckEnabled (void) const
CRhRdkControllerPtr  | Controller (void) const
virtual bool  | CreateWnd (DWORD dwStyle, const RECT &rect, CWnd *pParent, UINT uID)
virtual void  | DisplayData (void)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual double  | GetAmount (void) const
virtual CRhRdkVariant  | GetChannelCustom (void) const
virtual CRhRdkVariant  | GetChannelMode (void) const
virtual UINT  | GetCheck (void) const
virtual bool  | IsEmpty (void) const
virtual void  | OnAmountChanged (void)
virtual void  | OnChange (void)
virtual void  | OnCheckChanged (void)
virtual bool  | ReadOnly (void) const
virtual void  | SetAmount (double d)
virtual void  | SetAmountBounds (double dMin, double dMax)
virtual void  | SetAmountEnabled (bool b)
virtual void  | SetAmountVaries (bool b=true)
virtual void  | SetChannelCustom (const CRhRdkVariant &vString)
virtual bool  | SetChannelMode (const CRhRdkVariant &vMode)
virtual void  | SetCheck (UINT u)
virtual void  | SetCheckEnabled (bool b)
void  | SetController (CRhRdkControllerPtr con)
virtual void  | SetReadOnly (bool b)
virtual void  | ShowAmount (bool b)
virtual void  | ShowCheck (bool b)
virtual void  | ShowIcon (bool b)
 Static Public Member Functions
static RDK_DEPRECATED UINT  | ChangedMessageNumber (void)
static RDK_DEPRECATED UINT  | ChangingMessageNumber (void)
 Static Public Member Functions inherited from CRhRdkContentCtrlBase
static RDK_DEPRECATED UINT  | AmountMessageNumber (void)
static RDK_DEPRECATED UINT  | CheckMessageNumber (void)
 Protected Member Functions
virtual IRhRdkContentCtrlBase *  | GetBaseInterface (void) const override
RDK_DEPRECATED afx_msg LRESULT  | OnChanged (WPARAM, LPARAM)
RDK_DEPRECATED afx_msg LRESULT  | OnChanging (WPARAM, LPARAM)
 Protected Member Functions inherited from CRhRdkContentCtrlBase
virtual void  | Initialize (void)
RDK_DEPRECATED afx_msg LRESULT  | OnAmount (WPARAM, LPARAM)
RDK_DEPRECATED afx_msg LRESULT  | OnCheck (WPARAM, LPARAM)
afx_msg int  | OnCreate (LPCREATESTRUCT)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnEnable (BOOL bEnable)
afx_msg BOOL  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | PreSubclassWindow () override
Detailed Description
Provides a control that supports adding and deleting sub-nodes (content children) by using a context menu and/or a button, or drag and drop.
Constructor & Destructor Documentation
◆ CRhRdkSubNodeCtrl()
 CRhRdkSubNodeCtrl::CRhRdkSubNodeCtrl  |  ( |   | )
◆ ~CRhRdkSubNodeCtrl()
 virtual CRhRdkSubNodeCtrl::~CRhRdkSubNodeCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ ChangedMessageNumber()
 static RDK_DEPRECATED UINT CRhRdkSubNodeCtrl::ChangedMessageNumber  |  ( |  void  |   | )
static
◆ ChangingMessageNumber()
 static RDK_DEPRECATED UINT CRhRdkSubNodeCtrl::ChangingMessageNumber  |  ( |  void  |   | )
static
◆ ChildSlotName()
 virtual ON_wString CRhRdkSubNodeCtrl::ChildSlotName  |  ( |  void  |   | ) |   const
virtual
Returns
The child slot name of the associated child content.
◆ GetBaseInterface()
 virtual IRhRdkContentCtrlBase* CRhRdkSubNodeCtrl::GetBaseInterface  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Implements CRhRdkContentCtrlBase.
◆ OnChanged()
 RDK_DEPRECATED afx_msg LRESULT CRhRdkSubNodeCtrl::OnChanged  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnChanging()
 RDK_DEPRECATED afx_msg LRESULT CRhRdkSubNodeCtrl::OnChanging  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ ParentInstanceId()
 virtual RDK_DEPRECATED UUID CRhRdkSubNodeCtrl::ParentInstanceId  |  ( |  void  |   | ) |   const
virtual
This method is deprecated in favor of ParentInstanceIdList().
◆ ParentInstanceIdList()
 virtual bool CRhRdkSubNodeCtrl::ParentInstanceIdList  |  ( |  CRhRdkUuidCollection &  |  ucOut | ) |   const
virtual
Returns
A collection of instance ids of the parent contents referenced by the control.
Parameters
ucOut | accepts the collection of instance ids.
Returns
true if the collection contains at least one item, else false.
◆ SetChildSlotName()
 virtual void CRhRdkSubNodeCtrl::SetChildSlotName  |  ( |  const ON_wString &  |  sChildSlotName | )
virtual
Set the child slot name of the associated child content.
Parameters
sChildSlotName | is the name of the associated child slot.
◆ SetParentInstanceId()
 virtual RDK_DEPRECATED bool CRhRdkSubNodeCtrl::SetParentInstanceId  |  ( |  const UUID &  |   | )
virtual
This method is deprecated because the control is now data-aware and is able to get its parents automatically. Where you would have called this method in the past, please call DisplayData() instead.
◆ SetParentInstanceIdList()
 virtual RDK_DEPRECATED bool CRhRdkSubNodeCtrl::SetParentInstanceIdList  |  ( |  const CRhRdkUuidCollection &  |  uc | )
virtual
This method is deprecated because the control is now data-aware and is able to get its parents automatically. Where you would have called this method in the past, please call DisplayData() instead.
◆ Varies()
 virtual bool CRhRdkSubNodeCtrl::Varies  |  ( |  void  |   | ) |   const
virtual
Returns
true if the control is displaying "(varies)", else false.