Public Member Functions | Public Attributes | List of all members
ON_ClippingPlaneInfo Class Reference
OpenNURBS
#include <opennurbs_plane.h>
 Public Member Functions
void  | Default ()
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bEnabled
ON_PlaneEquation  | m_plane_equation
ON_UUID  | m_plane_id
Member Function Documentation
◆ Default()
 void ON_ClippingPlaneInfo::Default  |  ( |   | )
◆ Read()
 bool ON_ClippingPlaneInfo::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_ClippingPlaneInfo::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bEnabled
 bool ON_ClippingPlaneInfo::m_bEnabled
◆ m_plane_equation
 ON_PlaneEquation ON_ClippingPlaneInfo::m_plane_equation
C++ defaults for construction, destruction, copy construction and operator= work fine. A point is visible if m_plane_equation.ValueAt(point) <= 0. (This is the opposite convention from what OpenGL uses.)
◆ m_plane_id
 ON_UUID ON_ClippingPlaneInfo::m_plane_id