Public Member Functions | Public Attributes | List of all members
ON_SurfaceCurvature Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Public Member Functions
double  | GaussianCurvature () const
double  | MaximumRadius () const
double  | MeanCurvature () const
double  | MinimumRadius () const
 Public Attributes
double  | k1
double  | k2
principal curvatures More...
Detailed Description
ON_SurfaceCurvature
Member Function Documentation
◆ GaussianCurvature()
 double ON_SurfaceCurvature::GaussianCurvature  |  ( |   | ) |   const
◆ MaximumRadius()
 double ON_SurfaceCurvature::MaximumRadius  |  ( |   | ) |   const
◆ MeanCurvature()
 double ON_SurfaceCurvature::MeanCurvature  |  ( |   | ) |   const
◆ MinimumRadius()
 double ON_SurfaceCurvature::MinimumRadius  |  ( |   | ) |   const
Member Data Documentation
◆ k1
 double ON_SurfaceCurvature::k1
◆ k2
 double ON_SurfaceCurvature::k2
principal curvatures