Public Member Functions | Public Attributes | List of all members
CRhinoGumball Class Reference
Rhino
#include <rhinoSdkGumball.h>
 Public Member Functions
CRhinoGumball ()
ON_BoundingBox  | BoundingBox (const CRhinoViewport &viewport) const
void  | DrawDynamicGumball (CRhinoDisplayPipeline &dp, GUMBALL_MODE gumball_mode, const ON_Line &drag_line, const CRhinoGumballFrame &start_frame, GUMBALL_MODE highlight_mode=gb_mode_nothing) const
void  | DrawStaticGumball (CRhinoDisplayPipeline &dp, GUMBALL_MODE highlight_mode=gb_mode_nothing) const
bool  | GetPopUpMenuPoint (const CRhinoViewport &vp, ON_2iPoint &popup_menu_point) const
bool  | IsValid () const
bool  | Pick (const CRhinoPickContext &pick_context, CRhinoGumballPickResult &pick_result) const
bool  | Read (ON_BinaryArchive &binary_archive)
bool  | SetCenter (const ON_3dPoint &center)
bool  | SetFromArc (const ON_Arc &arc)
bool  | SetFromBoundingBox (ON_BoundingBox bbox)
bool  | SetFromBoundingBox (ON_Plane frame, ON_BoundingBox bbox)
bool  | SetFromCircle (const ON_Circle &circle)
bool  | SetFromCurve (const ON_Curve &curve)
bool  | SetFromEllipse (const ON_Ellipse &ellipse)
bool  | SetFromExtrusion (const ON_Extrusion &extrusion)
bool  | SetFromHatch (const ON_Hatch &hatch)
bool  | SetFromLight (const ON_Light &light)
bool  | SetFromLine (const ON_Line &line)
bool  | SetFromPlane (const ON_Plane &plane)
void  | SetToDefaultGumball ()
bool  | Transform (const ON_Xform &xform)
bool  | Write (ON_BinaryArchive &binary_archive) const
 Public Attributes
CRhinoGumballAppearance  | m_appearance
CRhinoGumballFrame  | m_frame
Detailed Description
CRhinoGumball class - frame and appearance settings
Constructor & Destructor Documentation
◆ CRhinoGumball()
 CRhinoGumball::CRhinoGumball  |  ( |   | )
Member Function Documentation
◆ BoundingBox()
 ON_BoundingBox CRhinoGumball::BoundingBox  |  ( |  const CRhinoViewport &  |  viewport | ) |   const
Returns: World coordinate bounding box. The bounding box depends on the viewport that is displaying the gumball.
◆ DrawDynamicGumball()
 void CRhinoGumball::DrawDynamicGumball  |  ( |  CRhinoDisplayPipeline &  |  dp,
|  GUMBALL_MODE  |  gumball_mode,
|  const ON_Line &  |  drag_line,
|  const CRhinoGumballFrame &  |  start_frame,
|  GUMBALL_MODE  |  highlight_mode = gb_mode_nothing
) |   |  const
Description: Draw gumball and dragging decorations that indicate how the gumball is moving. Parameters: dp - [in] gumball_mode - [in] gb_mode_nothing will draw complete gumball or pass the mode returned by CRhinoGumball::Pick(...) to draw what matters when a dynamic drag is happening. drag_line - [in] line returned by m_frame.Drag(...) start_frame - [in] starting point for the gumball highlight_mode - [in] indicates which gumball element to draw highlighted
◆ DrawStaticGumball()
 void CRhinoGumball::DrawStaticGumball  |  ( |  CRhinoDisplayPipeline &  |  dp,
|  GUMBALL_MODE  |  highlight_mode = gb_mode_nothing
) |   |  const
Description: Draw gumball. Parameters: dp - [in] highlight_mode - [in] indicates which gumball element to draw highlighted
◆ GetPopUpMenuPoint()
 bool CRhinoGumball::GetPopUpMenuPoint  |  ( |  const CRhinoViewport &  |  vp,
|  ON_2iPoint &  |  popup_menu_point
) |   |  const
Description: Get the location of a gumball menu ball in window coordinates. Useful when calling CRhinoGumballPopUpMenu::ShowMenu(). Parameters: vp - [in] Typically CRhinoView.Viewport().VP() popup_menu_point - [out] Returns: true if popup_menu_point was set.
◆ IsValid()
 bool CRhinoGumball::IsValid  |  ( |   | ) |   const
◆ Pick()
 bool CRhinoGumball::Pick  |  ( |  const CRhinoPickContext &  |  pick_context,
|  CRhinoGumballPickResult &  |  pick_result
) |   |  const
◆ Read()
 bool CRhinoGumball::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
◆ SetCenter()
 bool CRhinoGumball::SetCenter  |  ( |  const ON_3dPoint &  |  center | )
◆ SetFromArc()
 bool CRhinoGumball::SetFromArc  |  ( |  const ON_Arc &  |  arc | )
◆ SetFromBoundingBox() [1/2]
 bool CRhinoGumball::SetFromBoundingBox  |  ( |  ON_BoundingBox  |  bbox | )
◆ SetFromBoundingBox() [2/2]
 bool CRhinoGumball::SetFromBoundingBox  |  ( |  ON_Plane  |  frame,
|  ON_BoundingBox  |  bbox
)
◆ SetFromCircle()
 bool CRhinoGumball::SetFromCircle  |  ( |  const ON_Circle &  |  circle | )
◆ SetFromCurve()
 bool CRhinoGumball::SetFromCurve  |  ( |  const ON_Curve &  |  curve | )
◆ SetFromEllipse()
 bool CRhinoGumball::SetFromEllipse  |  ( |  const ON_Ellipse &  |  ellipse | )
◆ SetFromExtrusion()
 bool CRhinoGumball::SetFromExtrusion  |  ( |  const ON_Extrusion &  |  extrusion | )
◆ SetFromHatch()
 bool CRhinoGumball::SetFromHatch  |  ( |  const ON_Hatch &  |  hatch | )
◆ SetFromLight()
 bool CRhinoGumball::SetFromLight  |  ( |  const ON_Light &  |  light | )
◆ SetFromLine()
 bool CRhinoGumball::SetFromLine  |  ( |  const ON_Line &  |  line | )
◆ SetFromPlane()
 bool CRhinoGumball::SetFromPlane  |  ( |  const ON_Plane &  |  plane | )
◆ SetToDefaultGumball()
 void CRhinoGumball::SetToDefaultGumball  |  ( |   | )
◆ Transform()
 bool CRhinoGumball::Transform  |  ( |  const ON_Xform &  |  xform | )
◆ Write()
 bool CRhinoGumball::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
Member Data Documentation
◆ m_appearance
 CRhinoGumballAppearance CRhinoGumball::m_appearance
◆ m_frame
 CRhinoGumballFrame CRhinoGumball::m_frame