Public Member Functions | List of all members
CRhRdkDecalWidgetGeometry Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkDecalWidgetGeometry:
 Public Member Functions
CRhRdkDecalWidgetGeometry ()
CRhRdkDecalWidgetGeometry (unsigned int doc_sn, const UUID &uuidObject, const UUID &uuidDecal, IRhRdkDecal::eMapping m)
virtual  | ~CRhRdkDecalWidgetGeometry ()
virtual bool  | AddToDrawCache (IRhWidgetDrawCache &wdc, const ON_Xform &xformLocal, const UUID &uuidObject) override
void  | ApplyTransformation (const ON_Xform &xform) const
IRhRdkDecal::eMapping  | DecalMapping (void) const
void  | GetGripPoints (ON_3dPointArray &aOut) const
bool  | GetXformTrans (ON_Xform &xformTransOut) const
bool  | IsAssociatedWithObject (const CRhinoObject &obj) const
const CRhRdkDecalWidgetGeometry &  | operator= (const CRhRdkDecalWidgetGeometry &g)
void  | SetSweepAngles (const CSweep::CAngles &angles)
bool  | SnapTo (const CRhinoSnapContext &sc, CRhinoSnapEvent &se) const
 Public Member Functions inherited from CRhinoWidgetGeometry
CRhinoWidgetGeometry ()
CRhinoWidgetGeometry (const CRhinoWidgetGeometry &g)
virtual  | ~CRhinoWidgetGeometry ()
virtual void  | AddAxesToDrawCache (IRhWidgetDrawCache &wdc, const ON_Xform &xform, const UUID &uuidObject) const
Test function. More...
virtual void  | AddBoxToDrawCache (IRhWidgetDrawCache &wdc, const ON_Xform &xform, const UUID &uuidObject) const
virtual void  | AddCylinderToDrawCache (IRhWidgetDrawCache &wdc, const ON_Xform &xform, const UUID &uuidObject, bool bCapped, const CSweep *pSweep=NULL) const
virtual void  | AddEllipsoidToDrawCache (IRhWidgetDrawCache &wdc, const ON_Xform &xform, const UUID &uuidObject, const CSweep *pSweep=NULL) const
virtual void  | AddPlaneToDrawCache (IRhWidgetDrawCache &wdc, const ON_Xform &xform, const UUID &uuidObject, bool bCapped, eDrawNormal dn) const
void  | CleanupGeometryCache (void) const
CRhinoDoc *  | Document (void) const
const CRhinoWidgetGeometry &  | operator= (const CRhinoWidgetGeometry &)
void  | SetDocument (const CRhinoDoc &doc)
void  | SetMapEntry (int iChannelId, const UUID &uuidObject, const ON_TextureMapping &m, const ON_Xform &xformLocal, const CRhinoDoc *pDoc)
void  | Start (const CRhinoDoc *doc)
void  | Stop ()
bool  | Transform (const ON_Xform &xform) override
bool  | Transforming (ON_Xform &xformToApply) const
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
virtual bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
virtual bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const
virtual bool  | HasBrepForm () const
virtual bool  | IsDeformable () const
virtual bool  | IsMorphable () const
virtual bool  | MakeDeformable ()
virtual bool  | Morph (const class ON_SpaceMorph &morph)
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
virtual ON::object_type  | ObjectType () const
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
virtual unsigned int  | SizeOf () const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Additional Inherited Members
 Public Types inherited from CRhinoWidgetGeometry
enum  | eDrawNormal { dn_none, dn_forward, dn_backward, dn_both }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
static const ON_Geometry  | Unset
 Protected Member Functions inherited from CRhinoWidgetGeometry
virtual int  | Dimension (void) const
< Implement ON_Geometry. More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override More...
CImpl &  | Impl (void) const
bool  | IsValid (ON_TextLog *text_log=nullptr) const override
Constructor & Destructor Documentation
◆ CRhRdkDecalWidgetGeometry() [1/2]
 CRhRdkDecalWidgetGeometry::CRhRdkDecalWidgetGeometry  |  ( |   | )
◆ CRhRdkDecalWidgetGeometry() [2/2]
 CRhRdkDecalWidgetGeometry::CRhRdkDecalWidgetGeometry  |  ( |  unsigned int  |  doc_sn,
|  const UUID &  |  uuidObject,
|  const UUID &  |  uuidDecal,
|  IRhRdkDecal::eMapping  |  m
)
◆ ~CRhRdkDecalWidgetGeometry()
 virtual CRhRdkDecalWidgetGeometry::~CRhRdkDecalWidgetGeometry  |  ( |   | )
virtual
Member Function Documentation
◆ AddToDrawCache()
 virtual bool CRhRdkDecalWidgetGeometry::AddToDrawCache  |  ( |  IRhWidgetDrawCache &  |  wdc,
|  const ON_Xform &  |  xformLocal,
|  const UUID &  |  uuidObject
)
overridevirtual
Implements CRhinoWidgetGeometry.
◆ ApplyTransformation()
 void CRhRdkDecalWidgetGeometry::ApplyTransformation  |  ( |  const ON_Xform &  |  xform | ) |   const
◆ DecalMapping()
 IRhRdkDecal::eMapping CRhRdkDecalWidgetGeometry::DecalMapping  |  ( |  void  |   | ) |   const
◆ GetGripPoints()
 void CRhRdkDecalWidgetGeometry::GetGripPoints  |  ( |  ON_3dPointArray &  |  aOut | ) |   const
◆ GetXformTrans()
 bool CRhRdkDecalWidgetGeometry::GetXformTrans  |  ( |  ON_Xform &  |  xformTransOut | ) |   const
◆ IsAssociatedWithObject()
 bool CRhRdkDecalWidgetGeometry::IsAssociatedWithObject  |  ( |  const CRhinoObject &  |  obj | ) |   const
◆ operator=()
 const CRhRdkDecalWidgetGeometry& CRhRdkDecalWidgetGeometry::operator=  |  ( |  const CRhRdkDecalWidgetGeometry &  |  g | )
◆ SetSweepAngles()
 void CRhRdkDecalWidgetGeometry::SetSweepAngles  |  ( |  const CSweep::CAngles &  |  angles | )
◆ SnapTo()
 bool CRhRdkDecalWidgetGeometry::SnapTo  |  ( |  const CRhinoSnapContext &  |  sc,
|  CRhinoSnapEvent &  |  se
) |   |  const