Public Member Functions | List of all members
CRhRdkToneMapper_ImageBased Class Referenceabstract
RDK
#include <RhRdkToneMappers.h>
 Inheritance diagram for CRhRdkToneMapper_ImageBased:
 Public Member Functions
virtual void  | ProcessImage (CRhRdkHighDynamicRangeImage_RGB &image, CRhRdkProgress *pProgress)=0
 Public Member Functions inherited from CRhRdkToneMapper
virtual  | ~CRhRdkToneMapper ()
virtual ON_wString  | GetFriendlyParamName (const wchar_t *wszParamName, bool bEnglish) const =0
virtual void  | GetParametersFromSection (const IRhRdk_XMLSection &section)=0
virtual void  | SetParametersToSection (IRhRdk_XMLSection &section) const =0
Member Function Documentation
◆ ProcessImage()
 virtual void CRhRdkToneMapper_ImageBased::ProcessImage  |  ( |  CRhRdkHighDynamicRangeImage_RGB &  |  image,
|  CRhRdkProgress *  |  pProgress
)
pure virtual
Implemented in CRhRdkToneMapper_Logarithmic.