Public Member Functions | Public Attributes | List of all members
CRhinoApp::CRhMruCommandRecord Class Reference
#include <rhinoSdkApp.h>
 Public Member Functions
CRhMruCommandRecord (const wchar_t *=nullptr, const wchar_t *=nullptr)
const wchar_t *  | DisplayString () const
void  | EmptyRecord ()
 Public Attributes
ON_wString  | m_display_string
ON_wString  | m_macro
Detailed Description
Description: MRU command list contains list of recently run macros/commands Returns: Reference to MRU command list.
Constructor & Destructor Documentation
◆ CRhMruCommandRecord()
 CRhinoApp::CRhMruCommandRecord::CRhMruCommandRecord  |  ( |  const wchar_t *  |   = nullptr,
|  const wchar_t *  |   = nullptr
)
Member Function Documentation
◆ DisplayString()
 const wchar_t* CRhinoApp::CRhMruCommandRecord::DisplayString  |  ( |   | ) |   const
◆ EmptyRecord()
 void CRhinoApp::CRhMruCommandRecord::EmptyRecord  |  ( |   | )
Member Data Documentation
◆ m_display_string
 ON_wString CRhinoApp::CRhMruCommandRecord::m_display_string
◆ m_macro
 ON_wString CRhinoApp::CRhMruCommandRecord::m_macro