Public Member Functions | List of all members
CRhRdkPreviewAppearance Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkPreviewAppearance:
 Public Member Functions
CRhRdkPreviewAppearance ()
CRhRdkPreviewAppearance (const CRhRdkContent *pContent)
CRhRdkPreviewAppearance (const CRhRdkPreviewAppearance &v)
virtual  | ~CRhRdkPreviewAppearance ()
virtual const CRhRdkPreviewBackground *  | Background (void) const
virtual void  | FromMetaData (const IRhRdkPreviewSettings::IMetaData &m)
virtual const CRhRdkPreviewGeometry *  | Geometry (void) const
virtual const CRhRdkPreviewLighting *  | Lighting (void) const
virtual void  | LoadFromDefaults (const IRhRdkPreviewAppearanceDefaults &viewDefaults)
virtual const CRhRdkPreviewAppearance &  | operator= (const CRhRdkPreviewAppearance &v)
virtual bool  | operator== (const CRhRdkPreviewAppearance &v) const
virtual IRhRdkPreviewSceneServer::eRotationType  | RotationType (void) const
virtual double  | RotationX (void) const
virtual double  | RotationY (void) const
virtual void  | SetBackground (const CRhRdkPreviewBackground *pBackground)
virtual void  | SetGeometry (const CRhRdkPreviewGeometry *pGeometry)
virtual void  | SetLighting (const CRhRdkPreviewLighting *pLighting)
virtual void  | SetRotationType (IRhRdkPreviewSceneServer::eRotationType type)
virtual void  | SetRotationX (double d)
virtual void  | SetRotationY (double d)
virtual void  | SetSize (double d)
virtual double  | Size (void) const
virtual void  | ToMetaData (IRhRdkPreviewSettings::IMetaData &m) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Detailed Description
This class represents the appearance of a content preview as seen in a thumbnail image.
Constructor & Destructor Documentation
◆ CRhRdkPreviewAppearance() [1/3]
 CRhRdkPreviewAppearance::CRhRdkPreviewAppearance  |  ( |   | )
◆ CRhRdkPreviewAppearance() [2/3]
 CRhRdkPreviewAppearance::CRhRdkPreviewAppearance  |  ( |  const CRhRdkContent *  |  pContent | )
◆ CRhRdkPreviewAppearance() [3/3]
 CRhRdkPreviewAppearance::CRhRdkPreviewAppearance  |  ( |  const CRhRdkPreviewAppearance &  |  v | )
◆ ~CRhRdkPreviewAppearance()
 virtual CRhRdkPreviewAppearance::~CRhRdkPreviewAppearance  |  ( |   | )
virtual
Member Function Documentation
◆ Background()
 virtual const CRhRdkPreviewBackground* CRhRdkPreviewAppearance::Background  |  ( |  void  |   | ) |   const
virtual
◆ FromMetaData()
 virtual void CRhRdkPreviewAppearance::FromMetaData  |  ( |  const IRhRdkPreviewSettings::IMetaData &  |  m | )
virtual
◆ Geometry()
 virtual const CRhRdkPreviewGeometry* CRhRdkPreviewAppearance::Geometry  |  ( |  void  |   | ) |   const
virtual
◆ Lighting()
 virtual const CRhRdkPreviewLighting* CRhRdkPreviewAppearance::Lighting  |  ( |  void  |   | ) |   const
virtual
◆ LoadFromDefaults()
 virtual void CRhRdkPreviewAppearance::LoadFromDefaults  |  ( |  const IRhRdkPreviewAppearanceDefaults &  |  viewDefaults | )
virtual
◆ operator=()
 virtual const CRhRdkPreviewAppearance& CRhRdkPreviewAppearance::operator=  |  ( |  const CRhRdkPreviewAppearance &  |  v | )
virtual
◆ operator==()
 virtual bool CRhRdkPreviewAppearance::operator==  |  ( |  const CRhRdkPreviewAppearance &  |  v | ) |   const
virtual
◆ RotationType()
 virtual IRhRdkPreviewSceneServer::eRotationType CRhRdkPreviewAppearance::RotationType  |  ( |  void  |   | ) |   const
virtual
◆ RotationX()
 virtual double CRhRdkPreviewAppearance::RotationX  |  ( |  void  |   | ) |   const
virtual
◆ RotationY()
 virtual double CRhRdkPreviewAppearance::RotationY  |  ( |  void  |   | ) |   const
virtual
◆ SetBackground()
 virtual void CRhRdkPreviewAppearance::SetBackground  |  ( |  const CRhRdkPreviewBackground *  |  pBackground | )
virtual
◆ SetGeometry()
 virtual void CRhRdkPreviewAppearance::SetGeometry  |  ( |  const CRhRdkPreviewGeometry *  |  pGeometry | )
virtual
◆ SetLighting()
 virtual void CRhRdkPreviewAppearance::SetLighting  |  ( |  const CRhRdkPreviewLighting *  |  pLighting | )
virtual
◆ SetRotationType()
 virtual void CRhRdkPreviewAppearance::SetRotationType  |  ( |  IRhRdkPreviewSceneServer::eRotationType  |  type | )
virtual
◆ SetRotationX()
 virtual void CRhRdkPreviewAppearance::SetRotationX  |  ( |  double  |  d | )
virtual
◆ SetRotationY()
 virtual void CRhRdkPreviewAppearance::SetRotationY  |  ( |  double  |  d | )
virtual
◆ SetSize()
 virtual void CRhRdkPreviewAppearance::SetSize  |  ( |  double  |  d | )
virtual
◆ Size()
 virtual double CRhRdkPreviewAppearance::Size  |  ( |  void  |   | ) |   const
virtual
◆ ToMetaData()
 virtual void CRhRdkPreviewAppearance::ToMetaData  |  ( |  IRhRdkPreviewSettings::IMetaData &  |  m | ) |   const
virtual