Public Member Functions | List of all members
CRhRdkWorldMapDayNight Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkWorldMapDayNight:
 Public Member Functions
CRhRdkWorldMapDayNight ()
virtual  | ~CRhRdkWorldMapDayNight ()
bool  | HasMapForCurrentSettings (void) const
int  | Height (void) const
void  | LocationToMap (double dLatitude, double dLongitude, int &iMapX, int &iMapY) const
const CRhinoDib &  | MakeMapBitmap (void)
const CRhinoDib &  | Map (void) const
void  | MapToLocation (int iMapX, int iMapY, double &dLatitude, double &dLongitude) const
void  | SetDayNightDisplay (bool bOn)
void  | SetEnabled (bool bEnabled)
void  | SetTimeInfo (int year, int month, int day, double decimalHour, double timeZone, int daylightSavingMinutes, bool bDaylightSavingsOn)
int  | Width (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Constructor & Destructor Documentation
◆ CRhRdkWorldMapDayNight()
 CRhRdkWorldMapDayNight::CRhRdkWorldMapDayNight  |  ( |   | )
◆ ~CRhRdkWorldMapDayNight()
 virtual CRhRdkWorldMapDayNight::~CRhRdkWorldMapDayNight  |  ( |   | )
virtual
Member Function Documentation
◆ HasMapForCurrentSettings()
 bool CRhRdkWorldMapDayNight::HasMapForCurrentSettings  |  ( |  void  |   | ) |   const
◆ Height()
 int CRhRdkWorldMapDayNight::Height  |  ( |  void  |   | ) |   const
◆ LocationToMap()
 void CRhRdkWorldMapDayNight::LocationToMap  |  ( |  double  |  dLatitude,
|  double  |  dLongitude,
|  int &  |  iMapX,
|  int &  |  iMapY
) |   |  const
◆ MakeMapBitmap()
 const CRhinoDib& CRhRdkWorldMapDayNight::MakeMapBitmap  |  ( |  void  |   | )
◆ Map()
 const CRhinoDib& CRhRdkWorldMapDayNight::Map  |  ( |  void  |   | ) |   const
◆ MapToLocation()
 void CRhRdkWorldMapDayNight::MapToLocation  |  ( |  int  |  iMapX,
|  int  |  iMapY,
|  double &  |  dLatitude,
|  double &  |  dLongitude
) |   |  const
◆ SetDayNightDisplay()
 void CRhRdkWorldMapDayNight::SetDayNightDisplay  |  ( |  bool  |  bOn | )
◆ SetEnabled()
 void CRhRdkWorldMapDayNight::SetEnabled  |  ( |  bool  |  bEnabled | )
◆ SetTimeInfo()
 void CRhRdkWorldMapDayNight::SetTimeInfo  |  ( |  int  |  year,
|  int  |  month,
|  int  |  day,
|  double  |  decimalHour,
|  double  |  timeZone,
|  int  |  daylightSavingMinutes,
|  bool  |  bDaylightSavingsOn
)
◆ Width()
 int CRhRdkWorldMapDayNight::Width  |  ( |  void  |   | ) |   const