Public Member Functions | Protected Member Functions | List of all members
CRhRdkCoreContentUI Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkCoreContentUI:
 Public Member Functions
CRhRdkCoreContentUI (const UUID &uuidEditor, const UUID &uuidUI)
virtual void  | AddClient (const CRhRdkContent &c) override
virtual int  | ClientCount (void) const override
virtual CRhRdkControllerPtr  | Controller (void) const override
virtual ON_wString  | DebugString (void) const override
virtual UUID  | EditorUuid (void) const override
virtual void  | ReleaseAllClients (void) override
virtual void  | RemClient (const CRhRdkContent &c) override
virtual void  | SetController (CRhRdkControllerPtr con) override
virtual UUID  | Uuid (void) const override
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Member Functions inherited from IRhRdkExpandableContentUI
virtual void  | AddSection (IRhinoUiSection *pSection)=0
virtual void  | AddSection (IRhinoUiSection *pSection, CRhRdkControllerPtr con)=0
virtual IRhinoUiHolder *  | ContentUIHolder (void) const =0
 Public Member Functions inherited from IRhRdkContentUI
RDK_DEPRECATED void  | AddClient (CRhRdkCoreContent &c)
virtual RDK_DEPRECATED void  | AddSection (class CRhRdkExpandingSection *pSection, int dummy=0)
virtual void  | DeleteThis (void)=0
virtual void  | Destroy (void)=0
virtual void  | DisplayData (void)=0
virtual void  | Enable (bool bEnable)=0
virtual void  | EnableDisableControls (void)=0
virtual void *  | EVF (const wchar_t *, void *)=0
virtual RhRdkUiFrameworks  | Framework (void) const =0
virtual RDK_DEPRECATED class IRhinoUiHolder &  | Holder (void) const
virtual bool  | IsCreated (void) const =0
virtual bool  | IsShown (void) const =0
RDK_DEPRECATED void  | RemClient (CRhRdkCoreContent &c)
virtual void  | SetPositionAndSize (const ON_4iRect &rect)=0
virtual void  | SetSelection (const CRhRdkContentArray &aContent)=0
virtual void  | Show (bool bShow)=0
 Protected Member Functions
virtual  | ~CRhRdkCoreContentUI ()
void  | BrazilWorkaround (const CRhRdkContent &c)
 Protected Member Functions inherited from IRhRdkContentUI
virtual  | ~IRhRdkContentUI ()
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
 Static Public Member Functions inherited from IRhRdkContentUI
static RDK_DEPRECATED IRhRdkContentUI *  | Get (const UUID &)
Constructor & Destructor Documentation
◆ CRhRdkCoreContentUI()
 CRhRdkCoreContentUI::CRhRdkCoreContentUI  |  ( |  const UUID &  |  uuidEditor,
|  const UUID &  |  uuidUI
)
◆ ~CRhRdkCoreContentUI()
 virtual CRhRdkCoreContentUI::~CRhRdkCoreContentUI  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ AddClient()
 virtual void CRhRdkCoreContentUI::AddClient  |  ( |  const CRhRdkContent &  |  c | )
overridevirtual
Called when a client is added to the UI. Your implementation should remember this client, perhaps in a CRhRdkContentArray. Implemented by CRhRdkCustomContentUI.
See also
ClientCount()
Implements IRhRdkContentUI.
◆ BrazilWorkaround()
 void CRhRdkCoreContentUI::BrazilWorkaround  |  ( |  const CRhRdkContent &  |  c | )
protected
◆ ClientCount()
 virtual int CRhRdkCoreContentUI::ClientCount  |  ( |  void  |   | ) |   const
overridevirtual
Returns
the number of clients using the UI. Implemented by CRhRdkCustomContentUI.
See also
AddClient()
 RemClient()
Implements IRhRdkContentUI.
◆ Controller()
 virtual CRhRdkControllerPtr CRhRdkCoreContentUI::Controller  |  ( |  void  |   | ) |   const
overridevirtual
Returns
the UI's controller.
Implements IRhRdkContentUI.
◆ DebugString()
 virtual ON_wString CRhRdkCoreContentUI::DebugString  |  ( |  void  |   | ) |   const
overridevirtual
Returns
UI information for debugging.
Implements IRhRdkContentUI.
◆ EditorUuid()
 virtual UUID CRhRdkCoreContentUI::EditorUuid  |  ( |  void  |   | ) |   const
overridevirtual
Get the unique identifier of the editor that the UI is being displayed in. Implemented by CRhRdkCustomContentUI.
Implements IRhRdkContentUI.
◆ ReleaseAllClients()
 virtual void CRhRdkCoreContentUI::ReleaseAllClients  |  ( |  void  |   | )
overridevirtual
Implements IRhRdkContentUI.
◆ RemClient()
 virtual void CRhRdkCoreContentUI::RemClient  |  ( |  const CRhRdkContent &  |  c | )
overridevirtual
Called when a client is removed from the UI. Your implementation should remove the client from its client list or array. When the last client is removed, you must hide the entire UI. Implemented by CRhRdkCustomContentUI.
See also
ClientCount().
Implements IRhRdkContentUI.
◆ SetController()
 virtual void CRhRdkCoreContentUI::SetController  |  ( |  CRhRdkControllerPtr  |  con | )
overridevirtual
Set the UI's controller.
Implements IRhRdkContentUI.
◆ Uuid()
 virtual UUID CRhRdkCoreContentUI::Uuid  |  ( |  void  |   | ) |   const
overridevirtual
Get the unique identifier of the UI. Implemented by CRhRdkCustomContentUI.
Implements IRhRdkContentUI.