List of all members
CRhRdkEnvironmentArray Class Referencefinal
RDK
#include <RhRdkEnvironment.h>
 Inheritance diagram for CRhRdkEnvironmentArray:
 Additional Inherited Members
 Public Member Functions inherited from ON_SimpleArray< const CRhRdkEnvironment *>
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< const CRhRdkEnvironment * > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_SimpleArray ()
void  | Append (const const CRhRdkEnvironment * &)
void  | Append (int, const const CRhRdkEnvironment * *)
Append copy of an array T[count]. More...
const CRhRdkEnvironment * &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
const CRhRdkEnvironment * *  | Array ()
The Array() function return the. More...
const const CRhRdkEnvironment * *  | Array () const
m_a pointer value. More...
const CRhRdkEnvironment * *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const CRhRdkEnvironment * *  | At (unsigned int)
const CRhRdkEnvironment * *  | At (ON__INT64)
const CRhRdkEnvironment * *  | At (ON__UINT64)
const const CRhRdkEnvironment * *  | At (int) const
const const CRhRdkEnvironment * *  | At (unsigned int) const
const const CRhRdkEnvironment * *  | At (ON__INT64) const
const const CRhRdkEnvironment * *  | At (ON__UINT64) const
int  | BinarySearch (const const CRhRdkEnvironment * *, int(*)(const const CRhRdkEnvironment * *, const const CRhRdkEnvironment * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
int  | BinarySearch (const const CRhRdkEnvironment * *, int(*)(const const CRhRdkEnvironment * *, const const CRhRdkEnvironment * *), int) const
int  | Capacity () const
capacity of array More...
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
const CRhRdkEnvironment * *  | First ()
const const CRhRdkEnvironment * *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*)(const const CRhRdkEnvironment * *, const const CRhRdkEnvironment * *))
void  | Insert (int, const const CRhRdkEnvironment * &)
const CRhRdkEnvironment * *  | KeepArray ()
const CRhRdkEnvironment * *  | Last ()
const const CRhRdkEnvironment * *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const const CRhRdkEnvironment * * () const
operator const CRhRdkEnvironment ** ()
The cast operators return a pointer. More...
ON_SimpleArray< const CRhRdkEnvironment * > &  | operator= (const ON_SimpleArray< const CRhRdkEnvironment * > &)
const CRhRdkEnvironment * &  | operator[] (int)
const CRhRdkEnvironment * &  | operator[] (unsigned int)
const CRhRdkEnvironment * &  | operator[] (ON__INT64)
const CRhRdkEnvironment * &  | operator[] (ON__UINT64)
const const CRhRdkEnvironment * &  | operator[] (int) const
const const CRhRdkEnvironment * &  | operator[] (unsigned int) const
const const CRhRdkEnvironment * &  | operator[] (ON__INT64) const
const const CRhRdkEnvironment * &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const const CRhRdkEnvironment * *, const const CRhRdkEnvironment * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
virtual const CRhRdkEnvironment * *  | Realloc (const CRhRdkEnvironment * *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
const CRhRdkEnvironment * *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const const CRhRdkEnvironment * &) const
int  | Search (const const CRhRdkEnvironment * *, int(*)(const const CRhRdkEnvironment * *, const const CRhRdkEnvironment * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
void  | SetArray (const CRhRdkEnvironment * *)
void  | SetArray (const CRhRdkEnvironment * *, int, int)
const CRhRdkEnvironment * *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const const CRhRdkEnvironment * *, const const CRhRdkEnvironment * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const const CRhRdkEnvironment * *, const const CRhRdkEnvironment * *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Protected Member Functions inherited from ON_SimpleArray< const CRhRdkEnvironment *>
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< const CRhRdkEnvironment *>
const CRhRdkEnvironment * *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...