CRhRdkNewContentCtrl Class Reference
RDK
#include <RhRdkNewContentCtrl.h>
Detailed Description
'NCC'.
Using this class as a dialog member is no longer supported. Please call IRhRdkNewContentCtrl::New() and use the returned interface instead. You will need to call SetParent() and SetController().