Public Member Functions | List of all members
ON_TextRunBuilder::TextProps Class Reference
#include <opennurbs_textiterator.h>
 Public Member Functions
TextProps ()
TextProps (double height, double stackscale, ON_Color color, ON_DimStyle::stack_format stackformat, bool bold, bool italic, bool underlined, bool strikethrough)
ON_Color  | Color () const
double  | Height () const
bool  | IsBold ()
bool  | IsItalic ()
bool  | IsStrikethrough ()
bool  | IsUnderlined ()
void  | SetBold (bool bold)
void  | SetColor (ON_Color c)
void  | SetHeight (double h)
void  | SetItalic (bool italic)
void  | SetStackFormat (ON_DimStyle::stack_format s)
void  | SetStackScale (double s)
void  | SetStrikethrough (bool strikethrough)
void  | SetUnderlined (bool underlined)
ON_DimStyle::stack_format  | StackFormat () const
double  | StackScale () const
Constructor & Destructor Documentation
◆ TextProps() [1/2]
 ON_TextRunBuilder::TextProps::TextProps  |  ( |   | )
inline
◆ TextProps() [2/2]
 ON_TextRunBuilder::TextProps::TextProps  |  ( |  double  |  height,
|  double  |  stackscale,
|  ON_Color  |  color,
|  ON_DimStyle::stack_format  |  stackformat,
|  bool  |  bold,
|  bool  |  italic,
|  bool  |  underlined,
|  bool  |  strikethrough
)
inline
Member Function Documentation
◆ Color()
 ON_Color ON_TextRunBuilder::TextProps::Color  |  ( |   | ) |   const
inline
◆ Height()
 double ON_TextRunBuilder::TextProps::Height  |  ( |  void  |   | ) |   const
inline
◆ IsBold()
 bool ON_TextRunBuilder::TextProps::IsBold  |  ( |   | )
inline
◆ IsItalic()
 bool ON_TextRunBuilder::TextProps::IsItalic  |  ( |   | )
inline
◆ IsStrikethrough()
 bool ON_TextRunBuilder::TextProps::IsStrikethrough  |  ( |   | )
inline
◆ IsUnderlined()
 bool ON_TextRunBuilder::TextProps::IsUnderlined  |  ( |   | )
inline
◆ SetBold()
 void ON_TextRunBuilder::TextProps::SetBold  |  ( |  bool  |  bold | )
inline
◆ SetColor()
 void ON_TextRunBuilder::TextProps::SetColor  |  ( |  ON_Color  |  c | )
inline
◆ SetHeight()
 void ON_TextRunBuilder::TextProps::SetHeight  |  ( |  double  |  h | )
inline
◆ SetItalic()
 void ON_TextRunBuilder::TextProps::SetItalic  |  ( |  bool  |  italic | )
inline
◆ SetStackFormat()
 void ON_TextRunBuilder::TextProps::SetStackFormat  |  ( |  ON_DimStyle::stack_format  |  s | )
inline
◆ SetStackScale()
 void ON_TextRunBuilder::TextProps::SetStackScale  |  ( |  double  |  s | )
inline
◆ SetStrikethrough()
 void ON_TextRunBuilder::TextProps::SetStrikethrough  |  ( |  bool  |  strikethrough | )
inline
◆ SetUnderlined()
 void ON_TextRunBuilder::TextProps::SetUnderlined  |  ( |  bool  |  underlined | )
inline
◆ StackFormat()
 ON_DimStyle::stack_format ON_TextRunBuilder::TextProps::StackFormat  |  ( |   | ) |   const
inline
◆ StackScale()
 double ON_TextRunBuilder::TextProps::StackScale  |  ( |   | ) |   const
inline