Public Member Functions | List of all members
CRhRdkLocalMappingSuppressor Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkLocalMappingSuppressor:
 Public Member Functions
CRhRdkLocalMappingSuppressor (const CRhRdkTexture *pTexture, bool bActive=true)
virtual  | ~CRhRdkLocalMappingSuppressor ()
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Detailed Description
This object can be put ON THE STACK to suppress the effect of a texture's local mapping parameters for the duration of a function.
!!!!!!!! IMPORTANT !!!!!!!! !!!!!!!! Do not use this object in any way other than as a stack object. !!!!!!!! i.e., Do not create one on the heap.
Constructor & Destructor Documentation
◆ CRhRdkLocalMappingSuppressor()
 CRhRdkLocalMappingSuppressor::CRhRdkLocalMappingSuppressor  |  ( |  const CRhRdkTexture *  |  pTexture,
|  bool  |  bActive = true
)
◆ ~CRhRdkLocalMappingSuppressor()
 virtual CRhRdkLocalMappingSuppressor::~CRhRdkLocalMappingSuppressor  |  ( |   | )
virtual