Public Member Functions | Static Public Member Functions | Friends | List of all members
ON_FontList Class Reference
OpenNURBS
#include <opennurbs_font.h>
 Public Member Functions
ON_FontList ()=default
ON_FontList (ON_Font::NameLocale name_locale, bool bMatchUnderlineStrikethroughAndPointSize)
ON_FontList (const ON_FontList &)=default
~ON_FontList ()=default
unsigned int  | AddFont (const ON_Font *font, bool bCheckForDuplicates)
unsigned int  | AddFonts (const ON_SimpleArray< const ON_Font * > &fonts)
unsigned int  | AddFonts (size_t font_count, const ON_Font *const *font_list)
const ON_SimpleArray< const class ON_Font *> &  | ByFamilyName () const
const ON_SimpleArray< const class ON_Font *> &  | ByIndex () const
const ON_SimpleArray< const class ON_Font *> &  | ByPostScriptName () const
const ON_SimpleArray< const class ON_Font *> &  | ByWindowsLogfontName () const
unsigned int  | Count () const
const ON_Font *  | FamilyMemberWithWeightStretchStyle (const wchar_t *family_name, ON_Font::Weight desired_weight, ON_Font::Stretch desired_stretch, ON_Font::Style desired_style) const
const ON_Font *  | FamilyMemberWithWeightStretchStyle (const ON_Font *font, ON_Font::Weight desired_weight, ON_Font::Stretch desired_stretch, ON_Font::Style desired_style) const
unsigned int  | FontListFromNames (const wchar_t *postscript_name, const wchar_t *windows_logfont_name, const wchar_t *family_name, const wchar_t *face_name, ON_SimpleArray< const ON_Font * > &font_list) const
const ON_Font *  | FromFamilyName (const wchar_t *family_name, const wchar_t *prefered_face_name) const
const ON_Font *  | FromFamilyName (const wchar_t *family_name, const wchar_t *prefered_face_name, ON_Font::Weight prefered_weight, ON_Font::Stretch prefered_stretch, ON_Font::Style prefered_style) const
const ON_Font *  | FromFamilyName (const wchar_t *family_name, const wchar_t *prefered_face_name, ON_Font::Weight prefered_weight, ON_Font::Stretch prefered_stretch, ON_Font::Style prefered_style, bool bUnderlined, bool bStrikethrough) const
const ON_Font *  | FromFontProperties (const ON_Font *font_properties, bool bRequireFaceMatch, bool bRequireStyleMatch) const
const ON_Font *  | FromFontProperties (const ON_Font *font_properties, bool bRequireFaceMatch, bool bRequireStyleMatch, bool bUnderlined, bool bStrikethrough, double point_size) const
const ON_Font *  | FromNames (const wchar_t *postscript_name, const wchar_t *windows_logfont_name, const wchar_t *family_name, const wchar_t *prefered_face_name, ON_Font::Weight prefered_weight, ON_Font::Stretch prefered_stretch, ON_Font::Style prefered_style, bool bRequireFaceMatch, bool bRequireStyleMatch) const
const ON_Font *  | FromNames (const wchar_t *postscript_name, const wchar_t *windows_logfont_name, const wchar_t *family_name, const wchar_t *prefered_face_name, ON_Font::Weight prefered_weight, ON_Font::Stretch prefered_stretch, ON_Font::Style prefered_style, bool bRequireFaceMatch, bool bRequireStyleMatch, bool bUnderlined, bool bStrikethrough, double point_size) const
const ON_Font *  | FromPostScriptName (const wchar_t *postscript_name) const
const ON_Font *  | FromPostScriptName (const wchar_t *postscript_name, ON_Font::Weight prefered_weight, ON_Font::Stretch prefered_stretch, ON_Font::Style prefered_style) const
const ON_Font *  | FromPostScriptName (const wchar_t *postscript_name, ON_Font::Weight prefered_weight, ON_Font::Stretch prefered_stretch, ON_Font::Style prefered_style, bool bUnderlined, bool bStrikethrough) const
const ON_Font *  | FromRichTextProperties (const wchar_t *rtf_font_name, bool bRtfBold, bool bRtfItalic, bool bUnderlined, bool bStrikethrough) const
const ON_Font *  | FromWindowsLogfontName (const wchar_t *windows_logfont_name) const
const ON_Font *  | FromWindowsLogfontName (const wchar_t *windows_logfont_name, ON_Font::Weight prefered_weight, ON_Font::Stretch prefered_stretch, ON_Font::Style prefered_style) const
const ON_Font *  | FromWindowsLogfontName (const wchar_t *windows_logfont_name, ON_Font::Weight prefered_weight, ON_Font::Stretch prefered_stretch, ON_Font::Style prefered_style, bool bUnderlined, bool bStrikethrough) const
ON_Font::NameLocale  | NameLocale () const
ON_FontList &  | operator= (const ON_FontList &)=default
 Static Public Member Functions
static int  | CompareEnglishFamilyAndFaceName (ON_Font const *const *lhs, ON_Font const *const *rhs)
static int  | CompareEnglishFamilyName (ON_Font const *const *lhs, ON_Font const *const *rhs)
static int  | CompareEnglishPostScriptName (ON_Font const *const *lhs, ON_Font const *const *rhs)
static int  | CompareEnglishWindowsLogfontName (ON_Font const *const *lhs, ON_Font const *const *rhs)
static int  | CompareFamilyAndFaceName (ON_Font const *const *lhs, ON_Font const *const *rhs)
static int  | CompareFamilyName (ON_Font const *const *lhs, ON_Font const *const *rhs)
static int  | ComparePostScriptName (ON_Font const *const *lhs, ON_Font const *const *rhs)
static int  | CompareUnderlinedStrikethroughPointSize (ON_Font const *const *lhs, ON_Font const *const *rhs)
static int  | CompareWeightStretchStyle (ON_Font const *const *lhs, ON_Font const *const *rhs)
static int  | CompareWindowsLogfontName (ON_Font const *const *lhs, ON_Font const *const *rhs)
 Friends
class  | ON_ManagedFonts
Constructor & Destructor Documentation
◆ ON_FontList() [1/3]
 ON_FontList::ON_FontList  |  ( |   | )
default
◆ ON_FontList() [2/3]
 ON_FontList::ON_FontList  |  ( |  ON_Font::NameLocale  |  name_locale,
|  bool  |  bMatchUnderlineStrikethroughAndPointSize
)
Parameters: name_locale - [in] bMatchUnderlineStrikethroughAndPointSize - [in] False to ignore underline, strikethrough, and point size properties (installed font list) True to match underline, strikethrough and point size properties (managed font list)
◆ ~ON_FontList()
 ON_FontList::~ON_FontList  |  ( |   | )
default
◆ ON_FontList() [3/3]
 ON_FontList::ON_FontList  |  ( |  const ON_FontList &  |   | )
default
Member Function Documentation
◆ AddFont()
 unsigned int ON_FontList::AddFont  |  ( |  const ON_Font *  |  font,
|  bool  |  bCheckForDuplicates
)
◆ AddFonts() [1/2]
 unsigned int ON_FontList::AddFonts  |  ( |  const ON_SimpleArray< const ON_Font * > &  |  fonts | )
◆ AddFonts() [2/2]
 unsigned int ON_FontList::AddFonts  |  ( |  size_t  |  font_count,
|  const ON_Font *const *  |  font_list
)
◆ ByFamilyName()
 const ON_SimpleArray< const class ON_Font* >& ON_FontList::ByFamilyName  |  ( |   | ) |   const
Returns: Array of fonts sorted by ON_Font.FamilyName() and then by ON_Font.FaceName().
◆ ByIndex()
 const ON_SimpleArray< const class ON_Font* >& ON_FontList::ByIndex  |  ( |   | ) |   const
Returns: Array of fonts in the order they were added.
◆ ByPostScriptName()
 const ON_SimpleArray< const class ON_Font* >& ON_FontList::ByPostScriptName  |  ( |   | ) |   const
Returns: Array of fonts sorted by ON_Font.PostScriptName().
◆ ByWindowsLogfontName()
 const ON_SimpleArray< const class ON_Font* >& ON_FontList::ByWindowsLogfontName  |  ( |   | ) |   const
Returns: Array of fonts sorted by ON_Font.WindowsLogfontName().
◆ CompareEnglishFamilyAndFaceName()
 static int ON_FontList::CompareEnglishFamilyAndFaceName  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ CompareEnglishFamilyName()
 static int ON_FontList::CompareEnglishFamilyName  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ CompareEnglishPostScriptName()
 static int ON_FontList::CompareEnglishPostScriptName  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ CompareEnglishWindowsLogfontName()
 static int ON_FontList::CompareEnglishWindowsLogfontName  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ CompareFamilyAndFaceName()
 static int ON_FontList::CompareFamilyAndFaceName  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ CompareFamilyName()
 static int ON_FontList::CompareFamilyName  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ ComparePostScriptName()
 static int ON_FontList::ComparePostScriptName  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ CompareUnderlinedStrikethroughPointSize()
 static int ON_FontList::CompareUnderlinedStrikethroughPointSize  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ CompareWeightStretchStyle()
 static int ON_FontList::CompareWeightStretchStyle  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ CompareWindowsLogfontName()
 static int ON_FontList::CompareWindowsLogfontName  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
◆ Count()
 unsigned int ON_FontList::Count  |  ( |   | ) |   const
Returns: Number of fonts in the list.
◆ FamilyMemberWithWeightStretchStyle() [1/2]
 const ON_Font* ON_FontList::FamilyMemberWithWeightStretchStyle  |  ( |  const wchar_t *  |  family_name,
|  ON_Font::Weight  |  desired_weight,
|  ON_Font::Stretch  |  desired_stretch,
|  ON_Font::Style  |  desired_style
) |   |  const
Properties: family name - [in] desired_weight - [in] desired_stretch - [in] desired_style - [in] Returns: A font in the same family with that comes a close as possible to matching the desired weight, stretch and style.
◆ FamilyMemberWithWeightStretchStyle() [2/2]
 const ON_Font* ON_FontList::FamilyMemberWithWeightStretchStyle  |  ( |  const ON_Font *  |  font,
|  ON_Font::Weight  |  desired_weight,
|  ON_Font::Stretch  |  desired_stretch,
|  ON_Font::Style  |  desired_style
) |   |  const
Properties: font - [in] Used to identify the family, desired_weight - [in] new weight or unset if font weight is adequate desired_stretch - [in] new stretch or unset if font stretch is adequate desired_style - [in] new style or unset if font style is adequate Returns: A font in the same family with that comes a close as possible to matching the desired weight, stretch and style.
◆ FontListFromNames()
 unsigned int ON_FontList::FontListFromNames  |  ( |  const wchar_t *  |  postscript_name,
|  const wchar_t *  |  windows_logfont_name,
|  const wchar_t *  |  family_name,
|  const wchar_t *  |  face_name,
|  ON_SimpleArray< const ON_Font * > &  |  font_list
) |   |  const
Description: Get the subset of fonts in this list with matching names.
◆ FromFamilyName() [1/3]
 const ON_Font* ON_FontList::FromFamilyName  |  ( |  const wchar_t *  |  family_name,
|  const wchar_t *  |  prefered_face_name
) |   |  const
◆ FromFamilyName() [2/3]
 const ON_Font* ON_FontList::FromFamilyName  |  ( |  const wchar_t *  |  family_name,
|  const wchar_t *  |  prefered_face_name,
|  ON_Font::Weight  |  prefered_weight,
|  ON_Font::Stretch  |  prefered_stretch,
|  ON_Font::Style  |  prefered_style
) |   |  const
◆ FromFamilyName() [3/3]
 const ON_Font* ON_FontList::FromFamilyName  |  ( |  const wchar_t *  |  family_name,
|  const wchar_t *  |  prefered_face_name,
|  ON_Font::Weight  |  prefered_weight,
|  ON_Font::Stretch  |  prefered_stretch,
|  ON_Font::Style  |  prefered_style,
|  bool  |  bUnderlined,
|  bool  |  bStrikethrough
) |   |  const
◆ FromFontProperties() [1/2]
 const ON_Font* ON_FontList::FromFontProperties  |  ( |  const ON_Font *  |  font_properties,
|  bool  |  bRequireFaceMatch,
|  bool  |  bRequireStyleMatch
) |   |  const
◆ FromFontProperties() [2/2]
 const ON_Font* ON_FontList::FromFontProperties  |  ( |  const ON_Font *  |  font_properties,
|  bool  |  bRequireFaceMatch,
|  bool  |  bRequireStyleMatch,
|  bool  |  bUnderlined,
|  bool  |  bStrikethrough,
|  double  |  point_size
) |   |  const
◆ FromNames() [1/2]
 const ON_Font* ON_FontList::FromNames  |  ( |  const wchar_t *  |  postscript_name,
|  const wchar_t *  |  windows_logfont_name,
|  const wchar_t *  |  family_name,
|  const wchar_t *  |  prefered_face_name,
|  ON_Font::Weight  |  prefered_weight,
|  ON_Font::Stretch  |  prefered_stretch,
|  ON_Font::Style  |  prefered_style,
|  bool  |  bRequireFaceMatch,
|  bool  |  bRequireStyleMatch
) |   |  const
Parameters: postscript_name - [in] windows_logfont_name - [in] family_name - [in] The returned font will have an exact match for one of the three names, postscript_name, windows_logfont_name, or family_name.
prefered_face_name - [in] prefered_weight - [in] prefered_stretch - [in] prefered_style - [in] Prefered font properties.
bRequireFaceMatch - [in] If true and face_name is not empty, then the returned font will have an exact match for either postscript_name, windows_logfont_name, or the family and face name pair.
bRequireStyleMatch - [in] If true and prefered_stretch is not unset, then the returned font will have prefered_style Remarks: Ignores underlined, strikethrough, and point size settings when looking for a match.
◆ FromNames() [2/2]
 const ON_Font* ON_FontList::FromNames  |  ( |  const wchar_t *  |  postscript_name,
|  const wchar_t *  |  windows_logfont_name,
|  const wchar_t *  |  family_name,
|  const wchar_t *  |  prefered_face_name,
|  ON_Font::Weight  |  prefered_weight,
|  ON_Font::Stretch  |  prefered_stretch,
|  ON_Font::Style  |  prefered_style,
|  bool  |  bRequireFaceMatch,
|  bool  |  bRequireStyleMatch,
|  bool  |  bUnderlined,
|  bool  |  bStrikethrough,
|  double  |  point_size
) |   |  const
Parameters: postscript_name - [in] windows_logfont_name - [in] family_name - [in] The returned font will have an exact match for one of the three names, postscript_name, windows_logfont_name, or family_name.
prefered_face_name - [in] prefered_weight - [in] prefered_stretch - [in] prefered_style - [in] Prefered font properties.
bRequireFaceMatch - [in] If true and face_name is not empty, then the returned font will have an exact match for either postscript_name, windows_logfont_name, or the family and face name pair.
bRequireStyleMatch - [in] If true and prefered_stretch is not unset, then the returned font will have prefered_style
bUnderlined - [in] Exact match required. bStrikethrough - [in] Exact match required. point_size - [in] Exact match required.
◆ FromPostScriptName() [1/3]
 const ON_Font* ON_FontList::FromPostScriptName  |  ( |  const wchar_t *  |  postscript_name | ) |   const
◆ FromPostScriptName() [2/3]
 const ON_Font* ON_FontList::FromPostScriptName  |  ( |  const wchar_t *  |  postscript_name,
|  ON_Font::Weight  |  prefered_weight,
|  ON_Font::Stretch  |  prefered_stretch,
|  ON_Font::Style  |  prefered_style
) |   |  const
◆ FromPostScriptName() [3/3]
 const ON_Font* ON_FontList::FromPostScriptName  |  ( |  const wchar_t *  |  postscript_name,
|  ON_Font::Weight  |  prefered_weight,
|  ON_Font::Stretch  |  prefered_stretch,
|  ON_Font::Style  |  prefered_style,
|  bool  |  bUnderlined,
|  bool  |  bStrikethrough
) |   |  const
◆ FromRichTextProperties()
 const ON_Font* ON_FontList::FromRichTextProperties  |  ( |  const wchar_t *  |  rtf_font_name,
|  bool  |  bRtfBold,
|  bool  |  bRtfItalic,
|  bool  |  bUnderlined,
|  bool  |  bStrikethrough
) |   |  const
Parameters: rtf_font_name - [in] Rich text format name. This name is not well defined and depends on the device and application that created the rich text. On Windows this is often a LOGFONT.lfFaceName. On MacOS it is often a PostScript name.
bRtfBold - [in] RTF bold flag
bRtfItalic - [in] RTF italic flag
◆ FromWindowsLogfontName() [1/3]
 const ON_Font* ON_FontList::FromWindowsLogfontName  |  ( |  const wchar_t *  |  windows_logfont_name | ) |   const
◆ FromWindowsLogfontName() [2/3]
 const ON_Font* ON_FontList::FromWindowsLogfontName  |  ( |  const wchar_t *  |  windows_logfont_name,
|  ON_Font::Weight  |  prefered_weight,
|  ON_Font::Stretch  |  prefered_stretch,
|  ON_Font::Style  |  prefered_style
) |   |  const
◆ FromWindowsLogfontName() [3/3]
 const ON_Font* ON_FontList::FromWindowsLogfontName  |  ( |  const wchar_t *  |  windows_logfont_name,
|  ON_Font::Weight  |  prefered_weight,
|  ON_Font::Stretch  |  prefered_stretch,
|  ON_Font::Style  |  prefered_style,
|  bool  |  bUnderlined,
|  bool  |  bStrikethrough
) |   |  const
◆ NameLocale()
 ON_Font::NameLocale ON_FontList::NameLocale  |  ( |   | ) |   const
◆ operator=()
 ON_FontList& ON_FontList::operator=  |  ( |  const ON_FontList &  |   | )
default
Friends And Related Function Documentation
◆ ON_ManagedFonts
 friend class ON_ManagedFonts
friend