Public Member Functions | List of all members
IRhRdkRhinoSettings::CLightInfo Class Referencefinal
#include <RhRdkDataSource.h>
 Public Member Functions
CLightInfo ()
CLightInfo (const CLightInfo &)
CLightInfo (const ON_Light &l, bool bDeleted, int iLayerIndex)
~CLightInfo ()
bool  | IsDeleted (void) const
int  | LayerIndex (void) const
ON_Light &  | Light (void)
const ON_Light &  | Light (void) const
const CLightInfo &  | operator= (const CLightInfo &)
void  | SetIsDeleted (bool)
void  | SetLayerIndex (int) const
Constructor & Destructor Documentation
◆ CLightInfo() [1/3]
 IRhRdkRhinoSettings::CLightInfo::CLightInfo  |  ( |   | )
◆ CLightInfo() [2/3]
 IRhRdkRhinoSettings::CLightInfo::CLightInfo  |  ( |  const CLightInfo &  |   | )
◆ CLightInfo() [3/3]
 IRhRdkRhinoSettings::CLightInfo::CLightInfo  |  ( |  const ON_Light &  |  l,
|  bool  |  bDeleted,
|  int  |  iLayerIndex
)
◆ ~CLightInfo()
 IRhRdkRhinoSettings::CLightInfo::~CLightInfo  |  ( |   | )
Member Function Documentation
◆ IsDeleted()
 bool IRhRdkRhinoSettings::CLightInfo::IsDeleted  |  ( |  void  |   | ) |   const
◆ LayerIndex()
 int IRhRdkRhinoSettings::CLightInfo::LayerIndex  |  ( |  void  |   | ) |   const
◆ Light() [1/2]
 ON_Light& IRhRdkRhinoSettings::CLightInfo::Light  |  ( |  void  |   | )
◆ Light() [2/2]
 const ON_Light& IRhRdkRhinoSettings::CLightInfo::Light  |  ( |  void  |   | ) |   const
◆ operator=()
 const CLightInfo& IRhRdkRhinoSettings::CLightInfo::operator=  |  ( |  const CLightInfo &  |   | )
◆ SetIsDeleted()
 void IRhRdkRhinoSettings::CLightInfo::SetIsDeleted  |  ( |  bool  |   | )
◆ SetLayerIndex()
 void IRhRdkRhinoSettings::CLightInfo::SetLayerIndex  |  ( |  int  |   | ) |   const