Public Member Functions | List of all members
ON_TextHash Class Reference
OpenNURBS
#include <opennurbs_textlog.h>
 Inheritance diagram for ON_TextHash:
 Public Member Functions
ON_TextHash ()=default
~ON_TextHash ()=default
ON__UINT64  | ByteCount () const
ON_SHA1_Hash  | Hash () const
bool  | IdRemap () const
ON_TextLog *  | OutputTextLog () const
void  | SetIdRemap (bool bEnableIdRemap)
void  | SetOutputTextLog (ON_TextLog *output_text_log)
void  | SetStringMap (const class ON_Locale &locale, ON_StringMapType map_type)
void  | SetStringMap (ON_StringMapOrdinalType map_type)
const class ON_Locale &  | StringMapLocale () const
ON_StringMapType  | StringMapType () const
 Public Member Functions inherited from ON_TextLog
ON_TextLog ()
ON_TextLog (FILE *fp)
dump to open ASCII text file More...
ON_TextLog (ON_wString &s)
virtual  | ~ON_TextLog ()
void  | GetDoubleFormat (ON_String &) const
void  | GetFloatFormat (ON_String &) const
int  | IndentCount ()
int  | IndentSize () const
bool  | IsTextHash () const
ON_TextLog &  | operator<< (const char *)
ON_TextLog &  | operator<< (char)
ON_TextLog &  | operator<< (short)
ON_TextLog &  | operator<< (int)
ON_TextLog &  | operator<< (float)
ON_TextLog &  | operator<< (double)
ON_TextLog &  | operator<< (const ON_2dPoint &)
ON_TextLog &  | operator<< (const ON_3dPoint &)
ON_TextLog &  | operator<< (const ON_4dPoint &)
ON_TextLog &  | operator<< (const ON_2dVector &)
ON_TextLog &  | operator<< (const ON_3dVector &)
ON_TextLog &  | operator<< (const ON_Xform &)
void  | PopIndent ()
void ON_VARGS_FUNC_CDECL  | Print (const char *format,...)
void ON_VARGS_FUNC_CDECL  | Print (const wchar_t *format,...)
void  | Print (float)
void  | Print (double)
void  | Print (const ON_2dPoint &)
void  | Print (const ON_3dPoint &)
void  | Print (const ON_4dPoint &)
void  | Print (const ON_2dVector &)
void  | Print (const ON_3dVector &)
void  | Print (const ON_Xform &)
void  | Print (const ON_UUID &)
void  | Print (const ON_COMPONENT_INDEX &)
void  | Print (const ON_wString &string)
void  | Print (const ON_String &string)
void  | Print (const ON_3dPointArray &, const char *=nullptr)
void  | Print (const ON_Matrix &, const char *=nullptr, int=0)
void  | PrintCurrentTime ()
void  | PrintKnotVector (int, int, const double *)
void  | PrintNewLine ()
printing utilities More...
void  | PrintPointGrid (int, bool, int, int, int, int, const double *, const char *=nullptr)
void  | PrintPointList (int, bool, int, int, const double *, const char *=nullptr)
void  | PrintRGB (const ON_Color &)
void  | PrintString (const char *s)
void  | PrintString (const wchar_t *s)
void  | PrintTime (const struct tm &t)
void  | PrintWrappedText (const char *, int=60)
last arg is maximum line length More...
void  | PrintWrappedText (const wchar_t *, int=60)
last arg is maximum line length More...
void  | PushIndent ()
void  | SetDoubleFormat (const char *)
default is g More...
void  | SetFloatFormat (const char *)
default is g More...
void  | SetIndentCount (int indent_count)
void  | SetIndentSize (int)
 Additional Inherited Members
 Static Public Attributes inherited from ON_TextLog
static ON_TextLog  | Null
 Protected Attributes inherited from ON_TextLog
FILE *  | m_pFile
ON_wString *  | m_pString
Constructor & Destructor Documentation
◆ ON_TextHash()
 ON_TextHash::ON_TextHash  |  ( |   | )
default
◆ ~ON_TextHash()
 ON_TextHash::~ON_TextHash  |  ( |   | )
default
Member Function Documentation
◆ ByteCount()
 ON__UINT64 ON_TextHash::ByteCount  |  ( |   | ) |   const
Returns: Total number of bytes that have passed through this text log.
◆ Hash()
 ON_SHA1_Hash ON_TextHash::Hash  |  ( |   | ) |   const
Returns: SHA-1 hash value of the text sent to this text log.
◆ IdRemap()
 bool ON_TextHash::IdRemap  |  ( |   | ) |   const
Returns: True if id remap is available.
◆ OutputTextLog()
 ON_TextLog* ON_TextHash::OutputTextLog  |  ( |   | ) |   const
◆ SetIdRemap()
 void ON_TextHash::SetIdRemap  |  ( |  bool  |  bEnableIdRemap | )
Parameters: bEnableIdRemap - [in] if bEnableIdRemap is true, the sequences of code points that match the format XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX where X is a hexadecimal digit (0-9, a-f, or A-F) and the hyphen is literal. will be replaced with an id created by ON_NextNotUniqueId(). This is used for comparing code that generates streams containg new uuids.
◆ SetOutputTextLog()
 void ON_TextHash::SetOutputTextLog  |  ( |  ON_TextLog *  |  output_text_log | )
Description: In some testing situations, the output text log can be set when it is necessary to see the text used to compute the SHA-1 hash. The has can be caluculate which no output text log.
Parameters: output_text_log - [in] Destination text log for the mtext used to calculate the hash.
◆ SetStringMap() [1/2]
 void ON_TextHash::SetStringMap  |  ( |  const class ON_Locale &  |  locale,
|  ON_StringMapType  |  map_type
)
◆ SetStringMap() [2/2]
 void ON_TextHash::SetStringMap  |  ( |  ON_StringMapOrdinalType  |  map_type | )
◆ StringMapLocale()
 const class ON_Locale& ON_TextHash::StringMapLocale  |  ( |   | ) |   const
◆ StringMapType()
 ON_StringMapType ON_TextHash::StringMapType  |  ( |   | ) |   const