Public Member Functions | Protected Attributes | List of all members
CRhRdkPreviewAppearanceDefaults Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkPreviewAppearanceDefaults:
 Public Member Functions
CRhRdkPreviewAppearanceDefaults ()
virtual  | ~CRhRdkPreviewAppearanceDefaults ()
virtual const wchar_t *  | Background (void) const override
virtual const UUID &  | EnvironmentInstance (void) const override
virtual void *  | EVF (const wchar_t *, void *) override
virtual const wchar_t *  | Geometry (void) const override
virtual const wchar_t *  | Lighting (void) const override
virtual IRhRdkPreviewSceneServer::eRotationType  | RotationType (void) const override
virtual double  | RotationX (void) const override
virtual double  | RotationY (void) const override
void  | Set (const wchar_t *wszGeometry, const wchar_t *wszBackground, const wchar_t *wszLighting, const UUID &uuidEnvironmentInstance, double dAngleX, double dAngleY, double dSize, IRhRdkPreviewSceneServer::eRotationType rt)
virtual double  | Size (void) const override
 Public Member Functions inherited from IRhRdkPreviewAppearanceDefaults
virtual  | ~IRhRdkPreviewAppearanceDefaults ()
 Protected Attributes
CImpl *  | m_pImpl
Constructor & Destructor Documentation
◆ CRhRdkPreviewAppearanceDefaults()
 CRhRdkPreviewAppearanceDefaults::CRhRdkPreviewAppearanceDefaults  |  ( |   | )
◆ ~CRhRdkPreviewAppearanceDefaults()
 virtual CRhRdkPreviewAppearanceDefaults::~CRhRdkPreviewAppearanceDefaults  |  ( |   | )
virtual
Member Function Documentation
◆ Background()
 virtual const wchar_t* CRhRdkPreviewAppearanceDefaults::Background  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The canned background type. Valid strings for background are given above as SS_PB...
Implements IRhRdkPreviewAppearanceDefaults.
◆ EnvironmentInstance()
 virtual const UUID& CRhRdkPreviewAppearanceDefaults::EnvironmentInstance  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The environment instance to use for lighting and background if required.
Implements IRhRdkPreviewAppearanceDefaults.
◆ EVF()
 virtual void* CRhRdkPreviewAppearanceDefaults::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
overridevirtual
Emergency virtual function for future expansion.
Implements IRhRdkPreviewAppearanceDefaults.
◆ Geometry()
 virtual const wchar_t* CRhRdkPreviewAppearanceDefaults::Geometry  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The canned geometry type. Valid strings for geometry are given above as SS_PG...
Implements IRhRdkPreviewAppearanceDefaults.
◆ Lighting()
 virtual const wchar_t* CRhRdkPreviewAppearanceDefaults::Lighting  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The canned lighting type. Valid strings for lighting are given above as SS_PL...
Implements IRhRdkPreviewAppearanceDefaults.
◆ RotationType()
 virtual IRhRdkPreviewSceneServer::eRotationType CRhRdkPreviewAppearanceDefaults::RotationType  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The rotation type.
Implements IRhRdkPreviewAppearanceDefaults.
◆ RotationX()
 virtual double CRhRdkPreviewAppearanceDefaults::RotationX  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The X rotation angle in degrees.
Implements IRhRdkPreviewAppearanceDefaults.
◆ RotationY()
 virtual double CRhRdkPreviewAppearanceDefaults::RotationY  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The Y rotation angle in degrees.
Implements IRhRdkPreviewAppearanceDefaults.
◆ Set()
 void CRhRdkPreviewAppearanceDefaults::Set  |  ( |  const wchar_t *  |  wszGeometry,
|  const wchar_t *  |  wszBackground,
|  const wchar_t *  |  wszLighting,
|  const UUID &  |  uuidEnvironmentInstance,
|  double  |  dAngleX,
|  double  |  dAngleY,
|  double  |  dSize,
|  IRhRdkPreviewSceneServer::eRotationType  |  rt
)
◆ Size()
 virtual double CRhRdkPreviewAppearanceDefaults::Size  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The size of the object in units (base scenes are generally unit-sized).
Implements IRhRdkPreviewAppearanceDefaults.
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkPreviewAppearanceDefaults::m_pImpl
protected