Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDFacePtr Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
class ON_SubDFace *  | Face () const
ON__UINT_PTR  | FaceDirection () const
bool  | IsNull () const
ON_ComponentStatus  | Status () const
 Static Public Member Functions
static class ON_SubDFacePtr  | Create (const class ON_SubDFace *face, ON__UINT_PTR direction)
static ON_SubDFacePtr  | Create (const class ON_SubDComponentPtr &face_component)
 Public Attributes
ON__UINT_PTR  | m_ptr
 Static Public Attributes
static const ON_SubDFacePtr  | Null
Member Function Documentation
◆ Create() [1/2]
 static class ON_SubDFacePtr ON_SubDFacePtr::Create  |  ( |  const class ON_SubDFace *  |  face,
|  ON__UINT_PTR  |  direction
)
static
◆ Create() [2/2]
 static ON_SubDFacePtr ON_SubDFacePtr::Create  |  ( |  const class ON_SubDComponentPtr &  |  face_component | )
static
◆ Face()
 class ON_SubDFace* ON_SubDFacePtr::Face  |  ( |   | ) |   const
◆ FaceDirection()
 ON__UINT_PTR ON_SubDFacePtr::FaceDirection  |  ( |   | ) |   const
◆ IsNull()
 bool ON_SubDFacePtr::IsNull  |  ( |   | ) |   const
◆ Status()
 ON_ComponentStatus ON_SubDFacePtr::Status  |  ( |   | ) |   const
Member Data Documentation
◆ m_ptr
 ON__UINT_PTR ON_SubDFacePtr::m_ptr
For performance reasons, m_ptr is not initialized and no constructors are declared or implemented. If you require initialization, then use x = ON_SubDFacePtr::Null or x = ON_SubDFacePtr::Create(...).
◆ Null
 const ON_SubDFacePtr ON_SubDFacePtr::Null
static