Public Member Functions | Protected Member Functions | List of all members
CRhRdkSection_MFC Class Reference
RDK
#include <RhRdkSections_MFC.h>
 Inheritance diagram for CRhRdkSection_MFC:
 Public Member Functions
virtual std::shared_ptr< IRhinoUiController >  | Controller (void) const override
virtual ON_UUID  | ControllerId (void) const override
virtual void  | Delete (void) override
virtual void  | Enable (bool bEnable) override
virtual bool  | EnableHeaderButton (int index, bool bEnable) override
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual ON_Color  | GetBackgroundColor (void) const override
virtual int  | GetHeight (void) const override
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const override
virtual HWND  | GetWindow (void) override
virtual bool  | IsCollapsible (void) const override
virtual bool  | IsCreated (void) const override
virtual bool  | IsEnabled (void) const override
virtual bool  | IsHidden (void) const override
virtual bool  | IsInitiallyExpanded (void) const override
virtual bool  | IsShown (void) const override
virtual void  | Move (const ON_4iRect &rect, bool bRepaint=false, bool bRepaintBorder=false) override
virtual IRhRdkHeaderButtonHandler *  | NewHeaderButtonHandler (void)
virtual void  | OnAttachedToHolder (IRhinoUiHolder &h) override
virtual void  | OnAttachingToHolder (IRhinoUiHolder &h) override
virtual void  | OnControllerActivatedEvent (IRhinoUiController &) override
virtual void  | OnDetachedFromHolder (IRhinoUiHolder &h) override
virtual void  | OnDetachingFromHolder (IRhinoUiHolder &h) override
virtual void  | OnExpandSection (bool bExpanding) override
virtual HWND  | Parent (void) const override
virtual void  | Refresh (bool bImmediate=false) override
virtual void  | SetBackgroundColor (const ON_Color &col) override
virtual void  | SetController (std::shared_ptr< IRhinoUiController >) override
virtual void  | SetFocus (void) override
virtual void  | SetParent (HWND pParent) override
virtual ON_wString  | SettingsTag (void) const override
virtual void  | Show (bool bShow) override
virtual bool  | ShowHeaderButton (int index, bool bShow) override
virtual void  | UpdateView (unsigned int flags) override
 Public Member Functions inherited from CRhRdkSectionBase_MFC
CRhRdkSectionBase_MFC (unsigned int idd, CWnd *pParent=nullptr)
void *  | GetData (const UUID &uuidData, bool bForWrite) const
bool  | IsBlocking (void) const
 Public Member Functions inherited from CRhRdkResizingDialog
CRhRdkResizingDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
CRhRdkResizingDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhRdkResizingDialog ()
virtual BOOL  | AddControlString (HWND hwnd, const TCHAR *szText)
virtual void  | DisplayData (void)
virtual void  | EnableDisableControls (void)
virtual BOOL  | IsControlClipped (CWnd *pWnd)
virtual void  | OnPreInitResizing (void)
virtual void  | SetAutoSubclassGroupBoxes (BOOL bSubclass)
virtual void  | SetFillBackground (BOOL bFill)
virtual void  | SetReleaseClipping (BOOL bRelease)
virtual void  | SetResizingConstraints (BOOL bAllowResizeWidth, BOOL bAllowResizeHeight)
 Public Member Functions inherited from CRhinoDialog
CRhinoDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr)
Modal construct. More...
CRhinoDialog (UINT nIDTemplate, CWnd *pParentWnd=nullptr)
virtual  | ~CRhinoDialog ()
CSize  | CalcDialogSize (INT nResourceId)
BOOL  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr) override
Modeless construct. More...
BOOL  | Create (UINT nIDTemplate, CWnd *pParentWnd=nullptr) override
UINT  | DialogID ()
LPCTSTR  | DialogStringID ()
unsigned int  | DocumentSerialNumber () const
virtual INT_PTR  | DoModal ()
bool  | EnableDisplayCommands () const
void  | EnableSaveDialogPositionAndSize (bool bEnable=true, const wchar_t *wRegistryTitle=nullptr)
bool  | IsSaveDialogPositionAndSizeEnabled () const
void  | Localize ()
virtual void  | OnColorButtonClicked (UINT nBtnID)
Called by CRhColorButton if button clicked and color changed;. More...
void  | OnRhinoHelpButton ()
Dialog Utilities. More...
BOOL  | PreTranslateMessage (MSG *pMsg) override
Overrides. More...
bool  | PushPickButton (bool hide_this_dialog)
void  | SetEnableDisplayCommands (bool b, unsigned int documentRuntimeSerialNumber)
void  | SetEnableDisplayCommands (bool b)
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
virtual BOOL  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Public Member Functions inherited from IRhinoUiSection
virtual UUID  | Uuid (void) const =0
 Public Member Functions inherited from IRhinoUiWindow
virtual ON_wString  | Caption (bool bAlwaysEnglish=false) const =0
 Public Member Functions inherited from IRhinoUiControllerEventWatcher
virtual void  | OnEvent (IRhinoUiController &con, const UUID &uuidData, IRhinoUiController::EventPriority ep, const IRhinoUiEventInfo *pInfo)=0
 Protected Member Functions
CRhRdkSection_MFC (unsigned int idd, CWnd *pParent=nullptr)
virtual  | ~CRhRdkSection_MFC ()
virtual IRhinoUiSection &  | Interface (void) override
virtual const IRhinoUiSection &  | Interface (void) const override
 Protected Member Functions inherited from CRhRdkSectionBase_MFC
virtual  | ~CRhRdkSectionBase_MFC ()
virtual COLORREF  | BackgroundColor (void) const
virtual void  | DeferWindowPositionAndSize (HDWP &hdwp, CWnd &destWnd, CWnd &srceWnd) const
virtual int  | GetDefaultHeight (void) const
virtual unsigned int  | GetIDD (void) const =0
virtual AFX_MODULE_STATE *  | GetModuleState (void) const =0
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnEnable (BOOL bEnable)
afx_msg BOOL  | OnEraseBkgnd (CDC *pDC)
virtual BOOL  | OnInitDialog () override
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnRhinoOptionsSearchShowControlParent (WPARAM, LPARAM)
afx_msg void  | OnTimer (UINT_PTR nTimerId)
virtual BOOL  | PreCreateWindow (CREATESTRUCT &cs) override
virtual void  | Refresh (void)
virtual void  | SetBackgroundColor (COLORREF cr)
virtual void  | SetControlPositionAndSize (void)
virtual void  | SetWindowPositionAndSize (CWnd &destWnd, CWnd &srceWnd) const
 Protected Member Functions inherited from CRhRdkResizingDialog
virtual void  | HideControl (UINT id, int width)
virtual void  | InitControl (UINT id, int l, int t, int r, int b, int o, int iPos)
afx_msg void  | OnDestroy (void)
afx_msg LRESULT  | OnNcHitTest (CPoint)
afx_msg void  | OnSize (UINT, int, int)
afx_msg void  | OnSysCommand (UINT, LPARAM)
afx_msg BOOL  | OnToolTipNotify (UINT, NMHDR *, LRESULT *)
virtual void  | RepositionControls (BOOL bInit)
virtual void  | SizeControl (UINT id, int l, int t, int r, int b, int o, int iPos)
virtual void  | SubclassGroupBoxes ()
virtual void  | UnsubclassGroupBoxes ()
 Protected Member Functions inherited from CRhinoDialog
virtual BOOL  | ContinueModal ()
Implementation. More...
void  | DoDataExchange (CDataExchange *pDX) override
DDX/DDV support. More...
virtual void  | OnCancel ()
virtual BOOL  | OnCommand (WPARAM wParam, LPARAM lParam)
override; ///<not an override on OSX More...
afx_msg void  | OnDestroy ()
afx_msg BOOL  | OnHelpInfo (HELPINFO *pHelpInfo)
virtual void  | OnOK ()
LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam) override
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
BOOL  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
 Protected Member Functions inherited from IRhinoUiSection
virtual  | ~IRhinoUiSection ()
 Protected Member Functions inherited from IRhinoUiWithController
virtual  | ~IRhinoUiWithController ()
 Protected Member Functions inherited from IRhinoUiWindow
virtual  | ~IRhinoUiWindow ()
 Protected Member Functions inherited from IRhinoUiControllerEventWatcher
virtual  | ~IRhinoUiControllerEventWatcher ()
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Public Types inherited from IRhinoUiSection
enum  | : unsigned int { updv_DisplayData = 0x0001, updv_EnableDisable = 0x0002, updv_UpdateLayout = 0x0004 }
 Static Public Member Functions inherited from CRhinoDialog
static int  | CheckSemiModalMessagePump ()
static bool  | InDoSemiModal ()
 Public Attributes inherited from CRhinoDialog
class CRhDialogSdkExtension *  | m__rhino_dialog_sdk_extension
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
Constructor & Destructor Documentation
◆ CRhRdkSection_MFC()
 CRhRdkSection_MFC::CRhRdkSection_MFC  |  ( |  unsigned int  |  idd,
|  CWnd *  |  pParent = nullptr
)
protected
◆ ~CRhRdkSection_MFC()
 virtual CRhRdkSection_MFC::~CRhRdkSection_MFC  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ Controller()
 virtual std::shared_ptr<IRhinoUiController> CRhRdkSection_MFC::Controller  |  ( |  void  |   | ) |   const
overridevirtual
Get the controller associated with this window.
Implements IRhinoUiWithController.
◆ ControllerId()
 virtual ON_UUID CRhRdkSection_MFC::ControllerId  |  ( |  void  |   | ) |   const
inlineoverridevirtual
If your UI requires a specific registered controller, return its ID here - otherwise return ON_nil_uuid.
Implements IRhinoUiWithController.
◆ Delete()
 virtual void CRhRdkSection_MFC::Delete  |  ( |  void  |   | )
overridevirtual
Destroys the underlying window and deletes the object.
Implements IRhinoUiWindow.
◆ Enable()
 virtual void CRhRdkSection_MFC::Enable  |  ( |  bool  |  bEnable | )
overridevirtual
Enables or disables the window.
Parameters
bEnable | is true to enable the window or false to disable it.
Implements IRhinoUiWindow.
◆ EnableHeaderButton()
 virtual bool CRhRdkSection_MFC::EnableHeaderButton  |  ( |  int  |  index,
|  bool  |  bEnable
)
overridevirtual
Enable or disable a header button.
Parameters
index | is the index of the button.
bEnable | is the enable state.
Implements IRhinoUiSection.
◆ EVF()
 virtual void* CRhRdkSection_MFC::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
overridevirtual
Reimplemented from CRhRdkResizingDialog.
◆ GetBackgroundColor()
 virtual ON_Color CRhRdkSection_MFC::GetBackgroundColor  |  ( |  void  |   | ) |   const
overridevirtual
Returns
the background color of the section.
Implements IRhinoUiSection.
◆ GetHeight()
 virtual int CRhRdkSection_MFC::GetHeight  |  ( |  void  |   | ) |   const
overridevirtual
Returns
the height of the section in pixels. This is usually the same as the default height but can be overridden to enable variable-height sections.
Note
This method is called continuously by the holder and should be implemented to be as fast as possible.
Implements IRhinoUiSection.
◆ GetScreenCoords()
 virtual void CRhRdkSection_MFC::GetScreenCoords  |  ( |  ON_4iRect &  |  rectOut | ) |   const
overridevirtual
Get the screen coordinates of the underlying window.
Parameters
rectOut | accepts the coordinates.
Implements IRhinoUiWindow.
◆ GetWindow()
 virtual HWND CRhRdkSection_MFC::GetWindow  |  ( |  void  |   | )
overridevirtual
Do not use
Implements IRhinoUiWindow.
◆ Interface() [1/2]
 virtual IRhinoUiSection& CRhRdkSection_MFC::Interface  |  ( |  void  |   | )
overrideprotectedvirtual
Implements CRhRdkSectionBase_MFC.
◆ Interface() [2/2]
 virtual const IRhinoUiSection& CRhRdkSection_MFC::Interface  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Implements CRhRdkSectionBase_MFC.
◆ IsCollapsible()
 virtual bool CRhRdkSection_MFC::IsCollapsible  |  ( |  void  |   | ) |   const
overridevirtual
If this method returns false, the holder will not allow the user to collapse the section.
Returns
true if the section is collapsible, else false.
Implements IRhinoUiSection.
◆ IsCreated()
 virtual bool CRhRdkSection_MFC::IsCreated  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if the underlying window has been created, else false.
Implements IRhinoUiWindow.
◆ IsEnabled()
 virtual bool CRhRdkSection_MFC::IsEnabled  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if the window is enabled, else false.
Implements IRhinoUiWindow.
◆ IsHidden()
 virtual bool CRhRdkSection_MFC::IsHidden  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if the section should be hidden, else false.
Note
This is not to be confused with IRhinoUiWindow::IsShown(). IsHidden() tells the holder whether or not to completely hide the section and its header. IsShown() reports the current visible state of the section window which is invisible even if the section is only collapsed.
 This method is called continuously by the holder and should be implemented to be as fast as possible.
Implements IRhinoUiSection.
◆ IsInitiallyExpanded()
 virtual bool CRhRdkSection_MFC::IsInitiallyExpanded  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if the section is initially expanded. This is used to determine the section's default expanded state. Thereafter, the expanded state is remembered by the RDK in the persistent settings.
Implements IRhinoUiSection.
◆ IsShown()
 virtual bool CRhRdkSection_MFC::IsShown  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if the window is being shown, else false.
Implements IRhinoUiWindow.
◆ Move()
 virtual void CRhRdkSection_MFC::Move  |  ( |  const ON_4iRect &  |  rect,
|  bool  |  bRepaint = false,
|  bool  |  bRepaintBorder = false
)
overridevirtual
Moves the underlying window.
Parameters
rect | is the rectangle to move to within the parent.
Implements IRhinoUiWindow.
◆ NewHeaderButtonHandler()
 virtual IRhRdkHeaderButtonHandler* CRhRdkSection_MFC::NewHeaderButtonHandler  |  ( |  void  |   | )
virtual
If you want to create buttons on the section's header, you should override this method to return a pointer to a new instance of an object that implements IRhRdkHeaderButtonHandler.
Note
RDK takes ownership of this object. If you previously multiple-inherited your section from IRhRdkHeaderButtonHandler, you must change your code so that your header button handler is an independent lightweight object.
See also
IRhRdkHeaderButtonHandler
Implements IRhinoUiSection.
◆ OnAttachedToHolder()
 virtual void CRhRdkSection_MFC::OnAttachedToHolder  |  ( |  IRhinoUiHolder &  |  h | )
overridevirtual
Optionally implement this method to handle just after the section is attached to a holder. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ OnAttachingToHolder()
 virtual void CRhRdkSection_MFC::OnAttachingToHolder  |  ( |  IRhinoUiHolder &  |  h | )
overridevirtual
Optionally implement this method to handle just before the section is attached to a holder. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ OnControllerActivatedEvent()
 virtual void CRhRdkSection_MFC::OnControllerActivatedEvent  |  ( |  IRhinoUiController &  |  con | )
inlineoverridevirtual
Implement this method to handle an event when the controller is first activated.
Implements IRhinoUiControllerEventWatcher.
◆ OnDetachedFromHolder()
 virtual void CRhRdkSection_MFC::OnDetachedFromHolder  |  ( |  IRhinoUiHolder &  |  h | )
overridevirtual
Optionally implement this method to handle just after the section is detached from a holder. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ OnDetachingFromHolder()
 virtual void CRhRdkSection_MFC::OnDetachingFromHolder  |  ( |  IRhinoUiHolder &  |  h | )
overridevirtual
Optionally implement this method to handle just before the section is detached from a holder. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ OnExpandSection()
 virtual void CRhRdkSection_MFC::OnExpandSection  |  ( |  bool  |  bExpanding | )
overridevirtual
Optionally implement this method to handle when the section is expanded or closed-up. This happens when the user clicks the section header. If you don't want to handle this, just implement the method to do nothing.
Implements IRhinoUiSection.
◆ Parent()
 virtual HWND CRhRdkSection_MFC::Parent  |  ( |  void  |   | ) |   const
overridevirtual
Get the parent (host) window. This will return null unless a parent has been set in SetParent().
Implements IRhinoUiWindow.
◆ Refresh()
 virtual void CRhRdkSection_MFC::Refresh  |  ( |  bool  |  bImmediate = false | )
overridevirtual
Refreshes the window by repainting it.
Parameters
bImmediate | is true if the window should be repainted immediately, else false.
Note
On Microsoft Windows, Refresh(true) is equivalent to RedrawWindow() and Refresh(false) is equivalent to Invalidate().
Implements IRhinoUiWindow.
◆ SetBackgroundColor()
 virtual void CRhRdkSection_MFC::SetBackgroundColor  |  ( |  const ON_Color &  |  col | )
overridevirtual
Set the background color of the section.
Parameters
col | is the color to use.
Implements IRhinoUiSection.
◆ SetController()
 virtual void CRhRdkSection_MFC::SetController  |  ( |  std::shared_ptr< IRhinoUiController >  |  con | )
overridevirtual
Set the controller associated with this window.
Implements IRhinoUiWithController.
◆ SetFocus()
 virtual void CRhRdkSection_MFC::SetFocus  |  ( |  void  |   | )
overridevirtual
Sets the keyboard focus to the window.
Implements IRhinoUiWindow.
◆ SetParent()
 virtual void CRhRdkSection_MFC::SetParent  |  ( |  HWND  |  parent | )
overridevirtual
Set the parent (host) window.
Parameters
parent | is the parent to host the window on.
Note
When the object uses a controller, the controller must be set before calling SetParent() otherwise creation of the underlying control may fail.
Implements IRhinoUiWindow.
◆ SettingsTag()
 virtual ON_wString CRhRdkSection_MFC::SettingsTag  |  ( |  void  |   | ) |   const
overridevirtual
Implement this method to return a unique string used to identify the section when loading and saving the section's state. This can usually be implemented to return a string version of the section's Uuid() unless something special is needed.
Implements IRhinoUiSection.
◆ Show()
 virtual void CRhRdkSection_MFC::Show  |  ( |  bool  |  bShow | )
overridevirtual
Shows or hides the window.
Parameters
bShow | is true to show the window or false to hide it.
Implements IRhinoUiWindow.
◆ ShowHeaderButton()
 virtual bool CRhRdkSection_MFC::ShowHeaderButton  |  ( |  int  |  index,
|  bool  |  bShow
)
overridevirtual
Show or hide a header button.
Parameters
index | is the index of the button.
bShow | is the show state.
Implements IRhinoUiSection.
◆ UpdateView()
 virtual void CRhRdkSection_MFC::UpdateView  |  ( |  unsigned int  |  flags | )
overridevirtual
Updates the 'view' of the section according to the specified flags.
Parameters
flags | specifies what to update. See the enum above.
Implements IRhinoUiSection.