Public Member Functions | Public Attributes | List of all members
ON_ClippingPlane Class Reference
OpenNURBS
#include <opennurbs_plane.h>
 Public Member Functions
ON_ClippingPlane ()
~ON_ClippingPlane ()
ON_ClippingPlaneInfo  | ClippingPlaneInfo () const
void  | Default ()
bool  | Read (class ON_BinaryArchive &)
bool  | Write (class ON_BinaryArchive &) const
 Public Attributes
bool  | m_bEnabled
true if this clipping plane is active More...
ON_Plane  | m_plane
ON_UUID  | m_plane_id
ON_UuidList  | m_viewport_ids
ids of viewports that this clipping plane "clips" More...
Constructor & Destructor Documentation
◆ ON_ClippingPlane()
 ON_ClippingPlane::ON_ClippingPlane  |  ( |   | )
◆ ~ON_ClippingPlane()
 ON_ClippingPlane::~ON_ClippingPlane  |  ( |   | )
Member Function Documentation
◆ ClippingPlaneInfo()
 ON_ClippingPlaneInfo ON_ClippingPlane::ClippingPlaneInfo  |  ( |   | ) |   const
◆ Default()
 void ON_ClippingPlane::Default  |  ( |   | )
◆ Read()
 bool ON_ClippingPlane::Read  |  ( |  class ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_ClippingPlane::Write  |  ( |  class ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bEnabled
 bool ON_ClippingPlane::m_bEnabled
true if this clipping plane is active
◆ m_plane
 ON_Plane ON_ClippingPlane::m_plane
◆ m_plane_id
 ON_UUID ON_ClippingPlane::m_plane_id
◆ m_viewport_ids
 ON_UuidList ON_ClippingPlane::m_viewport_ids
ids of viewports that this clipping plane "clips"