Classes | Public Types | Public Member Functions | Protected Member Functions | List of all members
IRhRdkRhinoSettings Class Referenceabstract
RDK
#include <RhRdkDataSource.h>
 Classes
class  | CLightInfo
 Public Types
enum  | : unsigned int { IncludeDeletedLights = 0x01, IncludeLightsOnHiddenLayers = 0x02 }
 Public Member Functions
virtual CRhinoView *  | ActiveView (void) const =0
virtual void  | CopyFrom (const IRhRdkRhinoSettings &rs)=0
virtual void *  | EVF (const wchar_t *, void *)=0
virtual const ON_3dmRenderSettings &  | Get3dmRenderSettings (void) const =0
virtual void  | GetCustomRenderSizes (OUT ON_SimpleArray< ON_2iSize > &aSize) const =0
virtual const ON_EarthAnchorPoint &  | GetEarthAnchorPoint (void) const =0
virtual void  | GetLights (OUT ON_ClassArray< CLightInfo > &, unsigned int flags) const =0
virtual const ON_3dmUnitsAndTolerances &  | GetModelUnitsAndTolerances (void) const =0
virtual const ON_3dmUnitsAndTolerances &  | GetPageUnitsAndTolerances (void) const =0
virtual bool  | GroundPlaneOnInViewDisplayMode (const CRhinoView &view) const =0
const ON_3dmView *  | RenderingView (void) const
virtual void  | Set3dmRenderSettings (const ON_3dmRenderSettings &rs)=0
virtual void  | SetEarthAnchorPoint (const ON_EarthAnchorPoint &eap)=0
virtual void  | SetEarthAnchorPointNorth (double dNorth)=0
virtual void  | SetGroundPlaneOnInViewDisplayMode (const CRhinoView &view, bool bOn)=0
virtual void  | SetLights (const ON_ClassArray< CLightInfo > &)=0
virtual void  | SetModelUnitsAndTolerances (const ON_3dmUnitsAndTolerances &ut, bool bScaleModelObjects=false)=0
virtual void  | SetPageUnitsAndTolerances (const ON_3dmUnitsAndTolerances &ut, bool bScalePaperObjects=false)=0
virtual CDisplayPipelineAttributes *  | ViewDisplayAttributes (const CRhinoView &view) const =0
virtual bool  | ViewSupportsShading (const CRhinoView &view) const =0
 Protected Member Functions
virtual  | ~IRhRdkRhinoSettings ()
Detailed Description
This interface is returned by IRhinoUiDataSource::GetData(uuidData_RdkRhinoSettings)
See also
uuidData_RdkRhinoSettings
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned int
Enumerator
IncludeDeletedLights
IncludeLightsOnHiddenLayers
Constructor & Destructor Documentation
◆ ~IRhRdkRhinoSettings()
 virtual IRhRdkRhinoSettings::~IRhRdkRhinoSettings  |  ( |   | )
inlineprotectedvirtual
Member Function Documentation
◆ ActiveView()
 virtual CRhinoView* IRhRdkRhinoSettings::ActiveView  |  ( |  void  |   | ) |   const
pure virtual
Get the active Rhino view. Deprecated - use RenderingView instead
◆ CopyFrom()
 virtual void IRhRdkRhinoSettings::CopyFrom  |  ( |  const IRhRdkRhinoSettings &  |  rs | )
pure virtual
Copy this object from another one.
◆ EVF()
 virtual void* IRhRdkRhinoSettings::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
pure virtual
Emergency virtual function for future expansion. "RenderingView" returns const ON_3dmView*. Supports ON_3dmRenderSettings::RenderingSources
◆ Get3dmRenderSettings()
 virtual const ON_3dmRenderSettings& IRhRdkRhinoSettings::Get3dmRenderSettings  |  ( |  void  |   | ) |   const
pure virtual
Get the underlying ON_3dmRenderSettings.
◆ GetCustomRenderSizes()
 virtual void IRhRdkRhinoSettings::GetCustomRenderSizes  |  ( |  OUT ON_SimpleArray< ON_2iSize > &  |  aSize | ) |   const
pure virtual
Get the custom render sizes specified by Rhino.
◆ GetEarthAnchorPoint()
 virtual const ON_EarthAnchorPoint& IRhRdkRhinoSettings::GetEarthAnchorPoint  |  ( |  void  |   | ) |   const
pure virtual
Get the underlying ON_EarthAnchorPoint.
◆ GetLights()
 virtual void IRhRdkRhinoSettings::GetLights  |  ( |  OUT ON_ClassArray< CLightInfo > &  |  ,
|  unsigned int  |  flags
) |   |  const
pure virtual
Get the underlying lights.
◆ GetModelUnitsAndTolerances()
 virtual const ON_3dmUnitsAndTolerances& IRhRdkRhinoSettings::GetModelUnitsAndTolerances  |  ( |  void  |   | ) |   const
pure virtual
Get the underlying model ON_3dmUnitsAndTolerances.
◆ GetPageUnitsAndTolerances()
 virtual const ON_3dmUnitsAndTolerances& IRhRdkRhinoSettings::GetPageUnitsAndTolerances  |  ( |  void  |   | ) |   const
pure virtual
Get the underlying page ON_3dmUnitsAndTolerances.
◆ GroundPlaneOnInViewDisplayMode()
 virtual bool IRhRdkRhinoSettings::GroundPlaneOnInViewDisplayMode  |  ( |  const CRhinoView &  |  view | ) |   const
pure virtual
◆ RenderingView()
 const ON_3dmView* IRhRdkRhinoSettings::RenderingView  |  ( |  void  |   | ) |   const
◆ Set3dmRenderSettings()
 virtual void IRhRdkRhinoSettings::Set3dmRenderSettings  |  ( |  const ON_3dmRenderSettings &  |  rs | )
pure virtual
Set the underlying ON_3dmRenderSettings.
◆ SetEarthAnchorPoint()
 virtual void IRhRdkRhinoSettings::SetEarthAnchorPoint  |  ( |  const ON_EarthAnchorPoint &  |  eap | )
pure virtual
Set the underlying ON_EarthAnchorPoint.
◆ SetEarthAnchorPointNorth()
 virtual void IRhRdkRhinoSettings::SetEarthAnchorPointNorth  |  ( |  double  |  dNorth | )
pure virtual
Helper to just set the underlying ON_EarthAnchorPoint north direction.
◆ SetGroundPlaneOnInViewDisplayMode()
 virtual void IRhRdkRhinoSettings::SetGroundPlaneOnInViewDisplayMode  |  ( |  const CRhinoView &  |  view,
|  bool  |  bOn
)
pure virtual
◆ SetLights()
 virtual void IRhRdkRhinoSettings::SetLights  |  ( |  const ON_ClassArray< CLightInfo > &  |   | )
pure virtual
Set the underlying lights.
◆ SetModelUnitsAndTolerances()
 virtual void IRhRdkRhinoSettings::SetModelUnitsAndTolerances  |  ( |  const ON_3dmUnitsAndTolerances &  |  ut,
|  bool  |  bScaleModelObjects = false
)
pure virtual
Set the underlying model ON_3dmUnitsAndTolerances.
◆ SetPageUnitsAndTolerances()
 virtual void IRhRdkRhinoSettings::SetPageUnitsAndTolerances  |  ( |  const ON_3dmUnitsAndTolerances &  |  ut,
|  bool  |  bScalePaperObjects = false
)
pure virtual
Set the underlying page ON_3dmUnitsAndTolerances.
◆ ViewDisplayAttributes()
 virtual CDisplayPipelineAttributes* IRhRdkRhinoSettings::ViewDisplayAttributes  |  ( |  const CRhinoView &  |  view | ) |   const
pure virtual
◆ ViewSupportsShading()
 virtual bool IRhRdkRhinoSettings::ViewSupportsShading  |  ( |  const CRhinoView &  |  view | ) |   const
pure virtual