Public Attributes | List of all members
CRhRdkPreviewMetaData::CItem Class Referencefinal
#include <RhRdkUiSdk.h>
 Public Attributes
double  | m_dRotationX = 0.0
double  | m_dRotationY = 0.0
double  | m_dSize = 0.0
UINT_PTR  | m_Reserved = 0
ON_wString  | m_sBackground
ON_wString  | m_sGeometry
ON_wString  | m_sLighting
ON_wString  | m_sRotationType
UUID  | m_uuidContentInstance = ON_nil_uuid
UUID  | m_uuidCustomEnvironment = ON_nil_uuid
Member Data Documentation
◆ m_dRotationX
 double CRhRdkPreviewMetaData::CItem::m_dRotationX = 0.0
◆ m_dRotationY
 double CRhRdkPreviewMetaData::CItem::m_dRotationY = 0.0
◆ m_dSize
 double CRhRdkPreviewMetaData::CItem::m_dSize = 0.0
◆ m_Reserved
 UINT_PTR CRhRdkPreviewMetaData::CItem::m_Reserved = 0
◆ m_sBackground
 ON_wString CRhRdkPreviewMetaData::CItem::m_sBackground
◆ m_sGeometry
 ON_wString CRhRdkPreviewMetaData::CItem::m_sGeometry
◆ m_sLighting
 ON_wString CRhRdkPreviewMetaData::CItem::m_sLighting
◆ m_sRotationType
 ON_wString CRhRdkPreviewMetaData::CItem::m_sRotationType
◆ m_uuidContentInstance
 UUID CRhRdkPreviewMetaData::CItem::m_uuidContentInstance = ON_nil_uuid
◆ m_uuidCustomEnvironment
 UUID CRhRdkPreviewMetaData::CItem::m_uuidCustomEnvironment = ON_nil_uuid