Public Member Functions | Static Public Member Functions | List of all members
CRhRdkSun Class Reference
RDK
#include <RhRdkSun.h>
 Inheritance diagram for CRhRdkSun:
 Public Member Functions
CRhRdkSun ()
CRhRdkSun (const CRhRdkSun &other)
virtual  | ~CRhRdkSun ()
operator IRhRdkSun & (void) const
bool  | operator!= (const CRhRdkSun &other) const
const CRhRdkSun &  | operator= (const CRhRdkSun &other)
bool  | operator== (const CRhRdkSun &other) const
virtual IRhRdkSun &  | Sun (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Static Public Member Functions
static IRhRdkSun *  | NewImpl ()
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Detailed Description
This class represents a 'sun'. It is used to get a light that represents a sun, but please note that this is not necessarily the RDK Document Sun. To use it, create one on the stack. Call Sun() to get an interface to the sun. Call the interface's various set methods to configure the sun the way you want it. Then call Light() to get an ON_Light to use as the sun.
Constructor & Destructor Documentation
◆ CRhRdkSun() [1/2]
 CRhRdkSun::CRhRdkSun  |  ( |   | )
◆ CRhRdkSun() [2/2]
 CRhRdkSun::CRhRdkSun  |  ( |  const CRhRdkSun &  |  other | )
◆ ~CRhRdkSun()
 virtual CRhRdkSun::~CRhRdkSun  |  ( |   | )
virtual
Member Function Documentation
◆ NewImpl()
 static IRhRdkSun* CRhRdkSun::NewImpl  |  ( |   | )
static
◆ operator IRhRdkSun &()
 CRhRdkSun::operator IRhRdkSun &  |  ( |  void  |   | ) |   const
inline
◆ operator!=()
 bool CRhRdkSun::operator!=  |  ( |  const CRhRdkSun &  |  other | ) |   const
◆ operator=()
 const CRhRdkSun& CRhRdkSun::operator=  |  ( |  const CRhRdkSun &  |  other | )
◆ operator==()
 bool CRhRdkSun::operator==  |  ( |  const CRhRdkSun &  |  other | ) |   const
◆ Sun()
 virtual IRhRdkSun& CRhRdkSun::Sun  |  ( |  void  |   | ) |   const
virtual
Returns
An interface to a temporary sun object.