Public Member Functions | List of all members
CRhRdkPreviewAppearanceDefaults_ByKind Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkPreviewAppearanceDefaults_ByKind:
 Public Member Functions
CRhRdkPreviewAppearanceDefaults_ByKind (CRhRdkContent::Kinds kind)
virtual  | ~CRhRdkPreviewAppearanceDefaults_ByKind ()
bool  | Load (void)
void  | Save (void) const
 Public Member Functions inherited from CRhRdkPreviewAppearanceDefaults
CRhRdkPreviewAppearanceDefaults ()
virtual  | ~CRhRdkPreviewAppearanceDefaults ()
virtual const wchar_t *  | Background (void) const override
virtual const UUID &  | EnvironmentInstance (void) const override
virtual void *  | EVF (const wchar_t *, void *) override
virtual const wchar_t *  | Geometry (void) const override
virtual const wchar_t *  | Lighting (void) const override
virtual IRhRdkPreviewSceneServer::eRotationType  | RotationType (void) const override
virtual double  | RotationX (void) const override
virtual double  | RotationY (void) const override
void  | Set (const wchar_t *wszGeometry, const wchar_t *wszBackground, const wchar_t *wszLighting, const UUID &uuidEnvironmentInstance, double dAngleX, double dAngleY, double dSize, IRhRdkPreviewSceneServer::eRotationType rt)
virtual double  | Size (void) const override
 Public Member Functions inherited from IRhRdkPreviewAppearanceDefaults
virtual  | ~IRhRdkPreviewAppearanceDefaults ()
 Additional Inherited Members
 Protected Attributes inherited from CRhRdkPreviewAppearanceDefaults
CImpl *  | m_pImpl
Constructor & Destructor Documentation
◆ CRhRdkPreviewAppearanceDefaults_ByKind()
 CRhRdkPreviewAppearanceDefaults_ByKind::CRhRdkPreviewAppearanceDefaults_ByKind  |  ( |  CRhRdkContent::Kinds  |  kind | )
◆ ~CRhRdkPreviewAppearanceDefaults_ByKind()
 virtual CRhRdkPreviewAppearanceDefaults_ByKind::~CRhRdkPreviewAppearanceDefaults_ByKind  |  ( |   | )
virtual
Member Function Documentation
◆ Load()
 bool CRhRdkPreviewAppearanceDefaults_ByKind::Load  |  ( |  void  |   | )
◆ Save()
 void CRhRdkPreviewAppearanceDefaults_ByKind::Save  |  ( |  void  |   | ) |   const