Public Member Functions | List of all members
CRhRdkGroundPlane Class Reference
RDK
#include <RhRdkGroundPlane.h>
 Inheritance diagram for CRhRdkGroundPlane:
 Public Member Functions
virtual double  | Altitude (void) const override
virtual bool  | AutoAltitude (void) const override
virtual IRhRdkGroundPlane &  | BeginChange (RhRdkChangeContext cc) const override
virtual void  | BeginNotifyBracket (void) override
virtual void  | CopyFrom (const IRhRdkGroundPlane &gp) override
virtual bool  | EndChange (void) override
virtual void  | EndNotifyBracket (void) override
virtual void *  | EVF (const wchar_t *, void *) override
virtual bool  | IsEqual (const IRhRdkGroundPlane &gp) const override
virtual const CRhRdkMaterial *  | Material (void) const override
virtual UUID  | MaterialInstanceId (void) const override
virtual bool  | On (void) const
bool  | operator!= (const CRhRdkGroundPlane &gp) const
const CRhRdkGroundPlane &  | operator= (const CRhRdkGroundPlane &gp)
bool  | operator== (const CRhRdkGroundPlane &gp) const
virtual void  | SetAltitude (double d) override
virtual void  | SetAutoAltitude (bool b) override
virtual void  | SetMaterialInstanceId (const UUID &u) override
virtual void  | SetOn (bool b) override
virtual void  | SetShadowOnly (bool b) override
virtual void  | SetShowUnderside (bool b) override
virtual void  | SetTextureOffset (const ON_2dVector &v) override
virtual void  | SetTextureOffsetLocked (bool b) override
virtual void  | SetTextureRepeatLocked (bool b) override
virtual void  | SetTextureRotation (double d) override
virtual void  | SetTextureSize (const ON_2dVector &v) override
virtual bool  | ShadowOnly (void) const override
virtual bool  | ShowUnderside (void) const override
virtual ON_2dVector  | TextureOffset (void) const override
virtual bool  | TextureOffsetLocked (void) const override
virtual bool  | TextureRepeatLocked (void) const override
virtual double  | TextureRotation (void) const override
virtual ON_2dVector  | TextureSize (void) const override
 Public Member Functions inherited from IRhRdkGroundPlane
virtual  | ~IRhRdkGroundPlane ()
 Additional Inherited Members
 Static Public Member Functions inherited from IRhRdkGroundPlane
static IRhRdkGroundPlane *  | New (void)
Member Function Documentation
◆ Altitude()
 virtual double CRhRdkGroundPlane::Altitude  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
The altitude of the ground plane.
Implements IRhRdkGroundPlane.
◆ AutoAltitude()
 virtual bool CRhRdkGroundPlane::AutoAltitude  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
true if auto-altitude is enabled.
Implements IRhRdkGroundPlane.
◆ BeginChange()
 virtual IRhRdkGroundPlane& CRhRdkGroundPlane::BeginChange  |  ( |  RhRdkChangeContext  |  cc | ) |   const
overridevirtual
Call this method to get a non-const object upon which you can call non-const methods. Calls to this method are counted; you must call EndChange() once for every call to BeginChange(). Please do not use const_cast or any other means of circumventing this requirement.
Implements IRhRdkGroundPlane.
◆ BeginNotifyBracket()
 virtual void CRhRdkGroundPlane::BeginNotifyBracket  |  ( |  void  |   | )
overridevirtual
Call this before calling multiple 'Set' methods.
Implements IRhRdkGroundPlane.
◆ CopyFrom()
 virtual void CRhRdkGroundPlane::CopyFrom  |  ( |  const IRhRdkGroundPlane &  |  gp | )
overridevirtual
Copy this ground plane from another one.
Implements IRhRdkGroundPlane.
◆ EndChange()
 virtual bool CRhRdkGroundPlane::EndChange  |  ( |  void  |   | )
overridevirtual
Implements IRhRdkGroundPlane.
◆ EndNotifyBracket()
 virtual void CRhRdkGroundPlane::EndNotifyBracket  |  ( |  void  |   | )
overridevirtual
Call this after calling multiple 'Set' methods.
Implements IRhRdkGroundPlane.
◆ EVF()
 virtual void* CRhRdkGroundPlane::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
inlineoverridevirtual
Emergency virtual function for future expansion.
Implements IRhRdkGroundPlane.
◆ IsEqual()
 virtual bool CRhRdkGroundPlane::IsEqual  |  ( |  const IRhRdkGroundPlane &  |  gp | ) |   const
overridevirtual
Returns
true if this ground plane is equal to another one.
Implements IRhRdkGroundPlane.
◆ Material()
 virtual const CRhRdkMaterial* CRhRdkGroundPlane::Material  |  ( |  void  |   | ) |   const
overridevirtual
Returns
A pointer to the ground plane's material or null if none.
Implements IRhRdkGroundPlane.
◆ MaterialInstanceId()
 virtual UUID CRhRdkGroundPlane::MaterialInstanceId  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
The instance id of the ground plane's material.
Implements IRhRdkGroundPlane.
◆ On()
 virtual bool CRhRdkGroundPlane::On  |  ( |  void  |   | ) |   const
inlinevirtual
Returns
true if the ground plane is enabled, else false.
Implements IRhRdkGroundPlane.
◆ operator!=()
 bool CRhRdkGroundPlane::operator!=  |  ( |  const CRhRdkGroundPlane &  |  gp | ) |   const
◆ operator=()
 const CRhRdkGroundPlane& CRhRdkGroundPlane::operator=  |  ( |  const CRhRdkGroundPlane &  |  gp | )
◆ operator==()
 bool CRhRdkGroundPlane::operator==  |  ( |  const CRhRdkGroundPlane &  |  gp | ) |   const
◆ SetAltitude()
 virtual void CRhRdkGroundPlane::SetAltitude  |  ( |  double  |   | )
inlineoverridevirtual
Set the ground plane's altitude.
Implements IRhRdkGroundPlane.
◆ SetAutoAltitude()
 virtual void CRhRdkGroundPlane::SetAutoAltitude  |  ( |  bool  |   | )
inlineoverridevirtual
Set if the ground plane is set to auto-altitude.
Implements IRhRdkGroundPlane.
◆ SetMaterialInstanceId()
 virtual void CRhRdkGroundPlane::SetMaterialInstanceId  |  ( |  const UUID &  |   | )
inlineoverridevirtual
Set the instance id of the ground plane's material.
Implements IRhRdkGroundPlane.
◆ SetOn()
 virtual void CRhRdkGroundPlane::SetOn  |  ( |  bool  |   | )
inlineoverridevirtual
Set the ground plane enabled state.
Implements IRhRdkGroundPlane.
◆ SetShadowOnly()
 virtual void CRhRdkGroundPlane::SetShadowOnly  |  ( |  bool  |   | )
inlineoverridevirtual
Set if the ground plane is set to shadow-only.
Implements IRhRdkGroundPlane.
◆ SetShowUnderside()
 virtual void CRhRdkGroundPlane::SetShowUnderside  |  ( |  bool  |   | )
inlineoverridevirtual
Set if the ground plane backface is enabled.
Implements IRhRdkGroundPlane.
◆ SetTextureOffset()
 virtual void CRhRdkGroundPlane::SetTextureOffset  |  ( |  const ON_2dVector &  |   | )
inlineoverridevirtual
Set the texture offset of the ground plane in model units.
Implements IRhRdkGroundPlane.
◆ SetTextureOffsetLocked()
 virtual void CRhRdkGroundPlane::SetTextureOffsetLocked  |  ( |  bool  |   | )
inlineoverridevirtual
Set if the texture offset x and y are locked together.
Implements IRhRdkGroundPlane.
◆ SetTextureRepeatLocked()
 virtual void CRhRdkGroundPlane::SetTextureRepeatLocked  |  ( |  bool  |   | )
inlineoverridevirtual
Set if the texture repeat x and y are locked together.
Implements IRhRdkGroundPlane.
◆ SetTextureRotation()
 virtual void CRhRdkGroundPlane::SetTextureRotation  |  ( |  double  |   | )
inlineoverridevirtual
Set the texture rotation of the ground plane in degrees.
Implements IRhRdkGroundPlane.
◆ SetTextureSize()
 virtual void CRhRdkGroundPlane::SetTextureSize  |  ( |  const ON_2dVector &  |   | )
inlineoverridevirtual
Set the texture size of the ground plane in model units.
Implements IRhRdkGroundPlane.
◆ ShadowOnly()
 virtual bool CRhRdkGroundPlane::ShadowOnly  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
true if the ground plane is set to shadow-only.
Implements IRhRdkGroundPlane.
◆ ShowUnderside()
 virtual bool CRhRdkGroundPlane::ShowUnderside  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
true if ground plane backface is enabled, else false.
Implements IRhRdkGroundPlane.
◆ TextureOffset()
 virtual ON_2dVector CRhRdkGroundPlane::TextureOffset  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
The texture offset of the ground plane in model units.
Implements IRhRdkGroundPlane.
◆ TextureOffsetLocked()
 virtual bool CRhRdkGroundPlane::TextureOffsetLocked  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
true if the texture offset x and y are locked together.
Implements IRhRdkGroundPlane.
◆ TextureRepeatLocked()
 virtual bool CRhRdkGroundPlane::TextureRepeatLocked  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
true if the texture repeat x and y are locked together.
Implements IRhRdkGroundPlane.
◆ TextureRotation()
 virtual double CRhRdkGroundPlane::TextureRotation  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
The texture rotation of the ground plane in degrees.
Implements IRhRdkGroundPlane.
◆ TextureSize()
 virtual ON_2dVector CRhRdkGroundPlane::TextureSize  |  ( |  void  |   | ) |   const
inlineoverridevirtual
Returns
The texture size of the ground plane in model units.
Implements IRhRdkGroundPlane.