Public Member Functions | List of all members
ON_SurfaceArray Class Reference
OpenNURBS
#include <opennurbs_surface.h>
 Inheritance diagram for ON_SurfaceArray:
 Public Member Functions
ON_SurfaceArray (int=0)
~ON_SurfaceArray ()
void  | Destroy ()
deletes surfaces in array and sets count to 0 More...
bool  | Duplicate (ON_SurfaceArray &) const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_SimpleArray< ON_Surface *>
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_Surface * > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_Surface * &)
void  | Append (int, const ON_Surface * *)
Append copy of an array T[count]. More...
ON_Surface * &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_Surface * *  | Array ()
The Array() function return the. More...
const ON_Surface * *  | Array () const
m_a pointer value. More...
ON_Surface * *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
ON_Surface * *  | At (unsigned int)
ON_Surface * *  | At (ON__INT64)
ON_Surface * *  | At (ON__UINT64)
const ON_Surface * *  | At (int) const
const ON_Surface * *  | At (unsigned int) const
const ON_Surface * *  | At (ON__INT64) const
const ON_Surface * *  | At (ON__UINT64) const
int  | BinarySearch (const ON_Surface * *, int(*)(const ON_Surface * *, const ON_Surface * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
int  | BinarySearch (const ON_Surface * *, int(*)(const ON_Surface * *, const ON_Surface * *), int) const
int  | Capacity () const
capacity of array More...
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_Surface * *  | First ()
const ON_Surface * *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*)(const ON_Surface * *, const ON_Surface * *))
void  | Insert (int, const ON_Surface * &)
ON_Surface * *  | KeepArray ()
ON_Surface * *  | Last ()
const ON_Surface * *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_Surface * * () const
operator ON_Surface ** ()
The cast operators return a pointer. More...
ON_SimpleArray< ON_Surface * > &  | operator= (const ON_SimpleArray< ON_Surface * > &)
ON_Surface * &  | operator[] (int)
ON_Surface * &  | operator[] (unsigned int)
ON_Surface * &  | operator[] (ON__INT64)
ON_Surface * &  | operator[] (ON__UINT64)
const ON_Surface * &  | operator[] (int) const
const ON_Surface * &  | operator[] (unsigned int) const
const ON_Surface * &  | operator[] (ON__INT64) const
const ON_Surface * &  | operator[] (ON__UINT64) const
bool  | Permute (const int *)
bool  | QuickSort (int(*)(const ON_Surface * *, const ON_Surface * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
virtual ON_Surface * *  | Realloc (ON_Surface * *, int)
low level memory managment ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
ON_Surface * *  | Reserve (size_t)
memory managment //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_Surface * &) const
int  | Search (const ON_Surface * *, int(*)(const ON_Surface * *, const ON_Surface * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDeccreasing<T> More...
void  | SetArray (ON_Surface * *)
void  | SetArray (ON_Surface * *, int, int)
ON_Surface * *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory managment ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_Surface * *, const ON_Surface * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*)(const ON_Surface * *, const ON_Surface * *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_Surface *>
void  | Move (int, int, int)
implimentation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_Surface *>
ON_Surface * *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_SurfaceArray()
 ON_SurfaceArray::ON_SurfaceArray  |  ( |  int  |   = 0 | )
◆ ~ON_SurfaceArray()
 ON_SurfaceArray::~ON_SurfaceArray  |  ( |   | )
Member Function Documentation
◆ Destroy()
 void ON_SurfaceArray::Destroy  |  ( |   | )
deletes surfaces in array and sets count to 0
◆ Duplicate()
 bool ON_SurfaceArray::Duplicate  |  ( |  ON_SurfaceArray &  |   | ) |   const
operator= copies the pointer values
◆ Read()
 bool ON_SurfaceArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_SurfaceArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const