Public Member Functions | List of all members
CRhRdkRenderWindowCustomDlg Class Referenceabstract
RDK
#include <RhRdkRenderWindowEventSink.h>
 Inheritance diagram for CRhRdkRenderWindowCustomDlg:
 Public Member Functions
virtual bool  | AlwaysShowDialog (void) const =0
virtual bool  | Create (HWND pParentWnd, const UUID &uuidRenderSession)=0
virtual void  | Destroy (const UUID &uuidRenderSession)=0
virtual const wchar_t *  | DockBarTitle (const UUID &uuidRenderSession) const =0
virtual UINT  | DockControlBarFlags (void) const =0
virtual UINT  | EnableDockingFlags (void) const =0
virtual bool  | InitialShowControlBar (void) const =0
virtual UUID  | InterfaceId (void) const final override
virtual void  | MoveWindow (const ON_4iRect &rect, const UUID &uuidRenderSession)=0
virtual HWND  | WindowHandle (const UUID &uuidRenderSession) const =0
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
virtual UUID  | PlugInId (void) const =0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
Detailed Description
This custom plug-in interface allows you to create a custom dialog to be hosted on a dock bar inside the render frame. Since it is possible to have more than one open render frame, it is possible for this interface to access more than one hosted dialog. This is made possible by use of the render session id which also identifies the dialog. Your implementation must ensure that it is possible to have multiple dialogs identified by this UUID.
Member Function Documentation
◆ AlwaysShowDialog()
 virtual bool CRhRdkRenderWindowCustomDlg::AlwaysShowDialog  |  ( |  void  |   | ) |   const
pure virtual
Implement this method to return true if you want this dialog to always appear on the render window even when the render window is for a different renderer. If you return false, the dialog and dock bar will only be created when the current renderer id matches the render engine id.
Note
It should be very rare to implement this as anything other than
return false;
.
◆ Create()
 virtual bool CRhRdkRenderWindowCustomDlg::Create  |  ( |  HWND  |  pParentWnd,
|  const UUID &  |  uuidRenderSession
)
pure virtual
Implement this method to construct and create your dialog.
Parameters
pParentWnd | is a pointer to the dialog's parent.
uuidRenderSession | is the id of the associated render session. You can get a pointer to the render window interface by calling RhRdkFindRenderWindow().
See also
RhRdkFindRenderWindow()
◆ Destroy()
 virtual void CRhRdkRenderWindowCustomDlg::Destroy  |  ( |  const UUID &  |  uuidRenderSession | )
pure virtual
Implement this method to destroy and delete your dialog.
Parameters
uuidRenderSession | is the render session id of the dialog to destroy.
◆ DockBarTitle()
 virtual const wchar_t* CRhRdkRenderWindowCustomDlg::DockBarTitle  |  ( |  const UUID &  |  uuidRenderSession | ) |   const
pure virtual
Implement this method to return the title that will appear on the host dock bar when it is floating.
Parameters
uuidRenderSession | is the render session id of the dock bar.
◆ DockControlBarFlags()
 virtual UINT CRhRdkRenderWindowCustomDlg::DockControlBarFlags  |  ( |  void  |   | ) |   const
pure virtual
Implement this method to return the flags to be passed to CFrameWnd::DockControlBar() (e.g., AFX_IDW_DOCKBAR_LEFT)
◆ EnableDockingFlags()
 virtual UINT CRhRdkRenderWindowCustomDlg::EnableDockingFlags  |  ( |  void  |   | ) |   const
pure virtual
Implement this method to return the flags to be passed to CControlBar::EnableDocking() (e.g., CBRS_ALIGN_ANY)
◆ InitialShowControlBar()
 virtual bool CRhRdkRenderWindowCustomDlg::InitialShowControlBar  |  ( |  void  |   | ) |   const
pure virtual
Implement this method to return the initial visibility of the dock bar.
◆ InterfaceId()
 virtual UUID CRhRdkRenderWindowCustomDlg::InterfaceId  |  ( |  void  |   | ) |   const
finaloverridevirtual
Returns the unique interface id of this extension.
Implements CRhRdkExtension.
◆ MoveWindow()
 virtual void CRhRdkRenderWindowCustomDlg::MoveWindow  |  ( |  const ON_4iRect &  |  rect,
|  const UUID &  |  uuidRenderSession
)
pure virtual
Implement this method to move your dialog to the position specified by 'rect'.
Parameters
rect | specifies the position to move the dialog to.
uuidRenderSession | is the render session id of the dialog to move.
◆ WindowHandle()
 virtual HWND CRhRdkRenderWindowCustomDlg::WindowHandle  |  ( |  const UUID &  |  uuidRenderSession | ) |   const
pure virtual
Implement this method to return the window handle of your dialog.
Parameters
uuidRenderSession | is the render session id of the dialog to return.