Public Member Functions | Public Attributes | List of all members
CRhinoCommandAlias Class Reference
Rhino
 More...
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoCommandAlias ()
CRhinoCommandAlias (const wchar_t *alias, const wchar_t *macro)
 Public Attributes
ON_wString  | m_alias
ON_wString  | m_macro
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoCommandAlias() [1/2]
 CRhinoCommandAlias::CRhinoCommandAlias  |  ( |   | )
◆ CRhinoCommandAlias() [2/2]
 CRhinoCommandAlias::CRhinoCommandAlias  |  ( |  const wchar_t *  |  alias,
|  const wchar_t *  |  macro
)
Member Data Documentation
◆ m_alias
 ON_wString CRhinoCommandAlias::m_alias
17 Jan 2006 S.Baer Default C++ copy constructor, operator=, and destructor work fine
◆ m_macro
 ON_wString CRhinoCommandAlias::m_macro