Public Member Functions | Protected Member Functions | Friends | List of all members
CRhRdkSectionBase_MFC Class Referenceabstract
RDK
#include <RhRdkSections_MFC.h>
 Inheritance diagram for CRhRdkSectionBase_MFC:
 Public Member Functions
CRhRdkSectionBase_MFC (unsigned int idd, CWnd *pParent=nullptr)
void *  | GetData (const UUID &uuidData, bool bForWrite) const
bool  | IsBlocking (void) const
 Public Member Functions inherited from CRhRdkResizingDialog
CRhRdkResizingDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
CRhRdkResizingDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhRdkResizingDialog ()
virtual BOOL  | AddControlString (HWND hwnd, const TCHAR *szText)
virtual void  | DisplayData (void)
virtual void  | EnableDisableControls (void)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual BOOL  | IsControlClipped (CWnd *pWnd)
virtual void  | OnPreInitResizing (void)
virtual void  | SetAutoSubclassGroupBoxes (BOOL bSubclass)
virtual void  | SetFillBackground (BOOL bFill)
virtual void  | SetReleaseClipping (BOOL bRelease)
virtual void  | SetResizingConstraints (BOOL bAllowResizeWidth, BOOL bAllowResizeHeight)
 Public Member Functions inherited from CRhinoDialog
CRhinoDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr)
Modal construct. More...
CRhinoDialog (UINT nIDTemplate, CWnd *pParentWnd=nullptr)
virtual  | ~CRhinoDialog ()
CSize  | CalcDialogSize (INT nResourceId)
BOOL  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr) override
Modeless construct. More...
BOOL  | Create (UINT nIDTemplate, CWnd *pParentWnd=nullptr) override
UINT  | DialogID ()
LPCTSTR  | DialogStringID ()
unsigned int  | DocumentSerialNumber () const
virtual INT_PTR  | DoModal ()
bool  | EnableDisplayCommands () const
void  | EnableSaveDialogPositionAndSize (bool bEnable=true, const wchar_t *wRegistryTitle=nullptr)
bool  | IsSaveDialogPositionAndSizeEnabled () const
void  | Localize ()
virtual void  | OnColorButtonClicked (UINT nBtnID)
Called by CRhColorButton if button clicked and color changed;. More...
void  | OnRhinoHelpButton ()
Dialog Utilities. More...
BOOL  | PreTranslateMessage (MSG *pMsg) override
Overrides. More...
bool  | PushPickButton (bool hide_this_dialog)
void  | SetEnableDisplayCommands (bool b, unsigned int documentRuntimeSerialNumber)
void  | SetEnableDisplayCommands (bool b)
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
virtual BOOL  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Protected Member Functions
virtual  | ~CRhRdkSectionBase_MFC ()
virtual UUID  | _InternalUuid (void) const =0
virtual COLORREF  | BackgroundColor (void) const
virtual void  | DeferWindowPositionAndSize (HDWP &hdwp, CWnd &destWnd, CWnd &srceWnd) const
virtual int  | GetDefaultHeight (void) const
virtual unsigned int  | GetIDD (void) const =0
virtual AFX_MODULE_STATE *  | GetModuleState (void) const =0
virtual const IRhinoUiSection &  | Interface (void) const =0
virtual IRhinoUiSection &  | Interface (void)=0
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnEnable (BOOL bEnable)
afx_msg BOOL  | OnEraseBkgnd (CDC *pDC)
virtual BOOL  | OnInitDialog () override
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnRhinoOptionsSearchShowControlParent (WPARAM, LPARAM)
afx_msg void  | OnTimer (UINT_PTR nTimerId)
virtual BOOL  | PreCreateWindow (CREATESTRUCT &cs) override
virtual void  | Refresh (void)
virtual void  | SetBackgroundColor (COLORREF cr)
virtual void  | SetControlPositionAndSize (void)
virtual void  | SetWindowPositionAndSize (CWnd &destWnd, CWnd &srceWnd) const
 Protected Member Functions inherited from CRhRdkResizingDialog
virtual void  | HideControl (UINT id, int width)
virtual void  | InitControl (UINT id, int l, int t, int r, int b, int o, int iPos)
afx_msg void  | OnDestroy (void)
afx_msg LRESULT  | OnNcHitTest (CPoint)
afx_msg void  | OnSize (UINT, int, int)
afx_msg void  | OnSysCommand (UINT, LPARAM)
afx_msg BOOL  | OnToolTipNotify (UINT, NMHDR *, LRESULT *)
virtual void  | RepositionControls (BOOL bInit)
virtual void  | SizeControl (UINT id, int l, int t, int r, int b, int o, int iPos)
virtual void  | SubclassGroupBoxes ()
virtual void  | UnsubclassGroupBoxes ()
 Protected Member Functions inherited from CRhinoDialog
virtual BOOL  | ContinueModal ()
Implementation. More...
void  | DoDataExchange (CDataExchange *pDX) override
DDX/DDV support. More...
virtual void  | OnCancel ()
virtual BOOL  | OnCommand (WPARAM wParam, LPARAM lParam)
override; ///<not an override on OSX More...
afx_msg void  | OnDestroy ()
afx_msg BOOL  | OnHelpInfo (HELPINFO *pHelpInfo)
virtual void  | OnOK ()
LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam) override
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
BOOL  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
 Friends
class  | CRhRdkContentUISection_MFC
class  | CRhRdkRenderSettingsSection_MFC
class  | CRhRdkSection_MFC
class  | CRhRdkSunSection_MFC
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Static Public Member Functions inherited from CRhinoDialog
static int  | CheckSemiModalMessagePump ()
static bool  | InDoSemiModal ()
 Public Attributes inherited from CRhinoDialog
class CRhDialogSdkExtension *  | m__rhino_dialog_sdk_extension
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
Detailed Description
This class represents one XP-style section within a holder. This class is typically used in non-content UIs, but can also be used for content UIs if you don't want to use content UI sharing.
See also
IRhinoUiSection
Constructor & Destructor Documentation
◆ CRhRdkSectionBase_MFC()
 CRhRdkSectionBase_MFC::CRhRdkSectionBase_MFC  |  ( |  unsigned int  |  idd,
|  CWnd *  |  pParent = nullptr
)
◆ ~CRhRdkSectionBase_MFC()
 virtual CRhRdkSectionBase_MFC::~CRhRdkSectionBase_MFC  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ _InternalUuid()
 virtual UUID CRhRdkSectionBase_MFC::_InternalUuid  |  ( |  void  |   | ) |   const
protectedpure virtual
◆ BackgroundColor()
 virtual COLORREF CRhRdkSectionBase_MFC::BackgroundColor  |  ( |  void  |   | ) |   const
protectedvirtual
◆ DeferWindowPositionAndSize()
 virtual void CRhRdkSectionBase_MFC::DeferWindowPositionAndSize  |  ( |  HDWP &  |  hdwp,
|  CWnd &  |  destWnd,
|  CWnd &  |  srceWnd
) |   |  const
protectedvirtual
◆ GetData()
 void* CRhRdkSectionBase_MFC::GetData  |  ( |  const UUID &  |  uuidData,
|  bool  |  bForWrite
) |   |  const
◆ GetDefaultHeight()
 virtual int CRhRdkSectionBase_MFC::GetDefaultHeight  |  ( |  void  |   | ) |   const
protectedvirtual
◆ GetIDD()
 virtual unsigned int CRhRdkSectionBase_MFC::GetIDD  |  ( |  void  |   | ) |   const
protectedpure virtual
Implement this method to return the dialog id (i.e., the 'IDD') of the section's dialog resource.
◆ GetModuleState()
 virtual AFX_MODULE_STATE* CRhRdkSectionBase_MFC::GetModuleState  |  ( |  void  |   | ) |   const
protectedpure virtual
Implement this method to return the module state for the section. Your override will typically return AfxGetStaticModuleState();
◆ Interface() [1/2]
 virtual const IRhinoUiSection& CRhRdkSectionBase_MFC::Interface  |  ( |  void  |   | ) |   const
protectedpure virtual
Implemented in CRhRdkSunSection_MFC, CRhRdkRenderSettingsSection_MFC, CRhRdkContentUISection_MFC, and CRhRdkSection_MFC.
◆ Interface() [2/2]
 virtual IRhinoUiSection& CRhRdkSectionBase_MFC::Interface  |  ( |  void  |   | )
protectedpure virtual
Implemented in CRhRdkSunSection_MFC, CRhRdkRenderSettingsSection_MFC, CRhRdkContentUISection_MFC, and CRhRdkSection_MFC.
◆ IsBlocking()
 bool CRhRdkSectionBase_MFC::IsBlocking  |  ( |  void  |   | ) |   const
◆ OnCreate()
 afx_msg int CRhRdkSectionBase_MFC::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
protected
◆ OnCtlColor()
 afx_msg HBRUSH CRhRdkSectionBase_MFC::OnCtlColor  |  ( |  CDC *  |  pDC,
|  CWnd *  |  pWnd,
|  UINT  |  nCtlColor
)
protected
◆ OnDestroy()
 afx_msg void CRhRdkSectionBase_MFC::OnDestroy  |  ( |   | )
protected
◆ OnEnable()
 afx_msg void CRhRdkSectionBase_MFC::OnEnable  |  ( |  BOOL  |  bEnable | )
protected
◆ OnEraseBkgnd()
 afx_msg BOOL CRhRdkSectionBase_MFC::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
protectedvirtual
Reimplemented from CRhRdkResizingDialog.
◆ OnInitDialog()
 virtual BOOL CRhRdkSectionBase_MFC::OnInitDialog  |  ( |   | )
overrideprotectedvirtual
Generated message map functions {{AFX_MSG(CRhinoDialog)
Reimplemented from CRhRdkResizingDialog.
◆ OnLButtonDown()
 afx_msg void CRhRdkSectionBase_MFC::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
protected
◆ OnRhinoOptionsSearchShowControlParent()
 afx_msg LRESULT CRhRdkSectionBase_MFC::OnRhinoOptionsSearchShowControlParent  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnTimer()
 afx_msg void CRhRdkSectionBase_MFC::OnTimer  |  ( |  UINT_PTR  |  nTimerId | )
protected
◆ PreCreateWindow()
 virtual BOOL CRhRdkSectionBase_MFC::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
overrideprotectedvirtual
◆ Refresh()
 virtual void CRhRdkSectionBase_MFC::Refresh  |  ( |  void  |   | )
protectedvirtual
Refresh the section. The default implementation calls DisplayData() followed by EnableDisableControls().
◆ SetBackgroundColor()
 virtual void CRhRdkSectionBase_MFC::SetBackgroundColor  |  ( |  COLORREF  |  cr | )
protectedvirtual
◆ SetControlPositionAndSize()
 virtual void CRhRdkSectionBase_MFC::SetControlPositionAndSize  |  ( |  void  |   | )
protectedvirtual
◆ SetWindowPositionAndSize()
 virtual void CRhRdkSectionBase_MFC::SetWindowPositionAndSize  |  ( |  CWnd &  |  destWnd,
|  CWnd &  |  srceWnd
) |   |  const
protectedvirtual
Friends And Related Function Documentation
◆ CRhRdkContentUISection_MFC
 friend class CRhRdkContentUISection_MFC
friend
◆ CRhRdkRenderSettingsSection_MFC
 friend class CRhRdkRenderSettingsSection_MFC
friend
◆ CRhRdkSection_MFC
 friend class CRhRdkSection_MFC
friend
◆ CRhRdkSunSection_MFC
 friend class CRhRdkSunSection_MFC
friend