Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoUiPaintColorSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoUiPaintColorSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoUiPaintColorSettings &) const
bool  | operator== (const CRhinoUiPaintColorSettings &) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
clamp settings to valid values More...
 Static Public Member Functions
static const wchar_t *  | ProfileKey ()
 Public Attributes
ON_Color  | m_active_caption
ON_Color  | m_active_viewport_title
ON_Color  | m_hot_border
ON_Color  | m_hot_end
ON_Color  | m_hot_start
ON_Color  | m_inactive_caption
ON_Color  | m_inactive_viewport_title
ON_Color  | m_mouse_overcontrol_border
ON_Color  | m_mouse_overcontrol_end
ON_Color  | m_mouse_overcontrol_start
ON_Color  | m_normal_border
ON_Color  | m_normal_end
ON_Color  | m_normal_start
ON_Color  | m_pressed_border
ON_Color  | m_pressed_end
ON_Color  | m_pressed_start
ON_Color  | m_tab_background
ON_Color  | m_text_disabled
ON_Color  | m_text_enabled
 Static Public Attributes
static const CRhinoUiPaintColorSettings  | Default
Detailed Description
Colors for the general windows user interface elements
Constructor & Destructor Documentation
◆ CRhinoUiPaintColorSettings()
 CRhinoUiPaintColorSettings::CRhinoUiPaintColorSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoUiPaintColorSettings::Defaults  |  ( |   | )
Description: Set members to defaults.
◆ LoadProfile()
 void CRhinoUiPaintColorSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoUiPaintColorSettings::operator!=  |  ( |  const CRhinoUiPaintColorSettings &  |   | ) |   const
◆ operator==()
 bool CRhinoUiPaintColorSettings::operator==  |  ( |  const CRhinoUiPaintColorSettings &  |   | ) |   const
◆ ProfileKey()
 static const wchar_t* CRhinoUiPaintColorSettings::ProfileKey  |  ( |   | )
static
◆ SaveProfile()
 void CRhinoUiPaintColorSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoUiPaintColorSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoUiPaintColorSettings CRhinoUiPaintColorSettings::Default
static
◆ m_active_caption
 ON_Color CRhinoUiPaintColorSettings::m_active_caption
◆ m_active_viewport_title
 ON_Color CRhinoUiPaintColorSettings::m_active_viewport_title
◆ m_hot_border
 ON_Color CRhinoUiPaintColorSettings::m_hot_border
◆ m_hot_end
 ON_Color CRhinoUiPaintColorSettings::m_hot_end
◆ m_hot_start
 ON_Color CRhinoUiPaintColorSettings::m_hot_start
◆ m_inactive_caption
 ON_Color CRhinoUiPaintColorSettings::m_inactive_caption
◆ m_inactive_viewport_title
 ON_Color CRhinoUiPaintColorSettings::m_inactive_viewport_title
◆ m_mouse_overcontrol_border
 ON_Color CRhinoUiPaintColorSettings::m_mouse_overcontrol_border
◆ m_mouse_overcontrol_end
 ON_Color CRhinoUiPaintColorSettings::m_mouse_overcontrol_end
◆ m_mouse_overcontrol_start
 ON_Color CRhinoUiPaintColorSettings::m_mouse_overcontrol_start
◆ m_normal_border
 ON_Color CRhinoUiPaintColorSettings::m_normal_border
◆ m_normal_end
 ON_Color CRhinoUiPaintColorSettings::m_normal_end
◆ m_normal_start
 ON_Color CRhinoUiPaintColorSettings::m_normal_start
◆ m_pressed_border
 ON_Color CRhinoUiPaintColorSettings::m_pressed_border
◆ m_pressed_end
 ON_Color CRhinoUiPaintColorSettings::m_pressed_end
◆ m_pressed_start
 ON_Color CRhinoUiPaintColorSettings::m_pressed_start
◆ m_tab_background
 ON_Color CRhinoUiPaintColorSettings::m_tab_background
◆ m_text_disabled
 ON_Color CRhinoUiPaintColorSettings::m_text_disabled
◆ m_text_enabled
 ON_Color CRhinoUiPaintColorSettings::m_text_enabled