Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_Linetype Class Reference
OpenNURBS
class ON_Linetype More...
#include <opennurbs_linetype.h>
 Inheritance diagram for ON_Linetype:
 Public Member Functions
ON_Linetype () ON_NOEXCEPT
ON_Linetype (const ON_Linetype &)
~ON_Linetype ()=default
int  | AppendSegment (const ON_LinetypeSegment &segment)
bool  | ClearPattern ()
void  | Dump (ON_TextLog &) const override
for debugging More...
ON_SimpleArray< ON_LinetypeSegment > *  | ExpertSegments ()
Returns nullptr if the line pattern is locked. More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
void  | LockPattern ()
ON_Linetype &  | operator= (const ON_Linetype &)=default
bool  | PatternIsLocked () const
bool  | PatternIsSet () const
double  | PatternLength () const
bool  | Read (ON_BinaryArchive &) override
bool  | RemoveSegment (int index)
ON_LinetypeSegment  | Segment (int index) const
int  | SegmentCount () const
const ON_SimpleArray< ON_LinetypeSegment > &  | Segments () const
bool  | SetSegment (int index, const ON_LinetypeSegment &segment)
bool  | SetSegment (int index, double length, ON_LinetypeSegment::eSegType type)
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
void  | Dump (ON_TextLog &) const override
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
bool  | SetId (const ON_UUID &component_id)
const ON_UUID &  | SetId ()
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
void  | CopyUserData (const ON_Object &source_object)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
void  | MoveUserData (ON_Object &source_object)
virtual ON::object_type  | ObjectType () const
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static const ON_Linetype *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_Linetype *none_return_value)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Static Public Attributes
static const ON_Linetype  | ByLayer
index = -2, id, name and pattern are set. More...
static const ON_Linetype  | ByParent
index = -3, id, name and pattern are set. More...
static const ON_Linetype  | Continuous
index = -1, id, name and pattern are set. More...
static const ON_Linetype  | Unset
no attributes are set. More...
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Additional Inherited Members
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::RenderMaterial = 3,
 Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6, Type::TextStyle = 7,
 Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10, Type::InstanceDefinition = 11,
 Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Detailed Description
class ON_Linetype
Constructor & Destructor Documentation
◆ ON_Linetype() [1/2]
 ON_Linetype::ON_Linetype  |  ( |   | )
◆ ~ON_Linetype()
 ON_Linetype::~ON_Linetype  |  ( |   | )
default
◆ ON_Linetype() [2/2]
 ON_Linetype::ON_Linetype  |  ( |  const ON_Linetype &  |   | )
Member Function Documentation
◆ AppendSegment()
 int ON_Linetype::AppendSegment  |  ( |  const ON_LinetypeSegment &  |  segment | )
Description: Adds a segment to the pattern Returns: Index of the added segment.
◆ ClearPattern()
 bool ON_Linetype::ClearPattern  |  ( |   | )
◆ Dump()
 void ON_Linetype::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
for debugging
Reimplemented from ON_Object.
◆ ExpertSegments()
 ON_SimpleArray<ON_LinetypeSegment>* ON_Linetype::ExpertSegments  |  ( |   | )
Returns nullptr if the line pattern is locked.
Description: Expert user function to get access to the segment array for rapid calculations.
◆ FromModelComponentRef()
 static const ON_Linetype* ON_Linetype::FromModelComponentRef  |  ( |  const class ON_ModelComponentReference &  |  model_component_reference,
|  const ON_Linetype *  |  none_return_value
)
static
Parameters: model_component_reference - [in] none_return_value - [in] value to return if ON_Linetype::Cast(model_component_ref.ModelComponent()) is nullptr Returns: If ON_Linetype::Cast(model_component_ref.ModelComponent()) is not nullptr, that pointer is returned. Otherwise, none_return_value is returned.
◆ IsValid()
 bool ON_Linetype::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests that name is set and there is at least one non-zero length segment
Reimplemented from ON_Object.
◆ LockPattern()
 void ON_Linetype::LockPattern  |  ( |   | )
◆ operator=()
 ON_Linetype& ON_Linetype::operator=  |  ( |  const ON_Linetype &  |   | )
default
◆ PatternIsLocked()
 bool ON_Linetype::PatternIsLocked  |  ( |   | ) |   const
◆ PatternIsSet()
 bool ON_Linetype::PatternIsSet  |  ( |   | ) |   const
Interface
◆ PatternLength()
 double ON_Linetype::PatternLength  |  ( |   | ) |   const
Description: Returns the total length of one repeat of the pattern
◆ Read()
 bool ON_Linetype::Read  |  ( |  ON_BinaryArchive &  |   | )
overridevirtual
Description: Read from file
Reimplemented from ON_Object.
◆ RemoveSegment()
 bool ON_Linetype::RemoveSegment  |  ( |  int  |  index | )
Description: Removes a segment in the linetype. Parameters: index - [in] Zero based index of the segment to remove. Returns: True if the segment index was removed.
◆ Segment()
 ON_LinetypeSegment ON_Linetype::Segment  |  ( |  int  |  index | ) |   const
Description: Returns a copy of the segment at index
◆ SegmentCount()
 int ON_Linetype::SegmentCount  |  ( |   | ) |   const
Description: Returns the number of segments in the pattern
◆ Segments()
 const ON_SimpleArray<ON_LinetypeSegment>& ON_Linetype::Segments  |  ( |   | ) |   const
◆ SetSegment() [1/2]
 bool ON_Linetype::SetSegment  |  ( |  int  |  index,
|  const ON_LinetypeSegment &  |  segment
)
Description: Sets the segment at index to match segment
◆ SetSegment() [2/2]
 bool ON_Linetype::SetSegment  |  ( |  int  |  index,
|  double  |  length,
|  ON_LinetypeSegment::eSegType  |  type
)
Description: Sets the length and type of the segment at index
◆ Write()
 bool ON_Linetype::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
overridevirtual
Description: Write to file
Reimplemented from ON_Object.
Member Data Documentation
◆ ByLayer
 const ON_Linetype ON_Linetype::ByLayer
static
index = -2, id, name and pattern are set.
◆ ByParent
 const ON_Linetype ON_Linetype::ByParent
static
index = -3, id, name and pattern are set.
◆ Continuous
 const ON_Linetype ON_Linetype::Continuous
static
index = -1, id, name and pattern are set.
◆ Unset
 const ON_Linetype ON_Linetype::Unset
static
no attributes are set.