Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dmIOSettings Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmIOSettings ()=default
ON_3dmIOSettings (const ON_3dmIOSettings &)=default
~ON_3dmIOSettings ()=default
ON_3dmIOSettings &  | operator= (const ON_3dmIOSettings &)=default
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bSaveTextureBitmapsInFile = false
bitmaps associated with rendering materials More...
int  | m_idef_link_update = 1
 Static Public Attributes
static const ON_3dmIOSettings  | Default
Constructor & Destructor Documentation
◆ ON_3dmIOSettings() [1/2]
 ON_3dmIOSettings::ON_3dmIOSettings  |  ( |   | )
default
◆ ~ON_3dmIOSettings()
 ON_3dmIOSettings::~ON_3dmIOSettings  |  ( |   | )
default
◆ ON_3dmIOSettings() [2/2]
 ON_3dmIOSettings::ON_3dmIOSettings  |  ( |  const ON_3dmIOSettings &  |   | )
default
Member Function Documentation
◆ operator=()
 ON_3dmIOSettings& ON_3dmIOSettings::operator=  |  ( |  const ON_3dmIOSettings &  |   | )
default
◆ Read()
 bool ON_3dmIOSettings::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmIOSettings::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ Default
 const ON_3dmIOSettings ON_3dmIOSettings::Default
static
◆ m_bSaveTextureBitmapsInFile
 bool ON_3dmIOSettings::m_bSaveTextureBitmapsInFile = false
bitmaps associated with rendering materials
◆ m_idef_link_update
 int ON_3dmIOSettings::m_idef_link_update = 1
As of 7 February 2012, the m_idef_link_update setting controls if, when and how linked and linked_and_embedded instance defintions are updated when the source archive that was used to create the idef has changed.