Public Member Functions | Public Attributes | List of all members
CRhinoDib::Pixel Class Reference
#include <RhinoSdkUiDibMac.h>
 Public Member Functions
Pixel (BITMAPINFO &in_bmi, LPBYTE in_bits, int in_cd, long in_x, long in_y, unsigned char in_r, unsigned char in_g, unsigned char in_b, int in_alpha)
void  | Set (unsigned char in_r, unsigned char in_g, unsigned char in_b, int in_alpha)
 Public Attributes
int  | alpha
unsigned char  | b
BITMAPINFO &  | bmi
int  | color_depth
LPBYTE  | dib_bits
unsigned char  | g
unsigned char  | r
long  | x
long  | y
Constructor & Destructor Documentation
◆ Pixel()
 CRhinoDib::Pixel::Pixel  |  ( |  BITMAPINFO &  |  in_bmi,
|  LPBYTE  |  in_bits,
|  int  |  in_cd,
|  long  |  in_x,
|  long  |  in_y,
|  unsigned char  |  in_r,
|  unsigned char  |  in_g,
|  unsigned char  |  in_b,
|  int  |  in_alpha
)
inline
Member Function Documentation
◆ Set()
 void CRhinoDib::Pixel::Set  |  ( |  unsigned char  |  in_r,
|  unsigned char  |  in_g,
|  unsigned char  |  in_b,
|  int  |  in_alpha
)
inline
Member Data Documentation
◆ alpha
 int CRhinoDib::Pixel::alpha
◆ b
 unsigned char CRhinoDib::Pixel::b
◆ bmi
 BITMAPINFO& CRhinoDib::Pixel::bmi
◆ color_depth
 int CRhinoDib::Pixel::color_depth
◆ dib_bits
 LPBYTE CRhinoDib::Pixel::dib_bits
◆ g
 unsigned char CRhinoDib::Pixel::g
◆ r
 unsigned char CRhinoDib::Pixel::r
◆ x
 long CRhinoDib::Pixel::x
◆ y
 long CRhinoDib::Pixel::y