Namespaces | Classes | Macros | Typedefs | Functions
RhinoUI
 Namespaces
RhinoTabbedDockBar
 Classes
class  | CGetRhinoProfileContextIterator
class  | CRhinoAppUiDockBarManager
class  | CRhinoAppUiManager
class  | CRhinoAppUiResourceManager
class  | CRhinoDib
class  | CRhinoIniProfileContext
class  | CRhinoIniProfileContextIterator
class  | CRhinoProfileContext
class  | CRhinoProfileContextIterator
class  | CRhinoRegProfileContext
class  | CRhinoRegProfileContextIterator
class  | CRhinoStringDictionary
class  | CRhinoUiAutocompleteEdit
class  | CRhinoUiBitmapButton
CRhinoUiBitmapButton. More...
class  | CRhinoUiBlockPreview
class  | CRhinoUiButton
CRhinoUiButton. More...
class  | CRhinoUiCheckBox
CRhinoUiCheckBox. More...
class  | CRhinoUiColorButton
class  | CRhinoUiColorComboBox
CRhinoUiColorComboBox. More...
class  | CRhinoUiColorComboBoxItem
CRhinoUiColorComboBoxItem. More...
class  | CRhinoUiColorListBox
CRhinoUiColorListBox. More...
class  | CRhinoUiComboBox
class  | CRhinoUiComboBoxItemData
class  | CRhinoUiDialog
CRhinoUiDialog dialog. More...
class  | CRhinoUiDialogItemResizer
class  | CRhinoUiDialogSub
CRhinoUiDialogSub. More...
class  | CRhinoUiDirDialog
CRhinoUiDirDialog dialog. More...
class  | CRhinoUiDockBar
class  | CRhinoUiDockBarCaptionButton
class  | CRhinoUiDockBarClientExpandableTabCtrl
class  | CRhinoUiDockBarClientExpandableTabPage
CRhinoUiDockBarClientExpandableTabPage. More...
class  | CRhinoUiDockBarClientWnd
CRhinoUiDockBarClientWnd. More...
class  | CRhinoUiDockBarDialog
CRhinoUiDockBarDialog dialog. More...
class  | CRhinoUiDockBarExpandableTabCtrl
CRhinoUiDockBarExpandableTabCtrl. More...
class  | CRhinoUiDockBarManager
class  | CRhinoUiDragBitmapWnd
CRhinoUiDragBitmapWnd. More...
class  | CRhinoUiEdit
class  | CRhinoUiEditInt
CRhinoUiEditInt. More...
class  | CRhinoUiEditReal
CRhinoUiEditReal. More...
class  | CRhinoUiExpandableTabbedDockBar
CRhinoUiExpandableTabbedDockBar. More...
class  | CRhinoUiExpandableTabCtrl
class  | CRhinoUiExpandableTabCtrl_New
class  | CRhinoUiExpandableTabCtrlItem
class  | CRhinoUiExpandableTabCtrlItem_New
class  | CRhinoUiExpandableTabPage
CRhinoUiExpandableTabPage. More...
class  | CRhinoUiExpandableTabPage_New
class  | CRhinoUiFile
class  | CRhinoUiGradientSliderCtrl
CRhinoUiGradientSliderCtrl. More...
class  | CRhinoUiGridListCombo
class  | CRhinoUiGridListCtrl
CRhinoUiGridListCtrl. More...
class  | CRhinoUiGridListEdit
CRhinoUiGridListEdit. More...
class  | CRhinoUiGridListHeaderCtrl
CRhinoUiGridListHeaderCtrl. More...
class  | CRhinoUiHyperlink
CRhinoUiHyperlink. More...
class  | CRhinoUiImageList
class  | CRhinoUiInPlaceButton
class  | CRhinoUiInPlaceEdit
class  | CRhinoUiLayerComboBox
CRhinoUiLayerComboBox. More...
class  | CRhinoUiLayerListCtrl
CRhinoUiLayerListCtrl. More...
class  | CRhinoUiLayerListCtrlItem
CRhinoUiLayerListCtrlItem. More...
class  | CRhinoUiLinetypeListCtrl
CRhinoUiLinetypeListCtrl. More...
class  | CRhinoUiLinetypeListCtrlInfo
CRhinoUiLinetypeListCtrlInfo. More...
class  | CRhinoUiListBoxEx
class  | CRhinoUiListBoxExBuddy
class  | CRhinoUiLocalizeDialog
class  | CRhinoUiManager
class  | CRhinoUiMemDC
class  | CRhinoUiMessagePump
class  | CRhinoUiModelessDockingDialog
class  | CRhinoUiModlessDockingDialogManager
class  | CRhinoUiModlessDockingDialogRecord
class  | CRhinoUiMultiMonitor
class  | CRhinoUiOptionsListCtrl
class  | CRhinoUiOptionsListCtrlCheckBox
class  | CRhinoUiOptionsListCtrlColorButton
class  | CRhinoUiOptionsListCtrlColorComboBox
class  | CRhinoUiOptionsListCtrlComboBox
class  | CRhinoUiOptionsListCtrlEditBox
class  | CRhinoUiOptionsListCtrlFileNameEditBox
class  | CRhinoUiOptionsListCtrlFontComboBox
class  | CRhinoUiOptionsListCtrlGroupComboBox
class  | CRhinoUiOptionsListCtrlIPAddress
class  | CRhinoUiOptionsListCtrlItem
class  | CRhinoUiOptionsListCtrlLayerComboBox
class  | CRhinoUiOptionsListCtrlLinetypeComboBox
class  | CRhinoUiOptionsListCtrlPointEditBox
class  | CRhinoUiOptionsListCtrlPrintWidthComboBox
class  | CRhinoUiOptionsListCtrlPushButton
class  | CRhinoUiOptionsListCtrlRadioButtonColumn
class  | CRhinoUiOptionsListCtrlRadioButtonColumnBtn
class  | CRhinoUiOptionsListCtrlSeparator
class  | CRhinoUiOptionsListCtrlStaticText
class  | CRhinoUiPageDockBar
class  | CRhinoUiPageDockBarManager
class  | CRhinoUiPaintManager
class  | CRhinoUiPointEdit
CRhinoUiPointEdit. More...
class  | CRhinoUiPopDownLayerListCtrl
CRhinoUiPopDownLayerListCtrl. More...
class  | CRhinoUiPopDownLayerWnd
CRhinoUiPopDownLayerWnd. More...
class  | CRhinoUiPopUpListWnd
class  | CRhinoUiPopupMenu
class  | CRhinoUiPopuUpListBox
CRhinoUiPopuUpListBox. More...
class  | CRhinoUiPrintWidthListCtrl
CRhinoUiPrintWidthListCtrl. More...
class  | CRhinoUiProgressBar
CRhinoUiProgressBar. More...
class  | CRhinoUiProgressCtrl
CRhinoUiProgressCtrl. More...
class  | CRhinoUiRegisterPreTranslateMessage
class  | CRhinoUiRegistry
class  | CRhinoUiRegistryEnumValue
class  | CRhinoUiResourceManager
class  | CRhinoUiRichEditCtrl
CRhinoUiRichEditCtrl. More...
class  | CRhinoUiRichTextEditCtrl
class  | CRhinoUiSeparator
CRhinoUiSeparator. More...
class  | CRhinoUiSliderCtrl
class  | CRhinoUiStatic
CRhinoUiStatic. More...
class  | CRhinoUiTabbedSheetCtrl
class  | CRhinoUiTabbedSheetCtrlGDI
class  | CRhinoUiTabbedSheetCtrlItem
class  | CRhinoUiTabbedSheetCtrlMsg
class  | CRhinoUiTabCtrl
CRhinoUiTabCtrl. More...
class  | CRhinoUiTabCtrlPage
CRhinoUiTabCtrlPage dialog. More...
class  | CRhinoUiTabPageCtrl
CRhinoUiTabPageCtrl. More...
class  | CRhinoUiToolTip
CRhinoUiToolTip. More...
class  | CRhinoUiUnitSystemComboBox
class  | CRuiOnUpdateMenuItem
class  | CRuiOnUpdateMenuItems
class  | CRuiUpdateUi
struct  | RhinoUiColorComboBoxItemData
struct  | RhinoUiFontComboBoxItemData
struct  | RhinoUiLayerComboBoxItemData
struct  | RhinoUiLinetypeComboBoxItemData
struct  | RhinoUiPrintWidthComboBoxItemData
struct  | RhinoUiUuidComboBoxItemData
struct  | tagRhinoUiOptionsListCtrlNM
 Macros
#define  | CRhinoUiCheckListBox CCheckListBox
if defined (ON_OS_WINDOWS) More...
#define  | CRhinoUiListBox CListBox
#define  | CRmaDib CRhinoDib
#define  | CRmaUiBitmapButton CRhinoUiBitmapButton
#define  | CRmaUiCheckBox CRhinoUiCheckBox
#define  | CRmaUiColorButton CRhinoUiColorButton
#define  | CRmaUiColorComboBox CRhinoUiColorComboBox
#define  | CRmaUiColorComboBoxItem CRhinoUiColorComboBoxItem
#define  | CRmaUiColorListBox CRhinoUiColorListBox
#define  | CRmaUiDialog CRhinoUiDialog
#define  | CRmaUiDialogItemResizer CRhinoUiDialogItemResizer
#define  | CRmaUiDialogSub CRhinoUiDialogSub
#define  | CRmaUiDirDialog CRhinoUiDirDialog
#define  | CRmaUiEditInt CRhinoUiEditInt
#define  | CRmaUiEditReal CRhinoUiEditReal
#define  | CRmaUiFontComboBox CRhinoUiFontComboBox
#define  | CRmaUiGradientSlider CRhinoUiGradientSliderCtrl
#define  | CRmaUiGridListCombo CRhinoUiGridListCombo
#define  | CRmaUiGridListCtrl CRhinoUiGridListCtrl
#define  | CRmaUiGridListEdit CRhinoUiGridListEdit
#define  | CRmaUiGridListHeaderCtrl CRhinoUiGridListHeaderCtrl
#define  | CRmaUiHyperlink CRhinoUiHyperlink
#define  | CRmaUiImageList CRhinoUiImageList
#define  | CRmaUiInPlace CRhinoUiInPlace
#define  | CRmaUiInPlaceButton CRhinoUiInPlaceButton
#define  | CRmaUiInPlaceEdit CRhinoUiInPlaceEdit
#define  | CRmaUiListBoxEx CRhinoUiListBoxEx
#define  | CRmaUiListBoxExBuddy CRhinoUiListBoxExBuddy
#define  | CRmaUiMemDC CRhinoUiMemDC
#define  | CRmaUiPopUpListWnd CRhinoUiPopUpListWnd
#define  | CRmaUiPopupMenu CRhinoUiPopupMenu
#define  | CRmaUiPopuUpListBox CRhinoUiPopuUpListBox
#define  | CRmaUiProgressBar CRhinoUiProgressBar
#define  | CRmaUiRichEditCtrl CRhinoUiRichEditCtrl
#define  | CRmaUiSeparator CRhinoUiSeparator
#define  | CRmaUiStatic CRhinoUiStatic
#define  | CRmaUiTextProgressCtrl CRhinoUiProgressCtrl
#define  | CRmaUiThemeDraw CRhinoUiThemeDraw
#define  | DIBColorDepth RhinoUiDIBColorDepth
#define  | DIBCopy RhinoUiDIBCopy
#define  | DIBCopyToClipboard RhinoUiDIBCopyToClipboard
#define  | DIBCopyToHandle RhinoUiDIBCopyToHandle
#define  | DIBCreate RhinoUiDIBCreate
#define  | DIBCreateHBitmap RhinoUiDIBCreateHBitmap
#define  | DIBFindBits RhinoUiDIBFindBits
#define  | DIBGet256Palette RhinoUiDIBGet256Palette
#define  | DIBHeight RhinoUiDIBHeight
#define  | DIBLineSize RhinoUiDIBLineSize
#define  | DIBNumColors RhinoUiDIBNumColors
#define  | DIBPaletteSize RhinoUiDIBPaletteSize
#define  | DIBScanWidth RhinoUiDIBScanWidth
#define  | DIBSet256IdentityPalette RhinoUiDIBSet256IdentityPalette
#define  | DIBSet256PalColors RhinoUiDIBSet256PalColors
#define  | DIBSize RhinoUiDIBSize
#define  | DIBSizeBits RhinoUiDIBSizeBits
#define  | DIBWidth RhinoUiDIBWidth
#define  | IDC_RHINOUI_GRIDLIST_COMBO (WM_USER * 2)
CRhinoUiGridListCombo. More...
#define  | RHINO_UI_COUNT_OF(array) ( sizeof(array) / sizeof( array[0]))
#define  | RMADIB_CALLOC RHINOUI_DIB_CALLOC
#define  | RMADIB_FREE RHINOUI_DIB_FREE
#define  | RMADIB_MALLOC RHINOUI_DIB_MALLOC
#define  | RmaDibInstallMemManager RhinoUiDibInstallMemManager
 Typedefs
typedef struct tagRhinoUiOptionsListCtrlNM *  | LPRhinoUiOptionsListCtrlNM
typedef struct tagRhinoUiOptionsListCtrlNM  | RhinoUiOptionsListCtrlNM
 Functions
RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions  | operator & (CRhinoUiPaintManager::DrawExpanderHeaderOptions a, CRhinoUiPaintManager::DrawExpanderHeaderOptions b)
RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions &  | operator &= (CRhinoUiPaintManager::DrawExpanderHeaderOptions &a, CRhinoUiPaintManager::DrawExpanderHeaderOptions b)
RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions  | operator| (CRhinoUiPaintManager::DrawExpanderHeaderOptions a, CRhinoUiPaintManager::DrawExpanderHeaderOptions b)
RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions &  | operator|= (CRhinoUiPaintManager::DrawExpanderHeaderOptions &a, CRhinoUiPaintManager::DrawExpanderHeaderOptions b)
RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions  | operator~ (CRhinoUiPaintManager::DrawExpanderHeaderOptions a)
RHINO_UILIB_DEFINE_GUID (RHINO_COMMAND_DOCK_BAR_ID, 0x1D3D1785, 0x2332, 0x428B, 0xA8, 0x38, 0xB2, 0xFE, 0x39, 0xEC, 0x50, 0xF4)
RHINO_UILIB_DEFINE_GUID (RHINO_CURVATURE_ANALYSIS_DOCK_BAR_ID, 0x948D3151, 0x91AA, 0x4959, 0xAD, 0x67, 0xBD, 0x49, 0xFB, 0xB2, 0x48, 0x79)
RHINO_UILIB_DEFINE_GUID (RHINO_CURVATURE_GRAPH_DOCK_BAR_ID, 0x54D560F5, 0xC1B2, 0x4BBA, 0x95, 0x34, 0x3C, 0x00, 0xE4, 0x0D, 0x30, 0x57)
RHINO_UILIB_DEFINE_GUID (RHINO_DRAFT_ANGLE_DOCK_BAR_ID, 0xF814F8D8, 0xEEC0, 0x46FD, 0x85, 0x85, 0xE0, 0xE8, 0x48, 0x6A, 0xB8, 0x4D)
RHINO_UILIB_DEFINE_GUID (RHINO_THICKNESS_DISP_DOCK_BAR_ID, 0xc0c9e0f1, 0xd554, 0x453b, 0x87, 0x12, 0xa0, 0x20, 0xac, 0xe0, 0xb8, 0xe4)
RHINO_UILIB_DEFINE_GUID (RHINO_EDGE_ANALYSIS_DOCK_BAR_ID, 0xC9FB93D6, 0xC1AB, 0x4464, 0xAD, 0x3A, 0xED, 0x2A, 0x8B, 0xC1, 0x20, 0x9B)
RHINO_UILIB_DEFINE_GUID (RHINO_EMAP_DOCK_BAR_ID, 0xCA1753B1, 0xAE23, 0x4880, 0xAD, 0x93, 0x39, 0xB5, 0x29, 0x95, 0x22, 0xE6)
RHINO_UILIB_DEFINE_GUID (RHINO_OSNAP_DOCK_BAR_ID, 0xd3c4a392, 0x88de, 0x4c4f, 0x88, 0xa4, 0xba, 0x56, 0x36, 0xef, 0x7f, 0x38)
RHINO_UILIB_DEFINE_GUID (RHINO_VIEW_MANAGER_DOCK_BAR_ID, 0x844b3278, 0xe78e, 0x4844, 0x86, 0x8d, 0x63, 0x9b, 0x9b, 0x65, 0x46, 0x50)
RHINO_UILIB_DEFINE_GUID (RHINO_ZEBRA_DOCK_BAR_ID, 0x36EF80FE, 0x7D51, 0x41EE, 0x80, 0x44, 0xF1, 0x7B, 0x10, 0x73, 0x09, 0xCB)
RHINO_UILIB_DEFINE_GUID (RHINO_SELECTION_FILTER_DOCK_BAR_ID, 0x918191ca, 0x1105, 0x43f9, 0xa3, 0x4a, 0xdd, 0xa4, 0x27, 0x68, 0x83, 0xc1)
RHINO_UILIB_DEFINE_GUID (RHINO_CLASH_DOCK_BAR_ID, 0x770ff06a, 0xd775, 0x41e4, 0xbb, 0xc7, 0x9f, 0x32, 0xed, 0x18, 0x9b, 0x5e)
RHINO_UILIB_DEFINE_GUID (RHINO_CONTOUR_ANALYSIS_DOCK_BAR_ID, 0xa0f238df, 0x1898, 0x47cf, 0x91, 0x9d, 0xf8, 0x4d, 0xe9, 0x5a, 0x0b, 0xb9)
RHINO_UILIB_DEFINE_GUID (RHINO_DOCKBARTAB_LAYER, 0x3610bf83, 0x047d, 0x4f7f, 0x93, 0xfd, 0x16, 0x3e, 0xa3, 0x05, 0xb4, 0x93)
RHINO_UILIB_DEFINE_GUID (RHINO_DOCKBARTAB_PROPERTIES, 0x34ffb674, 0xc504, 0x49d9, 0x9f, 0xcd, 0x99, 0xcc, 0x81, 0x1d, 0xcd, 0xa2)
RHINO_UILIB_DEFINE_GUID (RHINO_END_ANALYSIS_DOCK_BAR_ID, 0x4c2d9eed, 0xbc64, 0x48ba, 0xb9, 0x10, 0x40, 0xa0, 0xe6, 0x5c, 0xa, 0xe3)
RHINO_UILIB_DEFINE_GUID (RHINO_DIRECTION_ANALYSIS_DOCK_BAR_ID, 0x9a0a0262, 0x6e97, 0x4bb6, 0xa9, 0xc, 0x4f, 0xd7, 0x93, 0x1, 0xd6, 0x77)
RHINO_UILIB_DEFINE_GUID (RHINO_DRAG_STRENGTH_DOCK_BAR_ID, 0x50eb6c7b, 0xbe0, 0x4166, 0xad, 0x17, 0xea, 0x69, 0x4c, 0x97, 0xa6, 0xf4)
RHINO_UILIB_DEFINE_GUID (RHINO_UI_FILE_OPEN_EVENT, 0x5fa9bc7f, 0xd8ef, 0x40fd, 0x91, 0xf4, 0x57, 0xcf, 0xf2, 0x22, 0xcd, 0xe2)
RHINO_UILIB_DEFINE_GUID (RHINO_UI_FILE_CLOSED_EVENT, 0x2395e5fc, 0xdf89, 0x49bd, 0xa6, 0xee, 0x2e, 0xe0, 0x0, 0x10, 0x24, 0xb5)
RHINO_UILIB_DEFINE_GUID (RHINO_UI_FILE_MACRO_NEW_EVENT, 0x498d441f, 0x66, 0x48ab, 0x87, 0xd, 0x7c, 0xcc, 0x4b, 0x34, 0x10, 0xa3)
RHINO_UILIB_DEFINE_GUID (RHINO_UI_FILE_MACRO_DELETE_EVENT, 0x221ecf6b, 0xe12, 0x4a3b, 0xae, 0x4b, 0x91, 0xe4, 0xde, 0x75, 0xa, 0x5f)
RHINO_UILIB_DEFINE_GUID (RHINO_UI_FILE_MACRO_MODIFIED_EVENT, 0x7f30da3f, 0x54cb, 0x4964, 0xbf, 0xff, 0xf, 0x28, 0x79, 0x87, 0x6f, 0x85)
RHINO_SDK_FUNCTION bool  | RhinoOnToolBarButtonClicked (const wchar_t *lpsMacro, const wchar_t *lpsTooltip)
RHINO_SDK_FUNCTION int  | RhinoRoundOff (double x)
void *  | RHINOUI_DIB_CALLOC (size_t num, size_t size)
void  | RHINOUI_DIB_FREE (void *memblock)
void *  | RHINOUI_DIB_MALLOC (size_t size)
void RHINO_SDK_FUNCTION  | RhinoUiColorComboBoxItemDataInit (RhinoUiColorComboBoxItemData &data)
RHINO_SDK_FUNCTION bool  | RhinoUiColorDialog (CWnd *pWndParent, ON_Color &color, bool include_button_colors=false, const wchar_t *dialog_title=NULL)
void  | RhinoUiDibInstallMemManager (void *(*my_calloc)(size_t num, size_t size), void *(*my_malloc)(size_t size), void(*my_free)(void *memblock))
RHINO_SDK_FUNCTION CRhinoUiDockBarManager &  | RhinoUiDockBarManager ()
void RHINO_SDK_FUNCTION  | RhinoUiFontComboBoxItemDataInit (RhinoUiFontComboBoxItemData &data)
void RHINO_SDK_FUNCTION  | RhinoUiLayerComboBoxItemDataInit (RhinoUiLayerComboBoxItemData &data)
UINT  | RhinoUiLayerListCtrlColumnClickMessageId ()
void RHINO_SDK_FUNCTION  | RhinoUiLinetypeComboBoxItemDataInit (RhinoUiLinetypeComboBoxItemData &data)
RHINO_SDK_FUNCTION CFrameWnd *  | RhinoUiMainFrame ()
RHINO_SDK_FUNCTION HWND  | RhinoUiMainFrameHWND ()
RHINO_SDK_FUNCTION CRhinoUiManager &  | RhinoUiManager ()
RHINO_SDK_FUNCTION CRhinoUiModlessDockingDialogManager &  | RhinoUiModlessDockingDialogManager ()
RHINO_SDK_FUNCTION AFX_MODULE_STATE *  | RhinoUiModuleState ()
RHINO_SDK_FUNCTION CRhinoUiPageDockBarManager &  | RhinoUiPageDockBarManager ()
RHINO_SDK_FUNCTION CRhinoUiPaintManager &  | RhinoUiPaintManager ()
void RHINO_SDK_FUNCTION  | RhinoUiPrintWidthComboBoxItemDataInit (RhinoUiPrintWidthComboBoxItemData &data)
RHINO_SDK_FUNCTION CRhinoUiResourceManager &  | RhinoUiResourceManager ()
RHINO_SDK_FUNCTION bool  | RhinoUiScaleLocalizedFonts ()
RHINO_SDK_FUNCTION bool  | RhinoUiScaleLocalizedFonts (UINT &nSize)
Detailed Description
Macro Definition Documentation
◆ CRhinoUiCheckListBox
 #define CRhinoUiCheckListBox CCheckListBox
if defined (ON_OS_WINDOWS)
◆ CRhinoUiListBox
 #define CRhinoUiListBox CListBox
RhinoSdkUiCheckListBox.h
◆ CRmaDib
 #define CRmaDib CRhinoDib
 RmaDib specific
◆ CRmaUiBitmapButton
 #define CRmaUiBitmapButton CRhinoUiBitmapButton
NoKeywords
/ / Copyright (c) 1993-2007 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////-------------------------------------------------------------— Map old clas names to new ones
◆ CRmaUiCheckBox
 #define CRmaUiCheckBox CRhinoUiCheckBox
◆ CRmaUiColorButton
 #define CRmaUiColorButton CRhinoUiColorButton
◆ CRmaUiColorComboBox
 #define CRmaUiColorComboBox CRhinoUiColorComboBox
◆ CRmaUiColorComboBoxItem
 #define CRmaUiColorComboBoxItem CRhinoUiColorComboBoxItem
◆ CRmaUiColorListBox
 #define CRmaUiColorListBox CRhinoUiColorListBox
◆ CRmaUiDialog
 #define CRmaUiDialog CRhinoUiDialog
◆ CRmaUiDialogItemResizer
 #define CRmaUiDialogItemResizer CRhinoUiDialogItemResizer
◆ CRmaUiDialogSub
 #define CRmaUiDialogSub CRhinoUiDialogSub
◆ CRmaUiDirDialog
 #define CRmaUiDirDialog CRhinoUiDirDialog
◆ CRmaUiEditInt
 #define CRmaUiEditInt CRhinoUiEditInt
◆ CRmaUiEditReal
 #define CRmaUiEditReal CRhinoUiEditReal
◆ CRmaUiFontComboBox
 #define CRmaUiFontComboBox CRhinoUiFontComboBox
◆ CRmaUiGradientSlider
 #define CRmaUiGradientSlider CRhinoUiGradientSliderCtrl
◆ CRmaUiGridListCombo
 #define CRmaUiGridListCombo CRhinoUiGridListCombo
◆ CRmaUiGridListCtrl
 #define CRmaUiGridListCtrl CRhinoUiGridListCtrl
◆ CRmaUiGridListEdit
 #define CRmaUiGridListEdit CRhinoUiGridListEdit
◆ CRmaUiGridListHeaderCtrl
 #define CRmaUiGridListHeaderCtrl CRhinoUiGridListHeaderCtrl
◆ CRmaUiHyperlink
 #define CRmaUiHyperlink CRhinoUiHyperlink
◆ CRmaUiImageList
 #define CRmaUiImageList CRhinoUiImageList
◆ CRmaUiInPlace
 #define CRmaUiInPlace CRhinoUiInPlace
◆ CRmaUiInPlaceButton
 #define CRmaUiInPlaceButton CRhinoUiInPlaceButton
◆ CRmaUiInPlaceEdit
 #define CRmaUiInPlaceEdit CRhinoUiInPlaceEdit
◆ CRmaUiListBoxEx
 #define CRmaUiListBoxEx CRhinoUiListBoxEx
◆ CRmaUiListBoxExBuddy
 #define CRmaUiListBoxExBuddy CRhinoUiListBoxExBuddy
◆ CRmaUiMemDC
 #define CRmaUiMemDC CRhinoUiMemDC
◆ CRmaUiPopUpListWnd
 #define CRmaUiPopUpListWnd CRhinoUiPopUpListWnd
◆ CRmaUiPopupMenu
 #define CRmaUiPopupMenu CRhinoUiPopupMenu
◆ CRmaUiPopuUpListBox
 #define CRmaUiPopuUpListBox CRhinoUiPopuUpListBox
◆ CRmaUiProgressBar
 #define CRmaUiProgressBar CRhinoUiProgressBar
◆ CRmaUiRichEditCtrl
 #define CRmaUiRichEditCtrl CRhinoUiRichEditCtrl
◆ CRmaUiSeparator
 #define CRmaUiSeparator CRhinoUiSeparator
◆ CRmaUiStatic
 #define CRmaUiStatic CRhinoUiStatic
◆ CRmaUiTextProgressCtrl
 #define CRmaUiTextProgressCtrl CRhinoUiProgressCtrl
◆ CRmaUiThemeDraw
 #define CRmaUiThemeDraw CRhinoUiThemeDraw
◆ DIBColorDepth
 #define DIBColorDepth RhinoUiDIBColorDepth
◆ DIBCopy
 #define DIBCopy RhinoUiDIBCopy
◆ DIBCopyToClipboard
 #define DIBCopyToClipboard RhinoUiDIBCopyToClipboard
◆ DIBCopyToHandle
 #define DIBCopyToHandle RhinoUiDIBCopyToHandle
◆ DIBCreate
 #define DIBCreate RhinoUiDIBCreate
◆ DIBCreateHBitmap
 #define DIBCreateHBitmap RhinoUiDIBCreateHBitmap
◆ DIBFindBits
 #define DIBFindBits RhinoUiDIBFindBits
◆ DIBGet256Palette
 #define DIBGet256Palette RhinoUiDIBGet256Palette
◆ DIBHeight
 #define DIBHeight RhinoUiDIBHeight
◆ DIBLineSize
 #define DIBLineSize RhinoUiDIBLineSize
◆ DIBNumColors
 #define DIBNumColors RhinoUiDIBNumColors
◆ DIBPaletteSize
 #define DIBPaletteSize RhinoUiDIBPaletteSize
◆ DIBScanWidth
 #define DIBScanWidth RhinoUiDIBScanWidth
◆ DIBSet256IdentityPalette
 #define DIBSet256IdentityPalette RhinoUiDIBSet256IdentityPalette
◆ DIBSet256PalColors
 #define DIBSet256PalColors RhinoUiDIBSet256PalColors
◆ DIBSize
 #define DIBSize RhinoUiDIBSize
◆ DIBSizeBits
 #define DIBSizeBits RhinoUiDIBSizeBits
◆ DIBWidth
 #define DIBWidth RhinoUiDIBWidth
◆ IDC_RHINOUI_GRIDLIST_COMBO
 #define IDC_RHINOUI_GRIDLIST_COMBO (WM_USER * 2)
CRhinoUiGridListCombo.
NoKeywords
/ / Copyright (c) 1993-2007 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
◆ RHINO_UI_COUNT_OF
 #define RHINO_UI_COUNT_OF |  ( |    |  array | ) |   ( sizeof(array) / sizeof( array[0]))
NoKeywords
/ / Copyright (c) 1993-2007 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
◆ RMADIB_CALLOC
 #define RMADIB_CALLOC RHINOUI_DIB_CALLOC
◆ RMADIB_FREE
 #define RMADIB_FREE RHINOUI_DIB_FREE
◆ RMADIB_MALLOC
 #define RMADIB_MALLOC RHINOUI_DIB_MALLOC
◆ RmaDibInstallMemManager
 #define RmaDibInstallMemManager RhinoUiDibInstallMemManager
Typedef Documentation
◆ LPRhinoUiOptionsListCtrlNM
 typedef struct tagRhinoUiOptionsListCtrlNM * LPRhinoUiOptionsListCtrlNM
◆ RhinoUiOptionsListCtrlNM
 typedef struct tagRhinoUiOptionsListCtrlNM RhinoUiOptionsListCtrlNM
Function Documentation
◆ operator &()
 RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions operator&  |  ( |  CRhinoUiPaintManager::DrawExpanderHeaderOptions  |  a,
|  CRhinoUiPaintManager::DrawExpanderHeaderOptions  |  b
)
◆ operator &=()
 RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions& operator&=  |  ( |  CRhinoUiPaintManager::DrawExpanderHeaderOptions &  |  a,
|  CRhinoUiPaintManager::DrawExpanderHeaderOptions  |  b
)
◆ operator|()
 RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions operator|  |  ( |  CRhinoUiPaintManager::DrawExpanderHeaderOptions  |  a,
|  CRhinoUiPaintManager::DrawExpanderHeaderOptions  |  b
)
◆ operator|=()
 RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions& operator|=  |  ( |  CRhinoUiPaintManager::DrawExpanderHeaderOptions &  |  a,
|  CRhinoUiPaintManager::DrawExpanderHeaderOptions  |  b
)
◆ operator~()
 RHINO_SDK_FUNCTION CRhinoUiPaintManager::DrawExpanderHeaderOptions operator~  |  ( |  CRhinoUiPaintManager::DrawExpanderHeaderOptions  |  a | )
◆ RHINO_UILIB_DEFINE_GUID() [1/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_COMMAND_DOCK_BAR_ID  |  ,
|  0x1D3D1785  |  ,
|  0x2332  |  ,
|  0x428B  |  ,
|  0xA8  |  ,
|  0x38  |  ,
|  0xB2  |  ,
|  0xFE  |  ,
|  0x39  |  ,
|  0xEC  |  ,
|  0x50  |  ,
|  0xF4
)
The above macro does not use legal C++. You cannot both declare and define a variable in a header file that is included everywhere. The following lines only declare the global variables and are duplicated in MacHelpers.mm to define the variables once.
◆ RHINO_UILIB_DEFINE_GUID() [2/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_CURVATURE_ANALYSIS_DOCK_BAR_ID  |  ,
|  0x948D3151  |  ,
|  0x91AA  |  ,
|  0x4959  |  ,
|  0xAD  |  ,
|  0x67  |  ,
|  0xBD  |  ,
|  0x49  |  ,
|  0xFB  |  ,
|  0xB2  |  ,
|  0x48  |  ,
|  0x79
)
◆ RHINO_UILIB_DEFINE_GUID() [3/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_CURVATURE_GRAPH_DOCK_BAR_ID  |  ,
|  0x54D560F5  |  ,
|  0xC1B2  |  ,
|  0x4BBA  |  ,
|  0x95  |  ,
|  0x34  |  ,
|  0x3C  |  ,
|  0x00  |  ,
|  0xE4  |  ,
|  0x0D  |  ,
|  0x30  |  ,
|  0x57
)
◆ RHINO_UILIB_DEFINE_GUID() [4/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_DRAFT_ANGLE_DOCK_BAR_ID  |  ,
|  0xF814F8D8  |  ,
|  0xEEC0  |  ,
|  0x46FD  |  ,
|  0x85  |  ,
|  0x85  |  ,
|  0xE0  |  ,
|  0xE8  |  ,
|  0x48  |  ,
|  0x6A  |  ,
|  0xB8  |  ,
|  0x4D
)
◆ RHINO_UILIB_DEFINE_GUID() [5/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_THICKNESS_DISP_DOCK_BAR_ID  |  ,
|  0xc0c9e0f1  |  ,
|  0xd554  |  ,
|  0x453b  |  ,
|  0x87  |  ,
|  0x12  |  ,
|  0xa0  |  ,
|  0x20  |  ,
|  0xac  |  ,
|  0xe0  |  ,
|  0xb8  |  ,
|  0xe4
)
◆ RHINO_UILIB_DEFINE_GUID() [6/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_EDGE_ANALYSIS_DOCK_BAR_ID  |  ,
|  0xC9FB93D6  |  ,
|  0xC1AB  |  ,
|  0x4464  |  ,
|  0xAD  |  ,
|  0x3A  |  ,
|  0xED  |  ,
|  0x2A  |  ,
|  0x8B  |  ,
|  0xC1  |  ,
|  0x20  |  ,
|  0x9B
)
◆ RHINO_UILIB_DEFINE_GUID() [7/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_EMAP_DOCK_BAR_ID  |  ,
|  0xCA1753B1  |  ,
|  0xAE23  |  ,
|  0x4880  |  ,
|  0xAD  |  ,
|  0x93  |  ,
|  0x39  |  ,
|  0xB5  |  ,
|  0x29  |  ,
|  0x95  |  ,
|  0x22  |  ,
|  0xE6
)
◆ RHINO_UILIB_DEFINE_GUID() [8/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_OSNAP_DOCK_BAR_ID  |  ,
|  0xd3c4a392  |  ,
|  0x88de  |  ,
|  0x4c4f  |  ,
|  0x88  |  ,
|  0xa4  |  ,
|  0xba  |  ,
|  0x56  |  ,
|  0x36  |  ,
|  0xef  |  ,
|  0x7f  |  ,
|  0x38
)
◆ RHINO_UILIB_DEFINE_GUID() [9/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_VIEW_MANAGER_DOCK_BAR_ID  |  ,
|  0x844b3278  |  ,
|  0xe78e  |  ,
|  0x4844  |  ,
|  0x86  |  ,
|  0x8d  |  ,
|  0x63  |  ,
|  0x9b  |  ,
|  0x9b  |  ,
|  0x65  |  ,
|  0x46  |  ,
|  0x50
)
◆ RHINO_UILIB_DEFINE_GUID() [10/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_ZEBRA_DOCK_BAR_ID  |  ,
|  0x36EF80FE  |  ,
|  0x7D51  |  ,
|  0x41EE  |  ,
|  0x80  |  ,
|  0x44  |  ,
|  0xF1  |  ,
|  0x7B  |  ,
|  0x10  |  ,
|  0x73  |  ,
|  0x09  |  ,
|  0xCB
)
◆ RHINO_UILIB_DEFINE_GUID() [11/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_SELECTION_FILTER_DOCK_BAR_ID  |  ,
|  0x918191ca  |  ,
|  0x1105  |  ,
|  0x43f9  |  ,
|  0xa3  |  ,
|  0x4a  |  ,
|  0xdd  |  ,
|  0xa4  |  ,
|  0x27  |  ,
|  0x68  |  ,
|  0x83  |  ,
|  0xc1
)
◆ RHINO_UILIB_DEFINE_GUID() [12/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_CLASH_DOCK_BAR_ID  |  ,
|  0x770ff06a  |  ,
|  0xd775  |  ,
|  0x41e4  |  ,
|  0xbb  |  ,
|  0xc7  |  ,
|  0x9f  |  ,
|  0x32  |  ,
|  0xed  |  ,
|  0x18  |  ,
|  0x9b  |  ,
|  0x5e
)
◆ RHINO_UILIB_DEFINE_GUID() [13/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_CONTOUR_ANALYSIS_DOCK_BAR_ID  |  ,
|  0xa0f238df  |  ,
|  0x1898  |  ,
|  0x47cf  |  ,
|  0x91  |  ,
|  0x9d  |  ,
|  0xf8  |  ,
|  0x4d  |  ,
|  0xe9  |  ,
|  0x5a  |  ,
|  0x0b  |  ,
|  0xb9
)
◆ RHINO_UILIB_DEFINE_GUID() [14/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_DOCKBARTAB_LAYER  |  ,
|  0x3610bf83  |  ,
|  0x047d  |  ,
|  0x4f7f  |  ,
|  0x93  |  ,
|  0xfd  |  ,
|  0x16  |  ,
|  0x3e  |  ,
|  0xa3  |  ,
|  0x05  |  ,
|  0xb4  |  ,
|  0x93
)
Removed - these control bars are now included in the docking tab system. RHINO_UILIB_DEFINE_GUID( RHINO_LAYER_DOCK_BAR_ID, 0x16B641D3, 0x75AF, 0x4D2C, 0x86, 0x1E, 0xB9, 0x6E, 0x38, 0x7B, 0x6F, 0x80); RHINO_UILIB_DEFINE_GUID( RHINO_LAYER_MANAGER_DOCK_BAR_ID, 0x2363ed67, 0x616d, 0x4861, 0x9e, 0x87, 0xe2, 0xfe, 0x8f, 0xe7, 0x88, 0xa5); RHINO_UILIB_DEFINE_GUID( RHINO_PROPERTIES_DOCK_BAR_ID, 0x20A1348C, 0xD529, 0x44F6, 0x8B, 0xD3, 0xEC, 0x8C, 0x00, 0x1B, 0x2B, 0xB7); RHINO_UILIB_DEFINE_GUID( RHINO_NOTES_DOCK_BAR_ID, 0x6641B35A, 0xA21E, 0x4350, 0xA5, 0xF7, 0xCC, 0xCA, 0x3E, 0xC6, 0xAC, 0x72); RHINO_UILIB_DEFINE_GUID( RHINO_COMMAND_CONTEXT_BAR_ID, 0x7dd6a049, 0x72ca, 0x457d, 0xbf, 0x12, 0x37, 0x10, 0x0d, 0x7e, 0xe9, 0x67);
◆ RHINO_UILIB_DEFINE_GUID() [15/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_DOCKBARTAB_PROPERTIES  |  ,
|  0x34ffb674  |  ,
|  0xc504  |  ,
|  0x49d9  |  ,
|  0x9f  |  ,
|  0xcd  |  ,
|  0x99  |  ,
|  0xcc  |  ,
|  0x81  |  ,
|  0x1d  |  ,
|  0xcd  |  ,
|  0xa2
)
◆ RHINO_UILIB_DEFINE_GUID() [16/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_END_ANALYSIS_DOCK_BAR_ID  |  ,
|  0x4c2d9eed  |  ,
|  0xbc64  |  ,
|  0x48ba  |  ,
|  0xb9  |  ,
|  0x10  |  ,
|  0x40  |  ,
|  0xa0  |  ,
|  0xe6  |  ,
|  0x5c  |  ,
|  0xa  |  ,
|  0xe3
)
◆ RHINO_UILIB_DEFINE_GUID() [17/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_DIRECTION_ANALYSIS_DOCK_BAR_ID  |  ,
|  0x9a0a0262  |  ,
|  0x6e97  |  ,
|  0x4bb6  |  ,
|  0xa9  |  ,
|  0xc  |  ,
|  0x4f  |  ,
|  0xd7  |  ,
|  0x93  |  ,
|  0x1  |  ,
|  0xd6  |  ,
|  0x77
)
◆ RHINO_UILIB_DEFINE_GUID() [18/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_DRAG_STRENGTH_DOCK_BAR_ID  |  ,
|  0x50eb6c7b  |  ,
|  0xbe0  |  ,
|  0x4166  |  ,
|  0xad  |  ,
|  0x17  |  ,
|  0xea  |  ,
|  0x69  |  ,
|  0x4c  |  ,
|  0x97  |  ,
|  0xa6  |  ,
|  0xf4
)
◆ RHINO_UILIB_DEFINE_GUID() [19/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_UI_FILE_OPEN_EVENT  |  ,
|  0x5fa9bc7f  |  ,
|  0xd8ef  |  ,
|  0x40fd  |  ,
|  0x91  |  ,
|  0xf4  |  ,
|  0x57  |  ,
|  0xcf  |  ,
|  0xf2  |  ,
|  0x22  |  ,
|  0xcd  |  ,
|  0xe2
)
CRhinoUiFileEvent Event Id's
 Description: CRhinoUiFileEvent File opened event {5FA9BC7F-D8EF-40FD-91F4-57CFF222CDE2}
◆ RHINO_UILIB_DEFINE_GUID() [20/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_UI_FILE_CLOSED_EVENT  |  ,
|  0x2395e5fc  |  ,
|  0xdf89  |  ,
|  0x49bd  |  ,
|  0xa6  |  ,
|  0xee  |  ,
|  0x2e  |  ,
|  0xe0  |  ,
|  0x0  |  ,
|  0x10  |  ,
|  0x24  |  ,
|  0xb5
)
 Description: CRhinoUiFileEvent File closed event {2395E5FC-DF89-49BD-A6EE-2EE0001024B5}
◆ RHINO_UILIB_DEFINE_GUID() [21/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_UI_FILE_MACRO_NEW_EVENT  |  ,
|  0x498d441f  |  ,
|  0x66  |  ,
|  0x48ab  |  ,
|  0x87  |  ,
|  0xd  |  ,
|  0x7c  |  ,
|  0xcc  |  ,
|  0x4b  |  ,
|  0x34  |  ,
|  0x10  |  ,
|  0xa3
)
 Description: CRhinoUiFileEvent new macro added event {498D441F-0066-48AB-870D-7CCC4B3410A3}
◆ RHINO_UILIB_DEFINE_GUID() [22/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_UI_FILE_MACRO_DELETE_EVENT  |  ,
|  0x221ecf6b  |  ,
|  0xe12  |  ,
|  0x4a3b  |  ,
|  0xae  |  ,
|  0x4b  |  ,
|  0x91  |  ,
|  0xe4  |  ,
|  0xde  |  ,
|  0x75  |  ,
|  0xa  |  ,
|  0x5f
)
 Description: CRhinoUiFileEvent macro deleted event {221ECF6B-0E12-4A3B-AE4B-91E4DE750A5F}
◆ RHINO_UILIB_DEFINE_GUID() [23/23]
 RHINO_UILIB_DEFINE_GUID  |  ( |  RHINO_UI_FILE_MACRO_MODIFIED_EVENT  |  ,
|  0x7f30da3f  |  ,
|  0x54cb  |  ,
|  0x4964  |  ,
|  0xbf  |  ,
|  0xff  |  ,
|  0xf  |  ,
|  0x28  |  ,
|  0x79  |  ,
|  0x87  |  ,
|  0x6f  |  ,
|  0x85
)
 Description: CRhinoUiFileEvent existing macro modified event {7F30DA3F-54CB-4964-BFFF-0F2879876F85}
◆ RhinoOnToolBarButtonClicked()
 RHINO_SDK_FUNCTION bool RhinoOnToolBarButtonClicked  |  ( |  const wchar_t *  |  lpsMacro,
|  const wchar_t *  |  lpsTooltip
)
◆ RhinoRoundOff()
 RHINO_SDK_FUNCTION int RhinoRoundOff  |  ( |  double  |  x | )
◆ RHINOUI_DIB_CALLOC()
 void* RHINOUI_DIB_CALLOC  |  ( |  size_t  |  num,
|  size_t  |  size
)
◆ RHINOUI_DIB_FREE()
 void RHINOUI_DIB_FREE  |  ( |  void *  |  memblock | )
◆ RHINOUI_DIB_MALLOC()
 void* RHINOUI_DIB_MALLOC  |  ( |  size_t  |  size | )
◆ RhinoUiColorComboBoxItemDataInit()
 void RHINO_SDK_FUNCTION RhinoUiColorComboBoxItemDataInit  |  ( |  RhinoUiColorComboBoxItemData &  |  data | )
◆ RhinoUiColorDialog()
 RHINO_SDK_FUNCTION bool RhinoUiColorDialog  |  ( |  CWnd *  |  pWndParent,
|  ON_Color &  |  color,
|  bool  |  include_button_colors = false,
|  const wchar_t *  |  dialog_title = NULL
)
◆ RhinoUiDibInstallMemManager()
 void RhinoUiDibInstallMemManager  |  ( |  void *(*)(size_t num, size_t size)  |  my_calloc,
|  void *(*)(size_t size)  |  my_malloc,
|  void(*)(void *memblock)  |  my_free
)
NoKeywords
/ / Copyright (c) 1993-2007 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Assoicates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / ////////////////////////////////////////////////////////////// RhinoSDKUiDibMac.h MacRhino version of CRhinoDib
Created by Marlin Prowell on 6/29/06. Copyright 2006 Robert McNeel & Associates. All rights reserved.
◆ RhinoUiDockBarManager()
 RHINO_SDK_FUNCTION CRhinoUiDockBarManager& RhinoUiDockBarManager  |  ( |   | )
◆ RhinoUiFontComboBoxItemDataInit()
 void RHINO_SDK_FUNCTION RhinoUiFontComboBoxItemDataInit  |  ( |  RhinoUiFontComboBoxItemData &  |  data | )
◆ RhinoUiLayerComboBoxItemDataInit()
 void RHINO_SDK_FUNCTION RhinoUiLayerComboBoxItemDataInit  |  ( |  RhinoUiLayerComboBoxItemData &  |  data | )
◆ RhinoUiLayerListCtrlColumnClickMessageId()
 UINT RhinoUiLayerListCtrlColumnClickMessageId  |  ( |   | )
◆ RhinoUiLinetypeComboBoxItemDataInit()
 void RHINO_SDK_FUNCTION RhinoUiLinetypeComboBoxItemDataInit  |  ( |  RhinoUiLinetypeComboBoxItemData &  |  data | )
◆ RhinoUiMainFrame()
 RHINO_SDK_FUNCTION CFrameWnd* RhinoUiMainFrame  |  ( |   | )
◆ RhinoUiMainFrameHWND()
 RHINO_SDK_FUNCTION HWND RhinoUiMainFrameHWND  |  ( |   | )
◆ RhinoUiManager()
 RHINO_SDK_FUNCTION CRhinoUiManager& RhinoUiManager  |  ( |   | )
◆ RhinoUiModlessDockingDialogManager()
 RHINO_SDK_FUNCTION CRhinoUiModlessDockingDialogManager& RhinoUiModlessDockingDialogManager  |  ( |   | )
◆ RhinoUiModuleState()
 RHINO_SDK_FUNCTION AFX_MODULE_STATE* RhinoUiModuleState  |  ( |   | )
◆ RhinoUiPageDockBarManager()
 RHINO_SDK_FUNCTION CRhinoUiPageDockBarManager& RhinoUiPageDockBarManager  |  ( |   | )
◆ RhinoUiPaintManager()
 RHINO_SDK_FUNCTION CRhinoUiPaintManager& RhinoUiPaintManager  |  ( |   | )
◆ RhinoUiPrintWidthComboBoxItemDataInit()
 void RHINO_SDK_FUNCTION RhinoUiPrintWidthComboBoxItemDataInit  |  ( |  RhinoUiPrintWidthComboBoxItemData &  |  data | )
◆ RhinoUiResourceManager()
 RHINO_SDK_FUNCTION CRhinoUiResourceManager& RhinoUiResourceManager  |  ( |   | )
◆ RhinoUiScaleLocalizedFonts() [1/2]
 RHINO_SDK_FUNCTION bool RhinoUiScaleLocalizedFonts  |  ( |   | )
NoKeywords
/ / Copyright (c) 1993-2007 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
◆ RhinoUiScaleLocalizedFonts() [2/2]
 RHINO_SDK_FUNCTION bool RhinoUiScaleLocalizedFonts  |  ( |  UINT &  |  nSize | )